{
    "book_id": "1660387",
    "mid": "/m/05lg2_",
    "title": "2001: A Space Odyssey",
    "author": "Arthur C. Clarke",
    "publication_date": "1968",
    "genres": [
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " In the background to the story in the book, an ancient and unseen alien race uses a device with the appearance of a large crystalline monolith to investigate worlds all across the galaxy and, if possible, to encourage the development of intelligent life. The book shows one such monolith appearing in ancient Africa, 3 million years B.C. (in the movie, this was altered to 4 million years), where it inspires a starving group of the hominid ancestors of human beings to develop tools. The ape-men use their tools to kill animals and eat meat, ending their starvation. They then use the tools to kill a leopard that had been preying on them; the next day, the main ape character, Moon-Watcher, uses a club to kill the leader of a rival tribe. Moon-Watcher reflects that though he is now master of the world, he is unsure of what to do next—but he will think of something. The book suggests that the monolith was instrumental in awakening intelligence, and enabling the transition of the ape-men to a higher order, with the ability to fashion crude tools and thereby be able to hunt and forage for food in a much more efficient fashion. The book then leaps ahead a few million years to the year 1999, detailing Dr. Heywood Floyd's travel to Clavius Base on the Moon. Upon his arrival, Floyd attends a meeting. A lead scientist explains that they have found a magnetic disturbance in Tycho, one of the Moon's craters, designated Tycho Magnetic Anomaly One, or TMA-1. An excavation of the area has revealed a large black slab; it is precisely fashioned to a ratio of exactly 1:4:9, or 1²:2²:3²—that is to say that the thickness of the slab is exactly 1/4 of its width and 1/9 of its height. Such a construction rules out any naturally-occurring phenomena, and at three million years of age, it was not crafted by human hands. It is the first evidence for the existence of extraterrestrial intelligent life. Floyd and a team of scientists drive across the moon to actually view TMA-1. They arrive just as sunlight hits upon it for the first time in three million years. It then sends a piercing radio transmission to the far reaches of the solar system. The signal is tracked to one of the moons of Saturn, Japetus (Iapetus), where an expedition is then planned to investigate. The book leaps forward 18 months to 2001 to the Discovery One mission to Saturn. Dr. David Bowman and Dr. Francis Poole are the only conscious human beings aboard Discovery One spaceship. Their three other colleagues are in a state of suspended animation, to be awakened when they near Saturn. The HAL 9000, an artificially intelligent computer addressed as \"HAL,\" maintains the ship and is a vital part of life aboard. While Poole is receiving a birthday message from his family back home, HAL tells Bowman that the AE-35 unit of the ship is going to malfunction. The AE-35 unit is responsible for keeping their communication dish aimed at Earth; without it, receiving support would be impossible. Poole takes one of the extra-vehicular pods and swaps the AE-35 unit. But when Bowman conducts tests on the AE-35 unit that has been replaced, he determines that there was never anything wrong with it. Poole and Bowman become suspicious at HAL's refusal to admit that there could be something wrong with his failure detection sensors. HAL then claims that the replacement AE-35 unit will fail. Poole and Bowman radio back to Earth; they are told that there is most definitely something wrong with HAL, and are directed to disconnect him for analysis. These instructions are interrupted as the signal is broken. HAL informs them that the AE-35 unit has malfunctioned. Poole takes a pod outside the ship to bring in the failed AE-35 unit. As he is removing the unit, the pod, which he had left parked close by, on the ship's hull, begins moving toward him. He is powerless to move out of the way in time and is killed when his spacesuit is torn, exposing him to the vacuum of space. Bowman is shocked by Poole's death and is deeply distressed. He is unsure whether HAL, a machine, really could have killed Poole. He decides that he will need to wake up the other three astronauts. He has an argument with HAL, with HAL refusing to obey his orders to switch the hibernation pods to manual operation, insisting that Bowman is incapacitated. Bowman threatens to disconnect him if his orders are not obeyed, and HAL relents, giving him manual control to wake the sleeping scientists. But as Bowman begins to awaken his colleagues, he hears HAL open both airlock doors into space, venting the ship’s internal atmosphere. The air on board is lost to the vacuum of space. Bowman makes his way into a sealed emergency shelter, which has an isolated oxygen supply and spare spacesuit. He then puts on the spacesuit and re-enters the ship, knowing HAL to be a murderer. Bowman then laboriously shuts down HAL's consciousness, leaving intact his purely autonomic functions needed for power and life support. With the ship back in order, he manually re-establishes contact with Earth. He then learns that the true purpose of the mission is to explore Iapetus, the third-largest moon of Saturn, in the hope of contacting the society that buried the monolith on the Moon. Bowman learns that HAL had begun to feel guilty and conflicted about keeping the purpose of the mission from him and Poole, which ran contrary to his stated mission of gathering information and reporting it fully. This conflict had started to manifest itself in little errors. Given time, HAL might have been able to resolve this crisis peacefully, but when he was threatened with disconnection, he panicked and defended himself out of a belief that his very existence was at stake, having no concept of the state of sleep. Bowman spends months on the ship, alone, slowly approaching Iapetus. A return to Earth is now out of the question, as HAL's sudden decompression of Discovery severely damaged the ship's air filtration system, leaving Bowman with far less breathable air than either returning to Earth or waiting for a rescue ship would require, and hibernation is impossible without HAL to monitor it. During his long approach, he gradually notices a small black spot on the surface of Japetus. When he gets closer, he realizes that this is an immense black monolith, identical in shape to TMA-1, only much larger. The scientists back on Earth name this monolith \"TMA-2,\" which Bowman points out is a double misnomer because it is not in the Tycho moon crater and gives off no magnetic anomaly whatsoever. He decides to go out in one of the extra-vehicular pods to make a closer inspection of the monolith. Programmed for just such an occurrence, the monolith reveals its true purpose as a star gate when it opens and pulls in Bowman's pod. Before he vanishes, Mission control hears him proclaim: \"The thing's hollow—it goes on forever—and—oh my God—it's full of stars!\" Bowman is transported via the monolith to an unknown star system. During this journey, he goes through a large interstellar switching station, and sees other species' spaceships going on other routes; he dubs it the 'Grand Central Station' of the universe. Bowman is given a wide variety of sights; from the wreckage of ancient civilizations to what appear to be life-forms, living on the surfaces of a binary star system. He is brought to what appears to be a nice hotel suite, carefully constructed from monitored television transmissions, and designed to make him feel at ease. Bowman goes to sleep. As he sleeps, his mind and memories are drained from his body, and he is made into a new immortal entity, a Star Child, that can live and travel in space. The Star Child then returns to our Solar System and to Earth. Once there, he detonates an orbiting nuclear warhead. Like Moon-Watcher three million years before, the Star Child is now master of the world and uncertain what to do next—but like Moon-Watcher, the Star Child too will think of something."
}