{
    "book_id": "1282996",
    "mid": "/m/02p43y5",
    "title": "\"A\" is for Alibi",
    "author": "Sue Grafton",
    "publication_date": "1982-04-15",
    "genres": [
        "Mystery",
        "Speculative fiction",
        "Fiction",
        "Suspense"
    ],
    "text": " The first novel in the \"Alphabet Mysteries\" series introduces the character of Kinsey Millhone as she looks into through the facts surrounding the death of prominent divorce lawyer Laurence Fife, whose murder eight years previously was blamed on his wife, Nikki Fife. After being released from prison, Nikki hires Kinsey to find the true murderer. In the course of the investigation, Kinsey becomes involved with Charlie Scorsoni, Laurence's former business partner, whose charms are sufficient to overcome temporarily Kinsey's reservations about sleeping with someone she hasn't yet crossed off her list of suspects. While flipping through the police reports courtesy (somewhat belligerently) of Lieutenant Dolan, Kinsey discovers something which never came up at Nikki's trial: that Laurence's death has been linked by police to that of an accountant in Los Angeles, Libby Glass. Both died under the same circumstances - oleander capsules were substituted for allergy pills - and Kinsey soon learns that the two were rumoured to be having an affair. She tracks down Libby's parents, and meets Libby's former boyfriend, Lyle, whom she suspects of being involved in Libby's death. Kinsey interrupts someone meddling with the boxes of Libby's possessions in the Glasses' basement, and on searching through what remains, finds nothing of significance except a letter from Laurence, indicating that he was in love with 'Elizabeth', which seems to confirm that he and Libby were indeed having an affair. Kinsey goes to Las Vegas on the track of Laurence's ex-secretary, Sharon Napier, who apparently had a mysterious hold over Laurence, but Sharon is shot minutes before Kinsey arrives on the scene to interview her, and Kinsey has to get out fast before she is caught in a compromising situation. It seems that like with the boxes in the basement, someone else is just ahead of her. Back in California, and quizzing Nikki further, Kinsey is mystified that Nikki's young son, Colin, recognises Laurence's first wife, Gwen, in a photograph. Kinsey has already discovered from a couple of interviews with her that Gwen is very bitter about her break-up with Laurence, but the only way that Gwen could have come into contact with Colin would have been through Laurence. Kinsey surmises that despite Gwen's hatred of Laurence, they were having an affair at the time of his death, and when she accuses Gwen of this, Gwen finally confesses - not only to the affair but to murdering Laurence. Shortly afterwards, she too is dead: killed in a hit and run accident. Kinsey has solved the case she was hired to solve, but the knowledge of Gwen's affair with Laurence leads her to question her previous assumption that he was involved with Libby Glass. She realises the letter in Libby's belongings was a plant - dating from an affair with Sharon Napier's mother, Elizabeth, many years before. So who killed Libby? In a plot twist, she discovers that her previous notions about Libby's death were entirely wrong: In fact, it was Charlie Scorsoni who had been having an affair with Libby, and he killed her when she discovered he was embezzling money from mutual accounts. He'd used the same method as Gwen used to kill Laurence only a few days before as a cover for her murder, so that everyone would assume the same person was guilty of both murders. Charlie realises that Kinsey has worked out the truth, and during a dramatic confrontation, he pursues her across the beach, armed with a knife. Before he can kill her, she shoots him dead instead. The novel ends as it begins, with Kinsey, exonerated as acting in self-defence, reflecting on the experience of having killed someone."
}