{
    "book_id": "16250549",
    "mid": "/m/03wf0ps",
    "title": "\"C\" is for Corpse",
    "author": "Sue Grafton",
    "publication_date": "1986",
    "genres": [
        "Mystery",
        "Speculative fiction",
        "Fiction",
        "Suspense"
    ],
    "text": " The third Alphabet Mysteries series installment finds Kinsey at the gym, rehabilitating herself after the injuries she sustained at the end of B is for Burglar. Also working out at the gym is Bobby Callahan, a twenty-three-year-old who was nearly killed when his car went off the road nine months before. Bobby is convinced that the road accident in which his friend Rick died was an attempt on his life, and suspects that he may still be in danger, so he hires Kinsey to investigate. The downside, however, is that Bobby lost his memory after the crash, and can't remember any of the details surrounding it. He can't even explain why he thinks someone wants to kill him; it's just a feeling he has. Kinsey takes the case, despite the vague information, because of her personal liking for Bobby. She meets his rich but dysfunctional family: mother Glen is an heiress on her third marriage to Derek Wenner, whose daughter Kitty is a 17 year old drug-user seriously ill with anorexia. Glen has spared no expense in seeking treatment and counselling for Bobby but he is struggling to come to terms with Rick's death, his own injuries and the loss of his prospects at medical school. A few days later, Bobby dies in another car accident and Kinsey is convinced that this too is the result of a murder attempt more successful than the first. There are several people with a motive: Kitty stands to inherit 2 million dollars from Bobby's will, Derek has insured Bobby's life for a large sum without Glen's knowledge, and Rick's parents are still very bitter about their son's death, for which they blame Bobby. However, Kinsey thinks the solution lies elsewhere. A friend of Bobby's gives her Bobby's address book which shows that Bobby was on the track of someone called Blackman. Bobby's former girlfriend tells her that Bobby had ended their relationship because he was having an affair with someone else, and she thinks Bobby was trying to help this woman with a problem involving possible blackmail. Kinsey eventually finds out that the woman with whom Bobby was involved was his mother's friend, Nola Fraker, who confesses to Kinsey that she was being blackmailed by someone who knows that Nola accidentally shot her husband, a well-known architect called Dwight Costigan, during a supposed struggle with an intruder at their home years before. The blackmailer has the gun with Nola's fingerprints on it. In seeking answers to what Bobby might have discovered at the hospital where he was working before his accident, Kinsey realises that 'Blackman' is code for an unidentified corpse which has lain unclaimed in the morgue for years. She suspects that Bobby had discovered the gun was concealed in the corpse, which turns out to be true. However, while she is at the hospital, she finds the recently-murdered body of the morgue assistant, and realises the killer is on her track at the hospital. It is Nola's current husband, Dr Fraker, a pathologist from the hospital, who is the blackmailer and killer. Bobby found out what Fraker was up to, but Fraker rigged the first car accident before he could do anything about it, and then cut the lines on Bobby's car when Bobby put Kinsey on the trail. Fraker traps Kinsey and gives her a disabling injection but she manages to cosh him and escapes to a phone to call the police."
}