{
    "book_id": "16251903",
    "mid": "/m/03wf25g",
    "title": "\"E\" Is for Evidence",
    "author": "Sue Grafton",
    "publication_date": "1988-05-15",
    "genres": [
        "Mystery",
        "Speculative fiction",
        "Fiction",
        "Suspense"
    ],
    "text": " The fifth \"Alphabet\" mystery novel opens just after Christmas, with Kinsey discovering that five thousand dollars has mysteriously been credited to her bank account, and flashes back a few days when she was asked to investigate a fire claim at a factory in Colgate as part of her informal office space rental arrangement with California Fidelity Insurance. The business in question, Wood/Warren, is owned and operated by the Wood family, whom Kinsey has known on a personal level since high school. Company founder Linden Wood is dead, but his son Lance now runs the company, and his four other children, Ebony, Olive, Ash and Bass all have a stake. Ash is Kinsey's former schoolmate, and Bass was an acquaintance of her second ex-husband, Daniel Wade. Olive is married to Terry Kohler, Lance's second-in-command at the company. After a solitary Christmas, with Henry away visiting relatives, and Rosie's Tavern shut down till the new year, Kinsey writes off the fire as an industrial accident, but upon submitting her report to her boss, she finds that significant papers have been removed from the file and others substituted, giving an appearance that Lance Wood has bribed Kinsey not to label the fire as arson. In the middle of protesting her innocence, the five thousand dollar credit takes on a sinister significance. Temporarily suspended from California Fidelity, Kinsey takes up her own investigation to prove her innocence, aided (unwillingly at first) by CFI administrator Darcy. Darcy's united with Kinsey in her dislike of claims manager Andy Motycka, who is Kinsey's chief suspect in the set-up, although she's at a loss who he could be working for. Kinsey reconnects with the Wood family, and learns some of their dark family secrets: that Ebony, the oldest sister, wants control of the business and that Lance was practically a criminal in high school. She also learns that a former Wood/Warren employee, Hugh Case, committed suicide two years before, but the suspicious disappearance of all the lab work on Hugh's body seems to support his widow Lyda's claim that it was murder rather than suicide. Kinsey remains unconvinced by Lyda's conviction that Lance was Hugh's killer but can't seem to find any other leads. Her spirits are at a low ebb and it's the worst possible moment for Daniel to show up, eight years after leaving without a word. Kinsey finds it hard it cope with but eventually agrees to store a guitar for him while he sorts himself out. On her way to a new year party at Olive and Terry's home, Kinsey is almost killed when a bomb, disguised as a gift left on the doorstep, explodes. Olive is killed and Terry is badly injured. Kinsey does her best to resist Daniel's attempts to nurse her, and her distrust is proved right when she finds out the guitar she has been storing for Daniel is bugged, and he has been reporting on her investigation to Ebony and Bass Wood. She discovers Daniel and Bass are lovers - Bass is the person Daniel left her for. Shortly afterwards, Kinsey finds Lyda Case's dead body in a car outside her apartment. Forcing answers from the Wood family, Kinsey learns an even darker family secret: that Lance had an incestuous affair with Olive when they were teenagers leaving Olive emotionally and sexually scarred for the rest of her life. Kinsey's suspicions immediately jump to Terry Kohler, and when the police identify fingerprints on the car Lyda was found in as belonging to an escaped convicted bomber called Chris Emms, she realises Terry and Emms are the same person. Unfortunately, Emms has anticipated her solving the case and is waiting at her apartment with another bomb. Before it explodes he explains he killed Hugh Case because Hugh had realised his true identity, and Lyda because she had belatedly found Hugh's records of that. He engineered the fire at Wood/Warren and set up Kinsey (with the aid of Andy Motycka) to get revenge on Lance, after Bass spilled the family incest secret to him. Kinsey manages to shoot Emms and disables him sufficiently to get out of the bathroom window just as the bomb is exploding, killing Emms and destroying her garage apartment. After Daniel leaves with Bass, the only loose end is the five thousand dollars Emms put in her account, and on the advice of Lieutenant Dolan, Kinsey keeps it."
}