{
    "book_id": "16252029",
    "mid": "/m/03wf2cv",
    "title": "\"F\" Is for Fugitive",
    "author": "Sue Grafton",
    "publication_date": "1989",
    "genres": [
        "Mystery",
        "Speculative fiction",
        "Fiction",
        "Suspense"
    ],
    "text": " The sixth novel in the series sends Kinsey to Floral Beach, California, while back at home, Henry Pitts is having her garage apartment rebuilt after it was destroyed at the end of E is for Evidence. She has been hired by Royce Fowler, who wants her to delve into the past to exonerate his son of the murder of Jean Timberlake, seventeen years before. Bailey, who had been a teen tearaway, pleaded guilty to killing Jean, his sometime girlfriend, but escaped from prison soon afterwards. He's apparently been living the life of a model citizen under an assumed name but has just been recaptured and is claiming his innocence. Kinsey heads to Floral Beach, a tiny local community, to pursue the cold trail, and stays with the Fowler family at their motel. Royce is dying of cancer, his wife Oribelle is sick with diabetes and their daughter, Ann, Bailey's senior by 5 years, has taken leave of absence from her job as a counsellor at the local high school to provide care. Bailey's lawyer, Jack Clemson, fills her in on the details of the case: Jean, 17 when she died, was a 'problem' child who was doing badly at school and engaged in numerous sexual encounters with the local boys at school - and, as it turns out, some of the local men too. She was pregnant at the time of her death. Everyone knows everyone in Floral Beach and Kinsey acquaints herself with a number of the locals in pursuit of the truth: Pearl, the local bar-owner, whose son's evidence put Bailey on the spot at the time of Jean's death, Tap Granger, who was Bailey's accomplice in several robberies before the murder, the unattractive local pastor Reverend Haws and his wife, and the local doctor Dr Dunne, whose wife Elva turns out to have a violent objection to being questioned. The High School Principal, Dwight Shales, who was in post at the time of the murder, offers some help, but Jean's single mother, Shana, whose friendship with Dwight is causing raised eyebrows around Floral Beach, and who is struggling with longstanding alcohol problems, is less co-operative, and refuses to identify Jean's father. Nobody seems convinced that the killer could be anyone but Bailey. At Bailey's arraignment, Tap Granger stages a hold-up, allowing Bailey to escape once more, and is himself killed in the process. Kinsey gets confirmation from Tap's widow that Tap was paid to do it - for the first time providing concrete evidence that someone wants to keep Bailey discredited. Kinsey's room at the motel is broken into, and she receives threatening calls in the middle of the night as she pursues the case. Ori is murdered when her insulin, administered regularly by Ann, is tampered with. Kinsey eventually establishes that Dr Dunne is Jean's unknown father, but Shana is murdered when she sets out to keep a rendezvous with him. Kinsey ends up running from the cops herself after she finds the body, and seeks refuge with Dwight Shales, who finally confesses that he was also having an affair with Jean, and was probably the father of her child. Kinsey wonders whether Dwight could be the link between the two, having realised that Ann Fowler seems jealous of anyone who comes into contact with Dwight. She searches Ann's room, and finds evidence that Ann supplied Tap with the hold-up gun and made the anonymous phone calls. Unfortunately, she also finds Ann waiting for her, armed with a shotgun. Jean had confided in her, as school counsellor, that Dwight was the father of the child. Motivated by jealousy, Ann killed her, and being equally jealous of her brother's position as favoured child of their parents, Ann was happy to see him take the rap. Her plan is to use the money she'll eventually inherit from her parents to tempt Dwight, to whom she has been fanatically devoted for years, into marriage. She killed her mother to hasten the plan along, and Shana because she was jealous of her friedship with Dwight. Before Ann can kill Kinsey, she is accidentally interrupted by Royce, who wrestles the gun away from Ann, shooting her in the foot accidentally in the process. Ann is arrested for the murders of Shana and Ori, and although there's insufficient evidence to prove her the killer of Jean as well, the circumstances are sufficient to ensure that Bailey is cleared."
}