{
    "book_id": "16204072",
    "mid": "/m/03wcwml",
    "title": "\"H\" Is for Homicide",
    "author": "Sue Grafton",
    "publication_date": "1991-05-15",
    "genres": [
        "Mystery",
        "Speculative fiction",
        "Fiction",
        "Suspense"
    ],
    "text": " The eighth novel in the Kinsey Millhone series opens in the midst of troubling times for California Fidelity, the insurance company Kinsey does occasional freelance work for in return for office space. First, a recent employee and friend of Kinsey's, Parnell Perkins, is shot and killed - and the police investigation seems curiously lacking in results. Second, in the wake of poor profit figures, company troubleshooter Gordon Titus (or 'tight-ass' as he is immediately nicknamed) arrives to shake things up. The informal arrangement with Kinsey seems high on his list of targets. In the new mood of nervous efficiency prevalent at CFI pending Titus's arrival, Kinsey is passed the claim file of Bibianna Diaz to investigate for possible fraud. Kinsey assumes a false identity as Hannah Moore in an attempt to befriend Bibianna, who by co-incidence is in a relationship with a former schoolmate and associate from police academy days of Kinsey's, Jimmy Tate, recently relieved of police duties on the grounds of corruption. Bibianna has problems too, it seems: her former boyfriend Raymond Montanaldo, of whom she is - rightly as it turns out - terrified, is the jealous type, and is hunting her down. Kinsey realises that a CFI colleague has inadvertently given away information on Bibianna to Raymond's gang, and things come to a head while she is out drinking with Bibianna and Tate. Raymond's brother Chago and his girlfriend Dawna accost Bibianna, and in the fracas which ensues Tate shoots and kills Chago. Bibianna is taken into custody with Kinsey deliberately sticking to her in order to cement their relationship. Kinsey's enforced overnight stay in the police 'tank' is interrupted by Lieutenant Dolan, who has a job offer for her: Raymond is the head of a huge insurance fraud gang and the police want Kinsey to use her new position as Bibianna's confidante to get the evidence they need; there seems to be a leak somewhere in the police department and they need someone unconnected they can trust to bring Raymond to justice. Kinsey withdraws her initial gut refusal when Dolan tells her Raymond killed Parnell, but they have been stalling the murder investigation in order not to jeopodise the longstanding fraud case. Kinsey agrees to help out of a sense of duty to Parnell, but the police plan to have Kinsey wired for her own protection goes awry and she is left to fend for herself. Thus begins a dangerous and stifling few days for Kinsey, undercover and up to her neck in an a criminal ring headed by a deluded killer. Raymond effectively keeps both Kinsey and Bibianna under house arrest in Los Angeles, with the aid of his second in command, Luis. Raymond can't accept Bibianna's rejection of him and is determined to force her into marriage. The snag in the plan, which Bibianna doesn't dare confess, is that she has actually just married Tate. Tensions run high, while Kinsey learns much about the car insurance fraud business, keeps her eyes open, and eventually establishes the leak is a clerk at the County Sheriff's office, whose father is a crooked doctor heavily involved in Raymond's ring. Matters come to a head when Bibianna escapes, and is pursued almost to her death by one of Raymond's henchmen. Visiting her in hospital, the doctor inadvertently lets slip to Raymond that Bibianna's next of kin is her husband, Jimmy Tate. Enraged, Raymond shoots Jimmy. Kinsey sets off in hot pursuit and received unexpected help from Luis, who turns out to be an undercover LAPD cop. Kinsey makes it back to Santa Teresa in the nick of time for her friend Vera Lipton's wedding. Both Bibianna and Tate survive, but despite her success in wrapping up the insurance fraud claim, Gordon Titus fires Kinsey from CFI."
}