{
    "book_id": "16252523",
    "mid": "/m/03wf2sf",
    "title": "\"K\" Is for Killer",
    "author": "Sue Grafton",
    "publication_date": "1994",
    "genres": [
        "Mystery",
        "Speculative fiction",
        "Fiction",
        "Suspense"
    ],
    "text": " In the eleventh of the 'Alphabet Murder' series, Kinsey Millhone is hired by Janice Kepler to investigate the death of her daughter, Lorna Kepler. Lorna had been found dead and badly decomposed ten months earlier in her secluded cabin home. The police at the time suspected it might have been a murder case, but from lack of evidence as to cause of death, the official line was that Lorna died naturally, as a result of an allergic reaction. Now someone has sent Janice a tape of a porn movie Laura apparently made before her death, and Janice, who has coped badly with her daughter's death, wants Kinsey to find out the truth. Mace, Janice's husband, and her two surviving daughters, Berlyn and Trinny, seem less keen on the investigation, and Mace and Berlyn, in particular, become positively hostile to Kinsey as she sets out to find out what happened to Lorna. With some help from Officer Cheney Phillips, Kinsey quickly learns that Lorna, who was a receptionist at the water treatment plant by day, had accumulated a modest fortune as a high class prostitute by night. Lorna was a beautiful loner, but had some friends - mainly people who like her tended to be up and about at night. Kinsey finds herself having to abandon her usual day-time routine in order to get herself into Lorna's world. Lorna's body was found by Serena Bonney, night-shift nurse and estranged wife of Lorna's boss at the water treatment plant, Roger Bonney. Serena's father, Clark Esselmann, is a powerful business tycoon with a number of enemies. She also befriends Danielle, a teenage colleague of Lorna's in her night-time occupation, who obliges Kinsey by giving her a badly needed haircut. When Danielle is savagely attacked in her home, Kinsey becomes convinced there's a link to Lorna's death, and her quest to discover the truth becomes more personal. Meanwhile, Kinsey has a terrifying Mafia-style encounter with a man describing himself as an attorney for a Los Angeles man to whom Lorna was engaged. He asks Linsey to keep him abreast of any developments in the case by giving her a telephone number. Kinsey soon uncovers a variety of secrets: Berlyn actually discovered Lorna's body, but kept quiet about in order to lift some of Lorna's money, and also sent her mother the porn video. Leda, the wife of Lorna's landlord JD, had bugged Lorna's cabin because she was worried (needlessly, as it turned out) that Lorna and JD were having an affair - and still has the tape. With the help of Lorna's friend, late-night radio DJ Hector Mereno, Kinsey transcribes a phone conversation Lorna had before her death which seems to have upset Lorna, but she can't make sense of it until Clark Esselmann is electrocuted in his swimming pool. Kinsey realises that the conversation on the tape is someone telling Lorna the plot - and surmises that having objected to it, Lorna was killed so that the plot could still be carried out. Her suspicions turn to Stubby Stockton, a business opponent of Esselmann's, and to Roger Bonney, since Kinsey now knows, from Berlyn's admission of the discovery of the body, that Lorna was already dead when Roger claimed he spoke to her for the last time. He is also the one with the necessary knowledge and access to his father-in-law's pool to have set up the electrocution. The final link in the chain is when Kinsey, in the course of cleaning up Danielle's trashed apartment while she's still in hospital, finds a photo of Lorna and Danielle with Stockton and Bonney. Kinsey talks to Cheney about her suspicions of Roger, but he points out there's no evidence. Frustrated that Bonney may get away with murder, the final straw is when Danielle dies in hospital. Kinsey phones the secret number and reports that Bonney is the killer. Overcome with guilt, she immediately tries to warn him, but he misunderstands, thinking she has come to confront him with the murder, and stuns her with a tazer. While Kinsey lies powerless on the floor, the Mafia types arrive and escort Bonney away. He is never seen again."
}