{
    "book_id": "1478845",
    "mid": "/m/054qln",
    "title": "\"Repent, Harlequin!\" Said the Ticktockman",
    "author": "Harlan Ellison",
    "publication_date": "1965-12",
    "genres": [
        "Fiction"
    ],
    "text": " The story opens with a passage from Civil Disobedience by Henry David Thoreau. The story is a satirical look at a dystopian future in which time is strictly regulated and everyone must do everything according to an extremely precise time schedule. In this future, being late is not merely an inconvenience, but a crime. The crime carries a hefty penalty in that a proportionate amount of time is \"revoked\" from one's life. The ultimate consequence is to run out of time and be \"turned off\". This is done by the Master Timekeeper, or \"Ticktockman\", who utilizes a device called a \"cardioplate\" to stop a person's heart once his time has run out. The story focuses on a man named Everett C. Marm who, disguised as the anarchical Harlequin, engages in whimsical rebellion against the Ticktockman. Everett is in a relationship with a girl named pretty Alice, who is exasperated by the fact that he is never on time. The Harlequin disrupts the carefully kept schedule of his society with methods such as distracting factory workers from their tasks by showering them with thousands of multicolored jelly beans or simply using a bullhorn to publicly encourage people to ignore their schedules, forcing the Ticktockman to pull people off their normal jobs to hunt for him. Eventually, the Harlequin is captured. The Ticktockman tells him that pretty Alice has betrayed him, wanting to return to the punctual society everyone else lives in. The Harlequin sneers at the Ticktockman's command for him to repent. The Ticktockman decides not to stop the Harlequin's heart, and instead sends him to a place called Coventry, where he is converted in a manner similar to how Winston Smith is converted in George Orwell's Nineteen Eighty-Four. The brainwashed Harlequin reappears in public and announces that he was wrong before, and that it is always good to be on time. At the end, one of the Ticktockman's subordinates tells the Ticktockman that he is three minutes behind schedule. The Ticktockman walks away to his office \"going mrmee, mrmee, mrmee, mrmee\"."
}