{
    "book_id": "18756772",
    "mid": "/m/04gmd19",
    "title": "\"Rommel?\" \"Gunner Who?\"",
    "author": "",
    "publication_date": "1974",
    "genres": [
        "Comic novel",
        "Autobiography",
        "Satire"
    ],
    "text": " Milligan’s 19 Battery 56th Heavy Rgt. R.A. has arrived in Algeria. With his rank of gunner, there is no one under his command; his promotion later in the book is the source of comment. An officer, Lt. Budden says: \"Bombardier?\" He turned and looked out the window. \"Oh, dear.\" One of Milligan’s first battle encounters is to yell at a passing airplane \"I hope you crash, you noisy bastard!\" — it immediately does. But the plane was Allied. In a couple weeks they leave the comforts in the area of Cap Matifou, heading east into battle areas, and are now eating army food. Their cook is upper class: :\"'Where'd you get that accent, Ronnie?'.... :'Eton, old sausage.' :'Well, I’d stop eatin' old sausages.'\" Milligan stays in various accommodations, from a two-man tent stolen from American supplies (which his best friend Edgington burns down while attacking a scorpion), to appropriated housing. The native Arabs are still in the area. Milligan sneaks food a few times to a farmer whose family is \"having a rough time\". Later, they adopt a French dog; when the owner returns to check his house, he mistakenly shoots it; they spend the evening drinking with him in commiseration. As they see action, one gun crew is puzzled to discover their gun is missing after being fired. It's gone over a cliff, and narrowly avoids killing future Goon Harry Secombe, whom Milligan later meets in passing: : \"I saw something that I felt might put years on the war. It was a short Gunner, wearing iron frame spectacles, a steel helmet that obscured the top of his head, and baggy shorts that looked like a Tea Clipper under full sail....It was my first sight of Gunner Secombe: what a pity! We were so near to Victory, and this had to happen. I hadn't crossed myself in years, and I remember saying, 'Please God...put him out of his misery.'\" Part of Milligan's job is laying phone lines. On one occasion silence is imperative, since they're close to the enemy, however the hole in the cable drum spool is square, making a great noise as it unreels. :\"There was a suppressed laughter. Unable to stop it, we all burst out laughing again. :'Stop it at once!' said Dawson, through his own laughter. We stopped. 'Now stop it, or I'll kill the bloody lot of you.' : A white star shell lit the night. :'What's that?' asked Ernie Hart. :'That, Ernie, means that a child has been born in Bethlehem.'\" There's limited time for band music, but Milligan and Edgington play on opposites sides of a bombed out floor. Shortly after Edgington finishes, the piano falls through. Milligan reflects: \"It's not often we had been detailed to:—'Clean up that mess of a French Colonial Piano.'\" While driving with Major Chater Jack: :\"'How does it go again? called Chater. I re-sang the opening bars with intermittent rain. :'Doesn't he know any other tunes,' said Edward. :\"'Any others? Christ, he doesn't know this one, he only brings me along as an amanuensis.'\" Amid Milligan's persistent whistling and joking are moments of reflection: :\"We sang songs, those nostalgic slushy moon-June love songs that had fucked-up my generation....If I sang a song, I was Bing Crosby, if I played trumpet, Louis Armstrong...but who was I when washing out my socks?\" And, at the end of the book, as the army triumphantly enters into Tunis: :\"Here was I, anti-war, but like the rest of us feeling the exhilaration of the barbarian.\""
}