{
    "book_id": "17246888",
    "mid": "/m/043nxzz",
    "title": "A.D.: New Orleans After the Deluge",
    "author": "Josh Neufeld",
    "publication_date": "",
    "genres": [
        "Comics"
    ],
    "text": " The online version of the story encompasses a two-part prologue, 13 chapters, and an epilogue — 15 chapters in total. In the prologue, from a \"God's eye\" perspective, A.D. shows Hurricane Katrina as it builds from a tropical storm in the Bahamas and moves inexorably toward New Orleans. Katrina slams into the Gulf Coast. Winds and rain lash New Orleans and Biloxi, Mississippi. The levees burst and the city is flooded. Going back in time to more than a week before the storm, readers meet the protagonists in their pre-Katrina lives. Then in the days leading up to the hurricane, the characters learn about the approaching monster storm. On the Saturday before the hurricane, Leo tracks the storm on his computer as he and Michelle decide whether to evacuate. Meanwhile, The Doctor makes plans to host some friends at his French Quarter home for a “hurricane party.” On Sunday, August 28, 2005, one day before Katrina, Hamid sends his wife and family off to safety in Houston. Kevin helps his family prepare to evacuate to Tallahassee. Denise goes with her niece and grandniece to take shelter at the hospital where her mother works, but when they are turned away from a private room due to overcrowding, she angrily returns to her apartment alone. Leo and Michelle spend hours in bumper-to-bumper traffic to Houston, while Kevin and his family do the same en route to Tallahassee. Meanwhile, Hamid and Mansell excitedly outfit themselves for the storm at Hamid’s store. Monday, August 29. As the storm’s pre-winds batter New Orleans, The Doctor’s hurricane party is in full swing. Hamid and Mansell hunker down at the store. When the full force of the hurricane hits, Denise learns just what a mistake it was to forsake the refuge of the hospital for her apartment. Her apartment is shaken repeatedly by the storm, the ceiling in the bedroom comes down, and she spends the night holding onto a bed wedged in the hallway. We also check in on Kevin and his family in Tallahassee, and Leo and Michelle in Houston. No one is yet aware that the levees have been breached. Tuesday, August 30. Katrina has finally passed New Orleans, and Hamid and Mansell emerge, blinking in the sunlight, ecstatic to have survived the storm. But then the flooding begins. Reluctant to abandon the store and fearful of looters, the two men stand fast in the rising waters. Wednesday, August 31. Hamid and Mansell wake up from a long night on the roof of Hamid's maintenance shed. They spend the day wading through the chest-high waters, refusing a boat ride out of the flooded sections of the city. Denise and her family, having momentarily escaped the flooding, await transport out of the flooded city. What they find instead is a van to the Convention Center. In Houston, Leo and Michelle are dismayed to discover that their neighborhood took over five feet of water. The Doctor makes the rounds of the French Quarter, administering aid where needed. Hamid and Mansell deliver much-needed water to a trapped neighbor. And in Tallahassee, Kevin sees footage of the flooding and realizes he won’t be returning home any time soon. Denise arrive at the Convention Center to find it completely without vital services, and filled with abandoned people. Mansell narrowly avoids being crushed by a bobbing refrigerator case. Mansell's asthma and the high water makes Hamid face the fact that they probably should evacuate the flooded city. In Houston, Leo & Michelle discuss what their next move should be. And in Tallahassee, Kevin learns that he and his younger brother will be sent off to California to attend school there. Thursday, September 1. Three days after the hurricane and two days after the city began flooding. Denise and her family, having been dropped off at the New Orleans Convention Center, find themselves stranded and abandoned, surrounded by thousands of other refugees. And from there things only get worse. Denise and her family are still trapped at the New Orleans Convention Center. The NOLA police roll by in armored SWAT vehicles, with rifles loaded — but no food or water. This companion section to Chapter 12 tells the real story — from the perspective of the people who were there — of what went down at the Convention Center in the days after Hurricane Katrina. In the epilogue, \"Picking Up The Pieces,\" A.D. concluded its online run with a final look at all the characters. Picking up the story a year and a half after the hurricane, readers find out about Denise's escape from the Convention Center; Hamid & Mansell's rescue from the flooded store; Kevin's years-long odyssey; the Doctor's formation of the New Orleans Health Department in Exile; and Leo & Michelle's return to their flooded home. The epilogue concludes with a jump of another year ahead in time, to early 2008, and a final check-in with the Doctor, Leo, and Denise. The A.D. book includes 25% more story and art, as well as extensive revisions to the material from the webcomic. Other changes include dividing the book into five sections rather than 15 chapters, as well as the changing of some of the characters' names."
}