{
    "book_id": "18172194",
    "mid": "/m/04cxg0s",
    "title": "A Long Way Gone: Memoirs of a Boy Soldier",
    "author": "Ishmael Beah",
    "publication_date": "2007-02-13",
    "genres": [
        "Autobiography",
        "Biography",
        "Non-fiction",
        "Memoir"
    ],
    "text": " The book starts with Ishmael Beah, his older brother Junior, and their friend Talloi traveling from their village of Mogbwemo to Mattru Jong in order to perform in a talent show. Ishmael, Junior, and their friend dance and sing rap music. Thinking they would return the following day, they tell no one of their leaving. During their stay in Mattru Jong with Gibrilla, Khalilou, and Kaloko, the RUF attacks. The three are able to flee the village without the rebels' following them. They decide to head back home. On the way, it turns out that their village was also captured by the RUF. According to an old man who was sitting outside the village, most of the people had fled to a village on the Sierra Leone coast. Ishmael, Junior, and their friend decide to travel there in order to locate their families. On their, they encounter multiple other villages. They are accepted into another village on the grounds that they help with the farming. After months, the village is attacked. Caught by surprise, Ishmael, Junior, and their friend split up and run into the swamps. It is unknown what happens to his friends afterwards. Ishmael roams around the wilderness by himself for a while, until he meets up with another group of traveling boys whom he recognizes from his home village. The boys then travel together to another village on the coast. Many refugees fled to this village because the Sierra Leone Armed Forces occupied it. In search of safety, the group of boys and Ishmael go to that village, but soon leave. Ishmael then learns from a woman from his hometown that Junior, his younger brother Ibrahim, and his parents are safe in another village with many others from Mattru Jong. Just before they reach the village, the boys meet a man named Gasemu whom Ishmael knew from Mattru Jong. Gasemu tells them that Ishmael's family are indeed safe in the village, and ask the boys to help him carry bananas back to that village. However, moments before they reach the town, it is attacked by the RUF. Although their bodies are not found among the dead or in the burning house where they lived, Ishmael assumes that his family is dead. Devastated, and believing that Gasemu is to blame for his not being able to see his family on time, Ishmael attacks Gasemu but is stopped by the other boys. They are then chased into the forest by remaining RUF soldiers, and Gasemu dies from being shot, leaving Ishmael more saddened. The boys then settle into another village protected by the army. After many uneventful days, the lieutenant in charge of the troops in the village announced that the RUF was beginning to assault the village. The lieutenant said that in order for the people to survive, they must contribute to the war effort by enlisting in the army; escape was not an option. By doing this, the lieutenant secures many child soldiers, the weapon of choice for both the RUF and the Sierra Leone Armed Forces. Ishmael becomes a junior lieutenant for his skill in executing prisoners of war and is put in charge of a small group of other child soldiers. As a child soldier, Ishmael is exposed to extreme violence and drug usage. The drugs he used are described in the book as “brown brown”, “white pills”, and marijuana. In January 1996, during one of the roll calls, a group of men wearing UNICEF shirts round up several boys and takes them to a shelter in Sierra Leone's capital, Freetown, where they and several other child soldiers are to be rehabilitated. However, the children cause much trouble for the volunteer staffers at the facility, with Ishmael experiencing symptoms of drug withdrawal as well as troubling memories of his time as a child soldier. Despite the violence caused by the children, one of the staffers, Nurse Esther, becomes interested in Ishmael, learning about his childhood love of rap music and purchasing him a rap cassette and Walkman, when she takes Ishmael and his friend Alhaji to the city. It is through this connection and his numerous counseling experiences with Esther that Ishmael eventually turns away from his violent self and starts to heal from his mental wounds. Eventually, Ishmael becomes adopted by his Uncle Tommy in the city and settles down with him and his family on the outskirts of Freetown. It is during this time that Ishmael is chosen to speak to the United Nations (UN) in New York City about his experiences as a child soldier and the other problems plaguing his country. While at the UN meeting, Ishmael met several other children who were also experiencing problems in their countries. There were 57 children present at the meeting, and each told his story to the UN. Ishmael also meets Laura Simms, his chaperone, who is a storyteller and his future foster mother. In 1996, when Ishmael returns to Sierra Leone, Freetown is invaded by a combination of the RUF and the Sierra Leonean government army, causing many civilian deaths, including the death of Uncle Tommy from malady. Believing that he can no longer stay in Freetown for fear of either becoming a soldier again or of being killed by his former army friends if he refused, Ishmael decides to get in contact with Laura Simms. He then escapes Sierra Leone and crosses the border into Guinea, where he eventually makes his way to the United States and his new life abroad."
}