{
    "book_id": "1265248",
    "mid": "/m/04nf7c",
    "title": "Ada or Ardor: A Family Chronicle",
    "author": "Vladimir Vladimirovich Nabokov",
    "publication_date": "",
    "genres": [
        "Alternate history",
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " Ada tells the life story of a man named Van Veen, and his lifelong love affair with his sister Ada. They meet when she is eleven (soon to be twelve) and he is fourteen, believing that they are cousins (more precisely: that their fathers are cousins and that their mothers are sisters), and begin a sexual affair. They later discover that Van's father is also Ada's and her mother is also his. The story follows the various interruptions and resumptions of their affair. Both are wealthy, educated, and intelligent. Van goes on to become a world-renowned psychologist, and the book itself takes the form of his memoirs, written when he is in his nineties, punctuated with his own and Ada's marginal notes, and in parts with notes by an unnamed editor, suggesting the manuscript is not complete. The novel is divided into five parts, each approximately half the length of the preceding one. As they progress chronologically, this structure evokes a sense of a person reflecting on his own memories, with an adolescence stretching out epically, and many later years simply flashing by. The story takes place in the late nineteenth century on what appears to be an alternative history of Earth, which is there called Demonia or Antiterra. Antiterra has the same geography and a largely similar history to that of Earth; however, it is crucially different at various points. For example, the United States includes all of the Americas (which were discovered by African navigators). But it was also settled extensively by Russians, so that what we know as western Canada is a Russian-speaking province called \"Estoty\", and eastern Canada a French-speaking province called \"Canady.\" Russian, English, and French are all in use in North America. Russia itself, and much of Asia, is part of an empire called Tartary, while the word \"Russia\" is simply a \"quaint synonym\" for Estoty. The British Empire, which includes most or all of Europe and Africa, is ruled (in the nineteenth century), by a King Victor. Aristocracy is still widespread, but some technology has advanced well into twentieth-century forms. Electricity, however, has been banned since almost the time of its discovery following an event referred to as \"the L-disaster\". Airplanes and cars exist, but television and telephones do not, their functions served by similar devices powered by water. The setting is thus a complex mixture of Russia and America in the nineteenth and twentieth centuries. The belief in a \"twin\" world, Terra, is widespread on Antiterra as a sort of fringe religion or mass hallucination. (The name \"Antiterra\" may be a back-formation from this; the planet is \"really\" called \"Demonia\".) One of Van's early specialties as a psychologist is researching and working with people who believe that they are somehow in contact with Terra. Terra's alleged history, so far as he states it, appears to be that of our world: that is, the characters in the novel dream, or hallucinate, about the real world. The central characters are all members of the North American aristocracy, of mostly Russian and Irish descent. Dementiy (\"Demon\") Veen is first cousins with Daniel Veen. They marry a pair of twin sisters, Aqua and Marina respectively, who are also their second cousins. Demon and Aqua raise a son, Ivan (Van); Dan and Marina two daughters, Ada and Lucette. The story begins when Van, aged 14, spends a summer with his cousins, then 12 and 8. A rough idea of the years covered by each section is provided in brackets, below, but the narrator's thoughts often stray outside of the periods noted. This part, which one critic called \"the last 19th century Russian novel\", takes up nearly half the book. Throughout this part of the novel, the many passages depicting the blossoming of Van and Ada's love vary in rhythm, in style, and in vocabulary—ranging from lustrous, deceptively simple yet richly sensual prose to leering and Baroque satire of eighteenth-century pornography—depending on the mood Nabokov wishes to convey. The first four chapters provide a sort of unofficial prologue, in that they move swiftly back and forth through the chronology of the narrative, but mostly deal with events between 1863 and 1884, when the main thrust of the story commences. They depict Van and Ada discovering their true relationship, Demon and Marina's tempestuous affair, Marina's sister Aqua's descent into madness and obsession with Terra and water, and Van's \"first love,\" a girl he sees in an antique shop but never speaks to. Some readers regard these first four chapters as being deliberately difficult. Chapters 4 to 43 mostly deal with Van's adolescence, and his first meetings with his \"cousin\" Ada—focused on the two summers when he joins her (and her \"sister\" Lucette) at Ardis Hall, their ancestral home, in 1884 and 1888. In 1884 Van and Ada, age 14 and 12, fall passionately in love, and their affair is marked by a powerful sense of romantic eroticism. The book opens with their discovery that they are in fact not cousins but brother and sister. The passage is notoriously difficult, more so as neither of them explicitly states the conclusion they have drawn (treating it as obvious), and it is only referred to in passing later in the text. Although Ada's mother keeps a wedding photo dated August 1871, eleven months before her birth, they find in a box in the attic a newspaper announcement dating the wedding to December 1871; and furthermore that Dan had been abroad since that spring, as proved by his extensive filmreels. Hence he is not Ada's father. Furthermore they find an annotated flower album kept by Marina in 1869–70 which indicate, very obliquely, that she was pregnant and confined to a sanatorium at the same time as Aqua; that 99 orchids were delivered to Marina, from Demon, on Van's birthday; and that Aqua had a miscarriage in a skiing accident. It later transpires that Marina gave the child to her sister to replace the one she had lost—so she is in fact Van's mother—and that her affair with Demon continued until Ada's conception. This makes Lucette (Dan and Marina's child) the uterine half-sister of both of them. Van returns to Ardis for a second visit in the summer of 1888. The affair has become strained because of Van's suspicions that Ada has had another lover and the increasing intrusion of Lucette (their 12-year-old half sister) into their trysts (an intrusion that Van half welcomes but Ada resents). This section ends with Van's discovery that Ada has in fact been unfaithful and his flight from Ardis to exact revenge upon those \"rivals\" of whom he is aware—Phillip Rack, Ada's older and weak-charactered music teacher; and Percy de Prey, a rather boorish neighbour. Van is distracted by a chance altercation with a soldier named Tapper, whom he challenges to a duel and by whom he is wounded. In hospital he chances upon Phillip Rack, who is dying, and whom Van cannot bring himself to exact revenge upon. He then receives word that Percy de Prey has been shot and killed in Antiterra's version of the ongoing Crimean War. Van moves to live with Cordula de Prey, Percy's cousin, in her Manhattan apartment, whilst he fully recovers. They have a shallow physical relationship, which provides Van with respite from the emotional strain of his feelings for Ada. Van spends his time developing his studies in psychology, and visiting a number of the \"Villa Venus\" upper-class brothels. In the autumn of 1892 Lucette, now having declared her love for Van, brings him a letter from Ada in which she announces she has received an offer of marriage from a wealthy Russian, Andrey Vinelander. Should Van wish to invite her to live with him she will refuse the offer. Van does so, and they commence living together in an apartment Van has purchased from Ada's old school-friend, and Van's former lover, Cordula de Prey. In February 1893 their father, Demon, arrives with news that his cousin (Ada's supposed father, but actual stepfather) Dan has died following a period of exposure caused by running naked into the woods near his home during a terrifying hallucinatory episode. Upon grasping the situation regarding Van and Ada, he tells Van that Ada would be happier if he \"gave her up\"—and what is more, he would disown Van completely if he failed to do so. Van acquiesces, leaves, and attempts suicide, which fails when his gun fails to fire. He then leaves his Manhattan apartment and preoccupies himself with hunting down a former servant at Ardis, Kim Beauharnais, who had been blackmailing them with photographic evidence of their affair, and beating him with an alpenstock until he is blind. With Ada having married Andrey Vinelander, Van occupies himself in traveling and his studies, until 1901 when Lucette reappears in England. She has herself booked on the same transatlantic ship, the Tobakoff, that Van is taking back to America. She attempts to seduce him on the crossing and nearly succeeds, but is foiled when Ada appears as an actress in the film, Don Juan's Last Fling, that they are watching together on the onboard cinema. Lucette consumes a number of sleeping pills and commits suicide by throwing herself from the Tobakoff into the Atlantic. In March 1905, Demon dies in a plane crash. Later in 1905, Ada and Andrey arrive in Switzerland as part of a party engaged in uncovering Lucette's fortune, concealed in various hidden bank accounts. Van meets with them, and together he and Ada formulate a plan for her to leave her husband and live with him. This is now considered possible due to the death of Demon. During their stay in Switzerland, however, Andrey falls ill with tuberculosis, and Ada decides that she cannot abandon him until he has recovered. Van and Ada part, and Andrey remains ill for 17 years, at which point he dies. Ada then flies back to Switzerland to meet with Van. This part consists of Van's lecture on \"The Texture of Time\", apparently transcribed from his reading it into a tape recorder as he drives across Europe from the Adriatic to meet Ada in Montreux, Switzerland, while she is on her way from America via Geneva. The transcription has then been edited to merge into a description of his and Ada's actual meeting, and then out again. This makes this part of the novel notably self-reflexive, and it is sometimes cited as the \"difficult\" part of the novel, some reviewers even stating that they wished Nabokov had \"left it out.\" It could conversely be argued that it is one of the most potent evocations of one of the novel's central themes, the relation of personal experience of time to one's sense of being in and of the world. At the end of this section, Van and Ada join to live as man and wife. This section of the novel is the one most clearly set in 1967, as Van completes his memoirs as laid out in Ada or Ardor: A Family Chronicle. He describes his contentment, such as it is, his relationship with his book, and the continuing presence and love of Ada. This is interspersed with remarks on the ravages of time. As cancer develops painfully within him, Van and Ada restructure 80 years of fragments into a conversation about death, and Van breaks off from correcting his essentially complete but not yet fully polished work as the book becomes distorted. The book stops referring to Van and Ada, merging them into \"Vaniada, Dava or Vada, Vanda and Anda\", as they begin a suicide and \"die into the finished book.\" (Whether they do indeed die is disputed by critics, as the author says \"if our time-racked flat-lying couple ever intended to die\".)"
}