{
    "book_id": "1079926",
    "mid": "/m/0447gx",
    "title": "Advise and Consent: A Novel of Washington Politics",
    "author": "Allen Drury",
    "publication_date": "1959-07-11",
    "genres": [
        "Fiction",
        "Novel"
    ],
    "text": " A U.S. President names a new Secretary of State to promote rapprochement with the U.S.S.R. Nominee Robert Leffingwell, the darling of the liberals, is viewed by many conservative senators as an appeaser. Others have doubts about his character. The nomination proceeds smoothly until a minor bureaucrat named Gelman tells the subcommittee handling the confirmation nomination that he and Leffingwell were in a Communist cell when in college along with James Morton.The subcommittee deems Gelman's testimony far-fetched, and the chairman, Senator Anderson, is about to send the nomination to the full Foreign Relations Committee when a member of the President's staff calls Anderson to tell him that he once was known as \"James Morton\". Anderson holds open his subcommittee hearings, which enrages the President. The President orders Majority Leader Munson to get Anderson to move the nomination by enticement or threat. Munson cannot find a way to threaten Anderson. Anderson is a Mormon and has a wife and child. While in Hawaii on R&R late in World War II, he had a month-long love affair with another man. Anderson has been struggling with his homosexual orientation throughout his life. His maid, cleaning out is attic, gives him a picture of the two men taken in Hawaii in a sealed and forgotten envelope. Anderson's wife Mabel has occasionally complained that she does not feel loved in their marriage. While driving to the Capitol, he picks up Associate Supreme Court Justice Davis, a supporter of Leffingwell's nomination. As Anderson drops Davis off at the Supreme Court, the envelope with the picture falls from the car. Davis finds it and, unable to bring himself to use the evidence, delivers it to Munson, who scolds Davis for suggesting blackmail but keeps the photograph. The next evening at the White House, the President learns that Anderson knows Leffingwell was in a Communist cell with Morton. The President decides to get James Morton out of town and proceed with the nomination. Anderson vehemently objects, stating that the honorable thing to do is to withdraw the nomination. Anderson leaves. The President, alerted earlier by Davis to the existence of the photo, takes it from a reluctant Munson and gives it to Senator Van Ackerman, an enemy of Anderson. Van Ackerman and his allies begin a whispering campaign about Anderson. Confronted by his wife, Anderson admits his homosexual past. She reacts badly, leaving Anderson feeling more alone than ever. He receives a phone call from the man with whom he had the affair, who admits that he sold his story to someone because he needed the money. The next morning, the editor of the Washington Post visits Anderson with a copy of a column detailing the affair. The editor tears it up in front of Anderson, saying that no Washington newspaper will publish it, but warns that someone else will publish it soon. That afternoon, feeling trapped and alone, Anderson decides there is only one way to maintain his honor and dignity. He writes a letter to his best friend and mentor, Senator Orrin Knox, explains what has happened, returns to his office in the Senate Office Building, and shoots himself in the head. Senator Anderson's death turns the majority of the Senate against the President and the Majority Leader. Senator Knox becomes the de facto leader of the opposition, and vows to defeat the Leffingwell nomination. The Senate unanimously censures Van Ackerman for contributing to Senator Anderson's death. Senator Munson makes a speech linking Anderson's death to the Leffingwell nomination and resigns as majority leader. The President summons Knox, a two-time presidential candidate, to the White House and promises to back him for the party's nomination next year if he will allow the Leffingwell nomination to go through. Knox dares him to put this promise in writing, and the President does. The President also tells Knox that the Soviets have just launched a manned mission to the moon and that he needs a Secretary of State who can deal with the Soviets. Knox discusses the President's promise of support with his colleagues and his wife, but decides to oppose the Leffingwell nomination. The Soviet cosmonauts address the world via radio and claim the moon for the Soviet Union. The Soviet Premier then invites the President to Geneva for a summit meeting. The U.S. launches its own moon mission and the President gives a speech asserting that no one owns the moon. Despite his misgivings, he will meet the Soviet leader in Geneva. The Senate votes on the Leffingwell nomination and defeats it by a vote of 74-24. Following the vote, the President dies of a heart attack and Vice President Hudson becomes President. President Hudson addresses a joint session of Congress after the late President's funeral, saying he will not be a candidate for his party's nomination next year, that he will honor the late President's promise to go to Geneva, and that he will nominate Orrin Knox as Secretary of State. Knox is promptly confirmed, and President Hudson leaves for Switzerland."
}