{
    "book_id": "4884979",
    "mid": "/m/0csjs0",
    "title": "Ali and Nino: A Love Story",
    "author": "Kurban Said",
    "publication_date": "1937",
    "genres": [
        "Novel"
    ],
    "text": " \"Ali and Nino\" is the story of an Azerbaijani youth who falls in love with a Georgian princess. Essentially, the book is a quest for truth and reconciliation in a world of contradictory beliefs and practices – Islam and Christianity, East and West, age and youth, male and female. Much of the novel is set in Baku's Old City (Ichari Shahar) on the eve of the Bolshevik Revolution beginning around 1917–1918. The novel was first published in 1937, in a foreign country (Austria), in a foreign language (German), by someone using the pen name of Kurban Said (Gurban Said, in Azeri). Ali Khan Shirvanshir, descendant of a noble Muslim family, is educated in a Russian boy's high school. While his father is still completely a part of Asia, Ali is exposed to Western values in school and through his love to Georgian princess Nino, who has been brought up in a Christian tradition and belongs more to the European world. The book describes the love of Ali for Nino, with excursions to mountain villages in Daghestan, Shusha in Azerbaijan, Tbilisi, Georgia and Persia. Upon graduating from high school, Ali determines to marry Nino. At first she hesitates, until Ali promises that he will not make her wear the veil, or be part of a harem. Ali's father, despite his Muslim traditional view of women, supports the marriage; Nino's father tries to postpone the marriage. The book takes a dramatic turn when an Armenian, whom Ali thought was a friend, kidnaps Nino. In retaliation, Ali pursues him on horseback and overtakes his car and kills him. Contrary to tradition, he spares Nino. Ali flees to Daghestan to escape the vengeance of the Armenian family. After many months, Nino finds Ali in a simple hilltown, the two marry on the spot and spend a few months in blissful poverty. As turmoil follows the Russian Revolution, Ali Khan makes some tough ideological decisions. When the Ottoman Army moves closer to liberate his native Baku, Ali Khan watches the developments closely. The Bolsheviks recapture Baku, and Ali and Nino flee to Iran (Persia). In Tehran, Ali is reminded of his Muslim roots, while Nino is fundamentally unhappy in the confinement of the harem. Upon establishment of the Republic of Azerbaijan, Ali and Nino return and become cultural ambassadors of their new country. Ali is offered a post as ambassador to France – an idea Nino had arranged – but Ali declines, because he fears he will be as unhappy in Paris. When the Red Army descend on Ganja, Azerbaijan, Ali takes up arms to defend his country. Meantime, Nino flees to Georgia with their child, but Ali Khan dies in battle as the Bolsheviks take the country, which in reality led to the establishment of the Soviet domination of Azerbaijan from 1920–1991 and the end of the short-lived Azerbaijan Democratic Republic (ADR, from May 1918 to April 1920)."
}