{
    "book_id": "576114",
    "mid": "/m/02rq29",
    "title": "Are You There, God? It's Me, Margaret",
    "author": "Judy Blume",
    "publication_date": "",
    "genres": [
        "Young adult literature"
    ],
    "text": " The main conflict in the novel comes from Margaret's need to settle her mixed religious heritage. She deals with her issues of belief in God, as the story is frequently interlaced with her praying by beginning with the title's words \"Are You there, God? it's me, Margaret.\" In school, she is assigned a year-long independent study project; she chooses a study on people's beliefs, which proves to be more than she can handle as she is finding out a lot about herself as well. She also is dealing with conflict between her grandparents on both sides of her family, as her maternal grandparents are trying to guarantee that she is indeed Christian as she was born with a Christian mother. Margaret enjoys spending time with her paternal grandmother, who seems to accept her for who she is and is more accepting of her son's interfaith marriage, although she has referred to Margaret as \"my Jewish girl\" and introduced her to synagogue services, supposedly for the purpose of showing her granddaughter what the Jewish faith entails, but in reality when Margaret asks she immediately claims that she always knew she was a \"Jewish girl\". Her grandmother's arrogance is again shown when her Christian grandparents come, claiming her as a Christian, she tells Margaret to remember that she's a Jewish girl. Margaret denies this and claims not to believe in God, which angers her grandmother. The ambiguities of her interfaith identity are particularly highlighted in a scene &mdash; following a heated argument with another girl &mdash; in which Margaret visits a church, finding her way to the confessional booth; there the unseen priest inquires as to her problems, but &mdash; believing at first that the priest is God himself speaking to her and not comprehending the concept of Christian confession or its confidential nature &mdash; she simply responds \"I am sorry,\" before running out of the church in tears. Margaret eventually stops \"talking to God\" after being in the middle of a confrontation between her parents and maternal grandparents. She is angry at him for putting her in such a conflict. In the end of the book, she goes to the bathroom and finds spots of blood in her underwear. She calls her mom, who was prepared for this and has bought pads. She puts the pad on, and makes one final prayer to God before the book ends: Besides religion though, Margaret moves from New York to the New Jersey suburbs, where she encounters Nancy, who leads her into a club where they talk about boys, bras, and periods. She becomes attracted to Phillip Leory, a boy at school, and kisses him at a party while playing \"Spin the Bottle.\" She does get a bra and is excited but also confused about growing up."
}