{
    "book_id": "8710283",
    "mid": "/m/027ftz3",
    "title": "Artemis Fowl: The Time Paradox",
    "author": "Eoin Colfer",
    "publication_date": "2008-07-16",
    "genres": [
        "Speculative fiction",
        "Fantasy",
        "Children's literature"
    ],
    "text": " Angeline Fowl, Artemis Fowl's mother contracts a debilitating disease, which Artemis can not heal with magic, but tries and makes Angeline's condition worse. Artemis desperately contacts Captain Holly Short and &#8470;1, in hopes that they will be able to shed some new light on his mother's condition. They determine Angeline is suffering from Spelltropy, a fairy disease that is spread through the use of magic, and can only be cured by the brain fluid of the silky sifaka lemur of Madagascar. Unfortunately, the lemur is extinct, due to a ruthless deal Artemis made almost 8 years ago with a group called the Extinctionists. Foaly tells him that his mother will die without the cure. Artemis pleads for &#8470;1 to open up the time stream, allowing him to save the lemur, and thus his mother. Foaly argues against the idea, but due to Artemis' lying to Holly, saying that she infected Angeline with Spelltropy, Holly agrees to help Artemis immediately to make up for it, and Foaly had to give in. They arrive nearly eight years earlier in Artemis' study. The time stream causes Artemis become much hairier while Holly is physically reduced to an adolescent. Artemis assures Holly that the past Butler will quietly slip the lemur into the room (to avoid Angeline seeing it) and that they will simply be able to leave. Butler however, does not act according to Artemis' predictions. He tranquilises the two, and locks them in the trunk of the Fowl Bentley. Artemis and Holly escape with the help of Mulch Diggums, a kleptomaniac dwarf who has partnered up with Artemis in the future. After following his younger self to an animal park to retrieve the lemur, Artemis breaks into the wrong cage and is attacked by a gorilla, and Holly is forced into action. She heals his wounds with magic, and in a giddy haze of relief after realising he almost died, she kisses him. After, they save the lemur from Rathdown Park, but are forced at gunpoint to release it to young Artemis. While hurrying to the shuttleport in Tara, a guilty Artemis confesses his lie to Holly, who is outraged. Artemis redeems himself by giving Holly a chance to talk with Commander Root, who is dead in their time. Holly becomes neutral to Artemis, then thanks him. They commandeer a shuttle and fly it to Morocco, where the younger Artemis will trade the lemur to the Extinctionists for a hundred thousand euros. The money will go to an Arctic expedition, to help Artemis find his missing father. Instead of capturing the lemur, Holly is captured herself, and sold by the younger Artemis to the Extinctionists, who plan to execute her. Older Artemis races to the rescue, but falls in the execution pit himself. There he discovers that the \"flames\" are holograms, and meets his old nemesis Opal Koboi, who has put the mesmer on the leader of the Extinctionists to help her collect rare species for her research. Artemis escapes, Holly finds him, and they fly back to Fowl Manor to return to the future. However Opal follows them into the time stream, escaping into the future. She takes over Angeline's body and pretends that she was Artemis' mother, but reveals herself when Artemis is about to inject the Spelltropy cure into her system. She also reveals that she caused the resembling symptoms to Spelltropy and made the whole incident herself (she dropped out of the time stream 2 days early and took control). As Koboi gloats, Artemis reveals that he is in fact the Artemis from the past. The older Artemis, returned at the same time, sneaks up to Opal and tranquilises her. Butler was mesmerised by Opal and takes out Holly and &#8470;1. When Butler is ordered by Koboi to take out the younger Artemis, he fights Koboi's mesmer and has a heart attack, but is revived by Artemis with a defibrillator. Opal recovers quickly and flees; however, realising that Artemis and his forces have been significantly weakened in the battle, she returns. Artemis takes \"the lemur\" and flies away from the Manor grounds in a plane, luring Opal away. In the ensuing chase, Opal exhibits the astonishing strength she has won in her research on endangered animals, pulverising entire sections of the plane with her fists, and eventually forcing Artemis to crash land on the coastline, breaking his collarbone in the process. Artemis escapes from the wreckage of the plane and runs to the shore, ascending a rope bridge and crossing over two large boulders. Opal relentlessly pursues him, eventually obtaining the lemur, only to discover that it's not actually a lemur, but Artemis' little brother's play-thing, Professor Primate. Artemis shoots the boulder which Opal is standing on and reveals it to be the shell of a kraken that was unknown to anyone except Artemis himself. The shell explodes and Opal is buried beneath the rubble. When a Lower Elements Police team search for her, they find she has disappeared. Artemis debriefs the others and finds that his mother knows everything that happened to her. The 10-year-old Artemis has his mind wiped and is sent back in time by &#8470;1, but retains an interest in fairies that will set the events of the series in motion. It is then revealed that in addition to the initial time 'paradox' that occurs when Artemis goes back in time to save the Lemur, another (second) paradox exists, because Artemis' interest in fairies sets of a series of events, which have originated from his initial interest in fairies. In this way, both these events are dependent on each other. The series of events that inspires his interest in fairies is also dependent on the second time paradox, from which the reader concludes that a time paradox is always dependent on another. When everyone is gone, Artemis tells his mother the truth about everything, because Opal forgot to wipe his mother's mind."
}