{
    "book_id": "871907",
    "mid": "/m/03kdf2",
    "title": "Artemis Fowl: The Arctic Incident",
    "author": "Eoin Colfer",
    "publication_date": "2002-05",
    "genres": [
        "Speculative fiction",
        "Fantasy",
        "Children's literature"
    ],
    "text": " Artemis Fowl II is the thirteen-year-old son of an Irish crime lord, Artemis Fowl I, and the fairy underworld considers him dangerous. After being falsely accused of supplying contraband to a goblin smuggling ring, Artemis and his bodyguard, Butler, defeat the culprit. In return, the fairies Captain Holly Short and Commander Julius Root of the Lower Elements Police assist the pair in rescuing Artemis' father, whom the Russian Mafia has held hostage. A goblin hit squad ambushes the rescue group, and the group shelters underneath an overhang. Realising that it is a trap, Butler pushes Holly and Artemis out as the overhang collapses. The rubble knocks Butler unconscious and traps him and Commander Root. Holly and Artemis free Root and Butler. Holly questions Artemis about his father and how he came to be so ruthless in the events of the previous book, and, in a rare moment of sincerity, Artemis admits he made a mistake, a sign of his moral development that continues through the series. Meanwhile, Briar Cudgeon ambushes and locks Foaly in the Operations Booth and disables LEP weapons, framing him as the mastermind behind the rebellion against the LEP and leaving the rescue group powerless to stop the goblins as they begin their attack. Foaly sends a text message to the rescue group, revealing that all weapons and communications are controlled by Opal Koboi. Artemis decides to take over Koboi Laboratories and return all weapons to the LEP, interrupting the rescue mission. Holly reveals that Foaly had a hunch that Mulch Diggums, the criminal and kleptomaniac dwarf who had been presumed dead after the Fowl Manor siege, was still alive and in Los Angeles. Knowing that he had broken into Koboi Laboratories before, they go to apprehend him once again. They then break into Koboi Laboratories through a hollow titanium foundation rod. Artemis manages to turn both the goblins and Koboi against Cudgeon. Cudgeon is killed when he is thrown into the open DNA cannon plasma feed which simultaneously blacks out Opal Koboi. The restored power activates DNA cannons in Police Plaza, neutralising all goblins there. However, Foaly is still trapped in the Operations Booth, as the LEP outside, commanded by Captain Trouble Kelp, still thinks he is to blame for the revolt. The rescuers then go to Murmansk and rescue Artemis Fowl I."
}