{
    "book_id": "14610505",
    "mid": "/m/074k1x",
    "title": "Artemis Fowl: The Lost Colony",
    "author": "Eoin Colfer",
    "publication_date": "2006-08-02",
    "genres": [
        "Speculative fiction",
        "Fantasy",
        "Children's literature"
    ],
    "text": " In Barcelona, Spain, Artemis Fowl II and Butler, his bodyguard, wait for a demon. They eventually encounter a demon who would have taken Artemis through time had Butler not touched Artemis and worn a silver bracelet. The silver allows Butler to pull Artemis back through time. Meanwhile, Wing Commander Vinyáya brings Holly Short and Mulch Diggums, who have recently been working on their semi-successful PI business, to secret organisation Section Eight which monitors demon activity. There, Foaly informs them that Artemis Fowl was able to predict a demon materialisation that they were not. Holly is sent to ask Artemis how he could do so. On the demon island of Hybras, which is suspended in \"Limbo\" (where time is nonexistent), &#8470;1, an imp, is bullied because he has not \"warped\" (changed into a mature demon). After turning a wooden skewer into stone, &#8470;1 wonders if he is a warlock, though they all supposedly died. Leon Abbot, the leader of the demon pride, uses something suspiciously like mesmer to urge &#8470;1 to leave for the human world. Artemis, Butler, and Holly arrive at the Massimo Bellini Opera House, where Artemis has predicted a demon appearance. Here again, they see a blond girl they had encountered in Barcelona. Artemis concludes that she knows something about demons. She is identified as Minerva Paradizo. &#8470;1 materialises in a dark corner of the stage and is immediately shot with a tranquillizer dart using a rifle disguised as a crutch by Billy Kong, who is one of Minerva's henchmen, and is also known as Jonah Lee. Minerva leaves for her residence with Holly following. &#8470;1, in Minerva's home, tells her about demon culture. He also learns that Leon Abbot visited this very place under care and that the spell holding Hybras in Limbo is failing. Holly has feigned unconsciousness and is in a cell with Kong. Holly manages to knock him out. When Artemis distracts Minerva, Holly and &#8470;1 escape. Kong, who has some inaccurate knowledge of demons, demands that Minerva obtain another demon to avenge his deceased brother, for which he holds demons accountable. She is unable to comply, and he takes her hostage. Artemis, however strikes a deal in which he will trade &#8470;1 for Minerva at Taipei 101 in Taiwan. Kong plans to strap a bomb onto &#8470;1 and remove the silver bullet anchoring &#8470;1 to this dimension. However, Artemis has already removed it, and has instructed &#8470;1 to drop the silver bullet which he has been holding in his hand. When &#8470;1 drops the bullet, he almost immediately dematerialises but the large pendulum coated with silver, which is near where &#8470;1 is standing, keeps &#8470;1 in this dimension. Holly puts a silver bracelet around &#8470;1's arm when he materialises at the apex of the pendulum. Holly flies up to the next story, which is another observation deck under renovation, and encounters a worker. Holly has already mesmerised the worker so he suspects nothing. They then go down to the 40th floor in the elevator and meet with Artemis, Butler, and Minerva. They go to the Kimsichiog Art Gallery, which has not yet opened. Holly mesmerises the curator to grant them access to the main exhibition, a 10,000 year old sculpture of \"dancing figures\" which is really 4 of the 7 demon warlocks, frozen in stone. One of them had died instantly when his head had snapped off, two more had lost arms and legs. Two more had died from shock and one was missing. Only Qwan, who knew what was coming, had survived. &#8470;1 manages to release Qwan. Kong and his group reach the gallery and try to break the door open. Butler shoots the lock with his SIG Sauer 9mm handgun and destroys it. Kong's group manages to shoot the door until it is \"Drooping slightly on its hinges\". Butler rips the door open, drags Kong inside and with the help of Holly's Neutrino, knocks him to the ground thinking he was unconscious. Minerva kicks him in the leg against Butler's warnings. Kong grabs Minerva's ankle and Butler steps on Kong's wrist, then knocks him unconscious by hitting him between the eyes with his knuckle. In the time this took, Kong's gang gets in the door and one of the men throws a grenade into the room, but Holly shields it with her Section 8 helmet. The bomb gets handcuffed to &#8470;1 and Artemis, Qwan, &#8470;1, and Holly devise a plan to use Holly's wings to carry Artemis, Holly, and &#8470;1 to the next building over. Their plan fails when Holly's wings cut out and they fall against the side of the building. Artemis takes off &#8470;1's silver bracelet and they all dematerialise to Hybras. Artemis reasons that the bomb will provide sufficient energy for a spell to reverse the original time-spell. Qwan tells him that at least five magical beings will be necessary. They all think (with the exception of Artemis, who stole some magic in the time tunnel) that there are only three. On Hybras, Abbot crowns himself the demon king. He is notified that four figures, Artemis, &#8470;1, Holly, and Qwan, have appeared on the volcano. They accuse him of using the mesmer, but he states that demons cannot use magic. Artemis claims that Abbot took magic from Qwan's apprentice and stole it from the time tunnel. When Abbot asks for proof, Artemis reveals that he stole some magic himself. When Abbot states that this is not possible, he demonstrates the fact by creating a spark out of the magic he took from the tunnel, unknown to his companions. With this development, then there will be five magical beings present (Abbot included), enough to reverse the time spell. Holly dies, but Artemis takes advantage of the time spell's disintegration and consequent irregularity to bring her back to life. Artemis, having no experience with magic, is guided by Qwan, and the 'magic circle' is formed. However, not enough magic is available, as Abbot does not contribute enough. At that moment, Qweffor, Qwan's former apprentice, makes his appearance, revealing he has been living in Abbot after the first time spell was interrupted. With Qweffor's increased magic, the party is able to return to Artemis and Holly's dimension. When they land back in the 21st century, Artemis notices that he has switched an eye with Holly. Even though Qweffor's consciousness has once again been taken over by Abbot, &#8470;1 manages to expand Qweffor's consciousness enough to shut Abbot out. Unfortunately, the party is three years off into the future. Artemis now has twin brothers, Ark Sool has been fired, and Mulch has continued the PI firm, also recruiting Doodah Day, a pixie that he arrested with Holly at the start of the book. When Artemis sees Butler, now with a beard, Butler reveals that Minerva has grown to be \"quite a beautiful young woman\" who talks about Artemis extensively and that he is now the big brother of twins."
}