{
    "book_id": "5053182",
    "mid": "/m/0d0n60",
    "title": "Ashes and Diamonds",
    "author": "Jerzy Andrzejewski",
    "publication_date": "",
    "genres": [
        "Novel"
    ],
    "text": " The story takes place in Ostrowiec (probably Ostrowiec Świętokrzyski), Poland, and begins on May 3, 1945, one of the last days of World War II. The characters are all aware that the war will end soon. The Soviet Army had driven the German Army out of Ostrowiec in January, and the Communists are poised to take control of post-war Poland. In the story, Stefan Szczuka is the Secretary of the Province Committee of the Polish Workers' Party (PPR, a party of Communist orientation formed in the Soviet Union), and is expected to play an important role in the new government of Stalinist Poland. A jeep is transporting him to speak at a cement factory in Biała, a nearby town. The jeep is being driven by Frank Podgórski, who is the Secretary of the District Committee of the PPR. Podgórski recognizes a friend (Alicja Kossecka) walking alongside the road, and stops to greet her. Podgórski learns from her that her husband Antoni Kossecki, who was a local judge before the war, had returned from the German prison camp Gro&szlig;-Rosen two days ago. He asks to visit them, and she agrees. Podgórski gets out of the car to talk with his friend which causes a delay. Szczuka impatiently honks the horn to get Podgórski to return to the jeep and resume the trip. Later, as they are driving, Podgórski explains to Szczuka who his friend Alicja Kossecka was and that her husband had just returned from the Nazi captivity. Szczuka mentions that he had also spent time in that prison camp, but cannot remember knowing anyone from Gross-Rosen named Kossecki. Podgórski suddenly remembers that Kossecki had been arrested under an assumed name, so that Szczuka would not have known him as Kossecki, but Podgórski cannot recall what his assumed name was. A short time later, after the jeep passes a narrow point in the road, they find a crowd surrounding another jeep lying on its side at a distance from the road. They stop and go to investigate. They find that the passengers, two workers named Smolarski and Gawlik, have been shot and killed, apparently ambushed at the narrow place in the road they had just passed. On the way back to their own jeep, Szczuka tells Podgórski that he thinks the shots were intended for him (Szczuka). Podgórski suddenly recalls that Kossecki’s assumed name was Rybicki. Szczuka recognizes this name, but doesn’t say very much about what he remembers. Antoni Kossecki and his wife Alicja Kossecka (the couple that Podgórski was telling Szczuka about), have two sons Andrzej (21) and Alek (17). During the war, while his father was at Gross-Rosen, Andrzej was fighting as a partisan, presumably with the Armia Krajowa (AK), although it is never mentioned by name in the story. Andrzej too has now returned home, so the family is together again. Alicja Kossecka returns home from the walk on which she had met Podgórski. She needs 3,000 zloty to purchase some wool. She had hidden this money in a safe place, but discovers that the money has disappeared. The only person who could easily have taken it was her younger son Alek, who was there at home earlier but suddenly left the house shortly after she did. She keeps her suspicions to herself and decides to ask her elder son Andrzej to lend her the money she needs. As she goes to his room, she hears him talking with some friends and overhears fragments of a conversation that he is having with them. These conversation fragments strongly suggest to the reader that Andrzej and his friends were somehow involved in the ambush of the two men in the jeep. Meanwhile, Podgórski drops Szczuka at the Monopol hotel in Ostrowiec, where he is staying. They will both attend a banquet at the hotel later in the evening, but Podgórski says that he first wants to visit Antoni Kossecki, as he had agreed earlier in the day with Alicja Kossecka. As Podgórski and Szczuka part ways, Szczuka asks Podgórski to ask Antoni Kossecki whether he wants to meet him, an old comrade from Gross-Rosen. Podgórski agrees and goes to visit the Kossecki family while Szczuka goes into the hotel. As Szczuka is picking up his room key from the reception desk, a 24-year-old young man, who we later find out is Maciej Chelmnicki, is also at the hotel desk asking for a room. The desk clerk tells Maciej that all the rooms are taken, however Maciej is very persistent and ultimately convinces the desk clerk (with the help of a bribe) to find him a room. By chance, Maciej ends up in the room next to that of Szczuka. Podgórski’s visit to Antoni Kossecki turns into a very long conversation, and Podgórski stays late. They talk about how the War subjected people to conditions that brought out the worst in some of them, and to what extent people can be held accountable for their actions under such conditions. While Podgórski is visiting Antoni Kossecki, Szczuka goes to visit his sister-in-law Katarzyna Staniewiczowa, who also lives in Ostrowiec. She has not invited him, and does not expect him to visit, but he feels that he has to tell her that his wife Maria (the sister of Katarzyna Staniewiczowa) has not returned from the prison camp where she had been staying. When Szczuka arrives, Katarzyna Staniewiczowa has guests who are obviously part of the pre-War aristocracy and disapprove of Szczuka’s politics. In the next room, unknown to Szczuka, Andrzej Kossecki is meeting with Captain Florian Waga. It is apparent that Captain Waga is Andrzej’s commanding officer in a conspiratorial organization (presumably the AK) and has given the order to kill Szczuka, eliminating any doubt that Andrzej and his friends are the ones involved in the ambush earlier that day. Andrzej asks Captain Waga whether it is really necessary to kill Szczuka, and Captain Waga replies that all that matters is that they have been given the order to do so, and that they must obey the order. Back in the living room, the discussion has taken a not very cordial turn. Szczuka tells his sister-in-law about Maria, which is why he came to visit, and decides to leave. After Szczuka leaves, Katarzyna Staniewiczowa and her guests, including Andrzej, all decide to go to the Monopol for entertainment. Captain Florian Waga declines to join them and goes his separate way. Back at the Monopol, Maciej Chelmnicki has gone to the hotel bar, where he chats up the bar maid Krystyna. He is quite taken with her, and tries to convince her to come to his room when she is done with work. While waiting for Krystyna’s shift to end, Maciej is joined in the bar by his friend Andrzej Kossecki, who has just come from the home of Katarzyna Staniewiczowa. Maciej and Andrzej discuss the botched attempt on Szczuka’s life. Andrzej recounts his meeting the Captain Waga, and Maciej promises to finish the job of killing Szczuka. In the main part of the Monopol dining room, separate from the bar, the banquet is beginning. Meanwhile, Alek Kossecki, who has stolen the 3,000 zloties from his mother, is meeting in an abandoned basement with four of his friends, all of whom belong to a conspiratorial organization. During the meeting, their leader Jerzy Szretter calls upon all the attendees to produce the 5,000 zloties that each of them was supposed to bring to the meeting to fund a weapons purchase. All but one of them is able to produce their money. Alek Kossecki confesses that he had to steal part of the money from his mother. The leader tells Alek to keep his money, and demands that his share be paid by Janusz Kotowicz, another of the attendees who is known to have more money than the others. Kotowicz refuses, and Szretter beats him until he surrenders all his money, which turns out to be an enormous amount. Janusz Kotowicz starts to leave, hinting that he will turn them in, prompting Jerzy Szretter to shoot Kotowicz. Back at the hotel, Podgórski has returned from his visit to Antoni Kossecki, and stops by Szczuka’s room on his way to the banquet. While they are talking, Szczuka tells Podgórski that Antoni Kossecki had committed horrible crimes while at the Gross-Rosen prison camp. Podgórski, who knew Kossecki before the War, can hardly believe what he is hearing and reflects about the conversation he just had with Kossecki about moral accountability. At the bar of the Monopol, Krystyna asks her coworker to cover for her so that she can leave early and go to Maciej’s room. Her coworker agrees, and Krystyna does go to Maciej’s room and they spend the night together. Maciej falls seriously in love with her, and begins to reconsider the path he has been following in life. Downstairs, the banquet, which turned into a boisterous party, is ending, and the hotel impresario has the musicians play Chopin’s Military Polonaise as the last guests leave. (This is the scene that appears at the end of the film.) The next day, Maciej spends the entire day with Krystyna. He tells her that he wants to make changes in his life and is thinking about enrolling in a technical school. He meets with Andrzej Kossecki, who is his superior in the secret organization that has ordered the killing of Szczuka which Maciej has been ordered to carry out. Maciej explains to Andrzej that he has fallen in love with Krystyna and wants to change his life, and that he no longer wants to kill Szczuka. Andrzej reminds Maciej that he is under orders to carry out the killing. Maciej finally agrees to kill Szczuka, but says that this will be the last order he will carry out. Maciej writes a note to Krystyna and tells her that he has some business to attend to, and cannot see her for awhile. He says that he has to go to Warsaw, and invites her to come with him, and she agrees. Maciej begins to stalk Szczuka, and follows him to the apartment of a woman who had returned from the same camp where Szczuka’s wife was imprisoned. Szczuka has gone to see her in hopes of learning the fate of his wife. While Szczuka is in the apartment, Maciej enters and kills Szczuka. He returns to the hotel, where he sleeps for several hours. When he awakes he hurries to catch the train for Warsaw. After having killed Szczuka he is nervous about being recognized, and on his way to the train station he raises the suspicion of a patrol, which orders him to stop. He panics and tries to run, and they shoot him."
}