{
    "book_id": "8655941",
    "mid": "/m/027cr_v",
    "title": "Babylon 5: Dark Genesis - The Birth of the Psi Corps",
    "author": "Gregory Keyes",
    "publication_date": "1998-08-29",
    "genres": [
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " In 2115, existence of telepathy has been proven. The resulting media frenzy, panic, violence, and bloodshed lead to the creation of the Metasensory Regulation Authority, the precursor of the Psi Corps, largely due to the efforts of Lee Crawford, an Earth Alliance senator. Much effort is put into establishing the events that had triggered appearance of the telepaths. Crawford's closest aid and successor, Kevin Vacit, continues the search and establishes an ambiguous relationships with the rogue telepaths who refuse to join the tightly regulated Corps. Kevin Vacit is a telepath prodigy who masks his abilities from the Corps and Crawford. Earth Gov has ruled that the director of PSI Corps can not be a telepath and Vacit is able to hide his ability from the PSI Corps tests. A relationship with his bodyguard leads to the birth of his daughter Fiona, who Vacit hides with the Telepath Underground. Fiona does not know who her father is and so she fights to bring down PSI Corps along with other Underground leaders. Fiona is captured by the PSI Corps and undergoes reeducation at the telepath concentration camp where she meets Stephen Walters. With the aid of Stephen she escapes the camp and rejoins the underground. Unknown to Fiona is the fact that Stephen is actually a PSI Corps special operative sent by her father (Vacit) to break her out of the camp. Fiona marries Matthew Dexter, a man she met while inside the telepath concentration camp and gives birth to a baby boy who she names Steven. During this period, Steven Walters defects to the Telepath Underground for real, cutting all remaining ties with Psi Corps. Vacit and Ms Alexander (his aide) travel to Venus investigating the reports of a ship found on the surface. Leaving their ship and venturing alone into the atmosphere of Venus, the pair encounter a Vorlon who tells them about the coming of the Shadows and why telepaths were created among the younger races. The Vorlon leaves a telepathic command in the mind of Ms Alexander for her or her descendant to come to the Vorlon homeworld when the time is right. Lyta Alexander, her granddaughter, carries this embedded command. On the return to Earth, Kevin changes his plans about assisting the underground after realising that the only way they can be ready for the Shadows is if the PSI Corps can control the evolution of telepaths on earth and to reproduce the best of the best who will be needed to defeat the coming of the Shadows. Vacit's daughter Fiona and her husband Matthew are killed in a PSI Corps attack on their home base and their child is given to Stephen to look after. Stephen gives the child to a girl to look after while he goes back to assist Fiona and Mathew. After he realises that they have both been killed he returns to where he left the girl but she and the baby are gone. Baby Steven is picked up by PSI cops and adopted by the Corps. Little Stee is given a new name by his Grandfather, the now director of PSI Corps Kevin Vacit. The book ends with the reveal that the new name given to Stevie Dexter is Alfred Bester. ru:Тёмное происхождение: Рождение Пси-Корпуса"
}