{
    "book_id": "2771999",
    "mid": "/m/081sv3",
    "title": "Betrayal",
    "author": "Aaron Allston",
    "publication_date": "2006-05-30",
    "genres": [
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " Thirty-six years after the fall of the Galactic Empire, the novel begins with Luke Skywalker sensing the dark presence of a mysterious enemy. Jacen Solo and Ben Skywalker are sent on a mission to disable the planet of Corellia's new independent weapons on Adumar. After they are discovered, they fight their way out of the facility and report to the Galactic Alliance of their discoveries. Han and Leia Solo host a dinner with the Skywalkers as guests at LukStation, where the failed peace meeting between the GA and Corellia took place. As this happens, a mysterious tassel is discovered, which Jacen looks to investigate with Ben on the information planet of Lorrd. Jacen and Ben meet up with Jedi Knight Nelani Dinn and they seek to find the meaning imbedded in the tassel. As they do this, they encounter crimes where mentally unstable individuals are motivated by their obsession with Jedi. The crimes all trace back to a woman named Brisha Syo. When arrested and questioned, Brisha demands to speak with the Jedi, to which they quickly acquiesce. Jacen asks what she knows about the crimes on Lorrd, and realizes that she's Force-sensitive. Brisha invites Jacen, Ben, and Nelani to her home on an asteroid near Bimmiel. They agree, so they set course for this asteroid. When they arrive, Brisha informs them that she suspects that there is a Sith Lord in the caves beneath the asteroid, and that she needs the Jedi to get rid of him. They agree, and they follow Brisha down into the bowels of the asteroid. While they're in the cart that's taking them down into the caverns, Ben and Nelani are both yanked out of the travel cart by Brisha through the Force. When Jacen demands why she did it, she informs him that they would have died fighting the Sith Lord. While Jacen's still suspicious of her motives, he goes along with her down to the caves. When Jacen and Brisha are separated, he comes face to face with a dark side version of his uncle Luke Skywalker, and Ben fights a dark side version of his mother, Mara Jade Skywalker; on Coruscant, Luke and Mara are likewise fighting dark side versions of their nephew and son, respectively. At the end of each fight, they each feel uneasy of their battles, except Ben, who is knocked unconscious. Jacen and Brisha reunite, with Brisha saying that she was the one who conjured the dark versions of each of them, as a test for Jacen. Brisha then leads Jacen to a very colorful house in a large cave, and tells Jacen that it was the home of the Sith Lord Darth Vectivus. Brisha also reveals that her true name is Shira Brie, a.k.a. Lumiya, an enemy of Luke Skywalker. She then goes on to explain that Jacen has never heard of Vectivus because he never tried to conquer the galaxy, or tried to eradicate the Jedi Order. She tells him that Vectivus believed in peace and learning, and that Jacen's perception of the Sith has been clouded by the Empire's reign of terror and the Jedi's philosophical and subjective stance against them. By then, Nelani has also arrived at Vectivus' mansion, and tries to arrest Lumiya. She refuses, and she and Nelani do battle, Nelani with her lightsaber, and Lumiya with her lightwhip. All the while, Lumiya tries to convince Jacen that the true Sith way is one of peace and understanding, and that he is destined to become the next Sith Lord, just as Vergere taught him. Lumiya and Nelani's battle ends, and Jacen, stunned by this revelation, peers into the future, and realizes that if he doesn't kill Nelani, each future ends with Luke dying by Jacen's hand. Devastated, Jacen takes off after Nelani when she realizes his intent, and stabs her through the chest with his lightsaber in the midst of combat. When he returns to Lumiya, Jacen wipes Ben's solid memories of his experiences in the Home. And then tells her that he will accept her Sith teachings in order to save the galaxy from spiraling out of control from the upcoming war between the Galactic Alliance and Corellia. The novel ends on Coruscant, where, as Luke senses that the presence of the dark man he sensed at the beginning of the novel is real now, Mara informs Luke that Jacen and Ben are returning home."
}