{
    "book_id": "4630000",
    "mid": "/m/0cdjc2",
    "title": "Black Water",
    "author": "D.J. MacHale",
    "publication_date": "2004-08-03",
    "genres": [
        "Children's literature",
        "Fantasy",
        "Speculative fiction",
        "Fiction"
    ],
    "text": " This entire story is unsettling for the characters. Mark Dimond, now one of two acolytes (librarians for the Travelers' journals) is aghast to find that Andy Mitchell, the school bully, is a scientific idiot savant. Courtney Chetwynde, Mark's partner acolyte and one of Bobby's romantic interests, finds that she is no longer the phenomenal athlete of her earlier years. It starts off where The Reality Bug left. Bobby says goodbye to Aja Killian and flumes to Eelong. There, Bobby discovers a society wherein humans do only menial work, dominated and even enslaved by biped felines called Klee. The enslaved humans, called Gar by their oppressors, have begun a revolution called the Advent and are led by the almighty guardian who is mostly covered by a dark shadow, you can only see his distinct yellow eyes and feathers. At the arranged moment, radio broadcasts will be sent from the hidden Gar capital of Black Water through small amber cubes, demanding that the entire Gar population leave their squalid stables at once and march to their capital, where they can be free. Without them, the Klee cannot maintain their standard of living. Worse, Saint Dane is trying to stir up genocide. To do so, he has poisoned the crops gathered by the races of Eelong, urged the Klee to hunt and eat the Gar, and arranged for Black Water to be bombarded by toxic gases. It is discovered by the acolytes of Second Earth that the poison used by Saint Dane in these plans was taken from the territory of Cloral. The only antidote is likewise Cloran, having been developed by the Scientists of Faar. Eager to take an active role in the Travelers' quest, the children go to Cloral and collect the antidote. With them to Eelong goes the Cloran Traveler, Vo Spader. Because the poison, the antidote, and the acolytes are unique to their respective territories, the interrealitial tunnels called flumes undergo stress and strain in transporting them. On Eelong, Bobby has experienced the most degrading aspects of Gar life and learned from them. With the help of the Klee Traveler Kasha, he makes rendezvous with Gunny at Black Water. There, Kasha is exposed violently to Saint Dane's evil ways for the first time. This encounter creates a passionate dedication to her destiny. Travelers and acolytes work together to bring the antidote to Black Water, where it will be distributed throughout the city's irrigation system. When the Klee under Saint Dane's orders use the poison, it is made harmless. Thereafter, the Klee and Gar live as equals, each doing what they do best as well as contributing to one another's success. Mark and Courtney reluctantly return to Second Earth, while Bobby moves on to Zadaa in pursuit of Saint Dane. However, things do not go according to plan. The flume on Eelong is destroyed by the passage of non-Travelers through it, leaving Spader and Gunny trapped on Eelong. Bobby reaches Zadaa, but Kasha gets hit in the head with a boulder which kills her in the collapse of the flume on Eelong. Bobby, aided by the Traveler Loor, cremates the Klee's body and store her ashes. On Second Earth, Mark and Courtney are intact and home. They learn of what happened through Bobby's journals, although amazed that no time has passed on Second Earth since they left for Eelong. The book ends with Bobby Pendragon writing his 19th journal in Loor's home on Zadaa."
}