{
    "book_id": "4082",
    "mid": "/m/01b56",
    "title": "Blade Runner 2: The Edge of Human",
    "author": "K. W. Jeter",
    "publication_date": "1995-10-01",
    "genres": [
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " Beginning several months after the events in Blade Runner, Deckard has retired to an isolated shack outside the city, taking the replicant Rachael with him in a Tyrell transport container, which slows down the replicant aging process. He is approached by a woman who explains she is Sarah Tyrell, niece of Eldon Tyrell, heiress to the entire Tyrell Corporation and the human template (templant) for the Rachael replicant. She asks Deckard to hunt down the \"missing\" sixth replicant. At the same time, the human template for Roy Batty hires Dave Holden, the blade runner attacked by Leon, to help him hunt down the man he believes is the sixth replicant - Deckard. Deckard and Holden's investigations lead them to re-visit Sebastian, Bryant, and John Isidore (from the book Do Androids Dream Of Electric Sheep?), learning more about the nature of the blade runners and the replicants. When Deckard, Batty, and Holden finally clash, Batty's inhuman fighting prowess leads Holden to believe he has been duped all along and that Batty is the sixth replicant; he shoots him. Deckard returns to Sarah with his suspicion: there is no sixth replicant. Sarah, speaking via a remote camera, confesses that she created and maintained the rumor herself, to deliberately discredit and eventually destroy the Tyrell Corporation, after her uncle Eldon created Rachael based on her and then abandoned the real Sarah. Sarah brings Rachael back to the Corporation building to meet with Deckard, and he escapes with her. However, Holden - recovering from his injuries during the fight - later finds the truth: Rachael has been killed by Tyrell agents, and the \"Rachael\" who escaped with Deckard was actually Sarah. She has completed her revenge by both destroying Tyrell, and taking back Rachael's place."
}