{
    "book_id": "16796971",
    "mid": "/m/0406h5l",
    "title": "Blart III: The Boy Who Set Sail on a Questionable Quest",
    "author": "Dominic Barker",
    "publication_date": "2008-04-07",
    "genres": [
        "Children's literature"
    ],
    "text": " The book starts the day after Blart II: The Boy Who Was Wanted Dead or Alive - Or Both ends, with Blart about to be murdered in his sleep by two assassins. He reacts while dreaming and manages to knock the two assassins unconscious when the emergency bell, the Gigantic Bell of Disaster, rang. It is a bell that rings only in times of national emergency. (It didn't ring in the past books because its clapper was being serviced.) Blart rushes to the throne room, along with Sir Beowulf the Knight(Beo for short), who had been newly appointed by the King of Illyria to fulfill Beo's dream of becoming a knight. There, the King and his Queen address the crowd gathered outside for the ringing of the Gigantic Bell of Disaster. Princess Lois has been kidnapped an hour ago in the night, thus starting a prophecy about Illyria's doom, aptly titled \"The Chilling Prophecy of Endless Torment\". This prophecy states that if a newly-wed princess goes missing at dead of night for one month, Illyria should BEWARE! Unless the husband of the bride, that is Blart, returns her before the month is up, then all of Illyria would be saved, except for her husband who must die. Obviously Blart refuses to go on a quest to fulfill that prophecy as that would result in his death. Capablanca the Greatest Sorcerer in the World is recovering from a poison-induced fever from the Guild of Assassins. Thus, he is unable to accompany Blart on this quest. Beo and Blart, then, interrogate the two assassins in Blart's bedroom, only to find that they have regained consciousness and are escaping. Beo and Blart manage to catch one, Mika, while the other, Uri escapes. Blart and Beo then drag Mika to Capablanca's room to hear his confession. Capablanca is currently being cured by Lowenthal, the Court Physician, with leeches. It turns out that there is another prophecy of doom for Styxia, claiming that the people of the Kingdom of Gregor the Grizzled would rise up in a great revolution, slaughter the royal family and declare itself a republic. Only when Gregor's son, Prince Anatoly, married the heir to the Illyrian throne, that is Princess Lois, would the royal family be saved. But Princess Lois rejected Prince Anatoly's suit. He was determined to persist until he finds out that Princess Lois was married to Blart. (in order to fulfill a prophecy in the previous book) Thus the King decided to kidnap Princess Lois and arrange for a huge bounty to be put on Blart's head for the Guild of Assassins, as well as poisoning Capablanca with a deadly toxin to prevent him from intervening. Beo was not seen to be quite a big problem as Capablanca, and was ignored, much to Beo's indignation. Capablanca, after hearing Mika's confession, lapsed back into deliriousness. Beo and Blart then informed the King of the latest news and repeated the last words that Capablanca said: soup, earwig, hamster, promise and suitors. The last two words reminded the King of a plan Capablanca set in place to deal with the prophecy. Each suitor for Princess Lois, before pressing their suit, must make a solemn vow to defend Princess Lois's marriage with all their power. As Princess Lois has rejected 75 suitors, there are 75 noblemen all over the world sworn to defend her marriage. Messengers will be sent to all of them, asking them to bring a ship of fully armed men to the Illyrian harbour to form the greatest fleet ever seen. This armada will be led by Illyria's new flagship and its captain will be Princess Lois's husband, Blart. The armada will set sail to Styxia and lay siege to the capital until the Princess is returned. Before they set off, Capablanca gives Blart the Misty Mirror of Miracle, which may sometimes clear and show the user something far away. After a brief fiasco where Blart names the new flagship \"The Golden Pig\", they set off to Styxia."
}