{
    "book_id": "11376909",
    "mid": "/m/02r9g3n",
    "title": "Bloodline",
    "author": "Kate Cary",
    "publication_date": "",
    "genres": [
        "Gothic fiction",
        "Children's literature",
        "Horror",
        "Speculative fiction",
        "Fiction"
    ],
    "text": " Bloodline takes place during World War I. John Shaw, a nineteen-year-old, joins the British Army and is sent to the front lines, in the trenches. He works as a communications officer who listens to German radio feeds and translates what he hears. His regiment commander is a man named Quincey Harker, who is the son of Jonathan Harker and Mina Murray from the original Dracula novel. Harker is famous for going on raids in the enemy trenches alone at night, and shows several feats of superhuman strength that seem impossible. He is also shown to be cruel to his men. One night a soldier named Private Smith falls asleep on his watch, and Germans invade the trench. As punishment, Harker orders him to be tied to a wagon wheel on no man's land. Private Smith does not die from being shot or shelled, but appears to die of fear. One night Harker takes John on a night raid to destroy a nest of snipers. However, John gets stabbed in the shoulder with a bayonet. As he passes out, he thinks he sees Harker closely inspecting a large gash in an enemy soldier's throat. Harker carries him back to the trench, which saves his life. John soon becomes very sick with trench fever and believes he is having hallucinations of horrible things involving a hound and beheaded enemy soldiers in no man's land. He is rushed back to England for care. John is cared for by Mary Seward, the daughter of Dr. John Seward, in the old sanitorium owned by Dr. Seward, which was being used as a hospital during the war. Mary remembers seeing John at a garden party several years before, and wants to help him. She reads his journal that he brought with him to the hospital, and learns about the strange and seemingly impossible feats Harker had done. Meanwhile, John is still delirious from the fever, thinking he is still in the trenches instead of back in England. Soon, however, his fever breaks and he becomes lucid. Quincey Harker comes to England, and Lily Shaw, John's sister, invites him to stay at Carfax Hall, John and Lily's house, as thanks for saving John's life. However, Harker begins to seduce Lily, which worries John, as he's seen Harker's cruelty in the trenches. At the same time, Mary and John begin to fall in love, as Mary is John's main nurse at the hospital and they see each other for most of the day. Soon, John is recovered and discharged from the hospital. Harker leaves for London to do some work, and when he returns he tells John that his services are needed there for a few days. While he's gone, he proposes to Mary in a letter. When John returns, he goes to Mary's house with a note left for him saying that Lily and Harker have eloped and gone to Transylvania. Dr. Seward learns of Harker's mysterious nature, and realizes that he is a vampire. With Van Helsing's bag of vampire slaying tools, John and Mary follow Harker to Transylvania. They also read the collection of journals that is the original ' 'Dracula' ' book. John and Mary reach Castle Dracula several days after Harker and Lily. Once there, they learn that Mina, Quincey Harker's mother, is married to Count Tepes, son of Dracula, and that Quincey is Dracula's grandson. It is also revealed that John Shaw is Quincey's half-brother and Lily is John's half-sister, not his full sister as he always thought, who from birth was chosen to marry Quincey. John and Lily's mother, Rosemary Shaw, who was believed to be dead, is also found living at the castle as a vampire. It is all part of a master plan thought up by Tepes to raise the House of Dracul back to power with John and Quincey both united by Lily. Lily is shocked to learn that Quincey is a vampire, but is still determined to marry him, as she still loves him. The day before their marriage, however, she kills herself by jumping out the castle window onto sharp rocks below because she was afraid of becoming a vampire, which was part of the master plan, and knew she would never stop loving Quincey, which would make it impossible to leave him. Meanwhile, Mina turns John into a vampire after convincing him that it is his destiny. A baby is also taken to the castle for Tepes to feed on so he will be strong enough to go to Quincey and Lily's wedding. Once Mary learns of John's transformation, she asks Rosemary Shaw for help escaping, as Rosemary never liked living as a vampire. Rosemary tells Mary where the baby is being kept and about a secret exit from the castle. Then, Rosemary asks to be destroyed because she doesn't want to live with her daughter dead and her son as a vampire. Mary kills her by pounding a stake through her heart. She takes the baby and runs to the courtyard, where the secret exit is. However, she doesn't have the strength to lift the stone lid of the trap door. Surprisingly, Quincey helps her escape by lifting it for her. After Mary's escapes, Quincey goes back to his room. He hears John shouting his name from outside, and looks out the window to see his mother Mina tied to a tree, as Private Smith was once tied to a wagon wheel. The sun comes up and Mina burns to death. John does this because he thinks Quincey killed his mother, Rosemary, when in fact Mary was the one who did it. Quincey then goes to tell his father that he is leaving Castle Dracula forever, but Tepes tries to stop him by attempting to kill him with the sharp end of a wooden chair leg. However, Quincey grabs if out of his hand and stabs it through his father's heart. The book ends with John remaining at Castle Dracula, Quincey going off to live somewhere else, and Mary and the baby, who she names Grace, escaping back to England."
}