{
    "book_id": "2772027",
    "mid": "/m/081sy7",
    "title": "Bloodlines",
    "author": "Karen Traviss",
    "publication_date": "2006-08-29",
    "genres": [
        "Science Fiction",
        "Speculative fiction",
        "Fiction"
    ],
    "text": " \"But the bitterest enemy can be your own flesh and blood - and your foe can turn out to be your only ally.\" In Bloodlines, a civil war continues to break out in the Galactic Alliance, as acts of terrorism on the part of Coruscant's local Corellians force the Alliance to create even more repressive laws. Many families find themselves divided, including the Solo/Skywalker families as Han Solo's Corellian roots and Luke Skywalker's dedication to the Jedi are creating conflict. Meanwhile, Luke and Mara Skywalker fear for their son, Ben, when his cousin and Jedi Knight, Jacen Solo, makes a dangerous choice. This choice shocks both families. After going on numerous raids with Jacen, Ben gets the chance to make a decision about a raid in which he kills two people. This experience shakes him to the core, and he begins to distrust Jacen's teachings. In this novel, the conflict's main author (and Han's cousin), Thrackan Sal-Solo, finally meets his end when Mirta Gev, Boba Fett's granddaughter, shoots him in the head. Meanwhile, Jacen continues on the path to becoming a Sith, deciding that the only thing left for him to do is to \"immortalize his love,\" according to the Sith tassels. Jacen loves Tenel Ka and their daughter Allana very much, but if he is to achieve his full Sith ranking, it appears that he must kill them. While wracked with doubt and sorrow, Jacen decides that the sacrifice is worthwhile if it means he can save the galaxy. With that goal in mind, he believes that he must follow the path of his grandfather, Anakin Skywalker, in order to achieve it. He even \"flow walks\" through time with the Force in order to witness his grandfather's fall from grace (as portrayed in Star Wars Episode III: Revenge of the Sith) and decides that his journey is meant to be different. Jacen may yet acquire full Sith knowledge and acknowledgement and avoid becoming another Darth Vader. The choice that Jacen chooses is when he kills Boba Fett's daughter, Ailyn Vel, during an interrogation; Ailyn had been smuggling military-grade weapons on Coruscant, and Jacen was trying to figure out who would be her target. Although he doesn't get an answer from her, her targets were supposed to be Han and Leia Organa Solo. After he learns of this, Fett decides not to kill Jacen in vengeance, but rather, as he sees Jacen falling to the dark side with his actions against Coruscant's Corellians, the galaxy's greatest bounty hunter figures that it would hurt Jacen more to let him live; by falling to the dark side as he is, and just like his late grandfather Darth Vader had, letting him live long enough to fall to the dark side will have Jacen see his friends and family turn on him in the future. A subplot to Fett's arc is that he has an illness that is degenerating his cells."
}