{
    "book_id": "5107634",
    "mid": "/m/0d2z_5",
    "title": "Blue Moon",
    "author": "Laurell K. Hamilton",
    "publication_date": "",
    "genres": [
        "Fantasy",
        "Mystery",
        "Speculative fiction",
        "Horror",
        "Fiction"
    ],
    "text": " Blue Moon takes place in the apparently fictional town of Myerton, Tennessee. Richard, still recovering from Anita's rejection in The Killing Dance, has been in Myerton for some time, studying a local group of trolls as part of the requirements for his masters degree, and auditioning the women of the local werewolf tribe as possible lupas. The plot begins when Anita receives a call from Richard's brother Daniel. Daniel explains that Richard has been arrested for an alleged rape, and is refusing to hire a lawyer. Anita leaves for Myerton, over the objection of the local Master of the City, with Asher, Damian, and most of the wereleopards as backup. Once there, Anita must simultaneously attempt to uncover why local police have framed Richard and deal with Colin, the local Master of the City, who views her arrival as an act of war. Ultimately, Anita destroys most of Colin's vampires by activating the lupanar of the local werewolf clan, rendering it holy ground, and kills Colin herself by shooting Colin's human servant, Nikki. In the course of her various rituals, Anita ends up having sex with Richard, and they agree that Anita will begin dating both Richard and Jean-Claude. Anita also learns that Richard had discussed her with Jean-Claude and had obliquely asked Jean-Claude whether he would accept Anita taking Richard as a lover. Anita meets Marianne, a Wiccan practitioner who works with Verne's pack. Marianne advises Anita on building the wereleopards into a coherent group. Anita also has a long talk with Damien, and discovers that Jean-Claude gains power from lust and sex. Not only can he feed on the patrons of his strip club Guilty Pleasures, but on sex with Anita, or Anita having sex with Richard. She and Richard discover that the rape charges were an effort by art collector Frank Niley to drive Richard's study project from the area, allowing them to acquire some contested land and complete Niley's search for the Spear of Destiny. In desperation, Niley kidnaps and brutalizes Richard's mother and brother, causing Anita to cross another moral line, torturing Niley's messenger and killing everyone responsible."
}