{
    "book_id": "11829608",
    "mid": "/m/02rtwmj",
    "title": "Briar Rose",
    "author": "Jane Yolen",
    "publication_date": "1992",
    "genres": [
        "Fantasy",
        "Children's literature",
        "Young adult literature",
        "Speculative fiction",
        "Fiction"
    ],
    "text": " The book is divided into two parts, the \"home\", and the \"castle\". The ending is part of the \"home\" section, returning after the castle. The story is based around the German fairy tale of Briar Rose (Sleeping Beauty) which is told by \"Gemma\", an elderly woman, to her three granddaughters. She tells this to the children almost all the time and it is the only bedtime story she ever tells. The times when \"Gemma\" tells the story are flashbacks and alternate between the present-day story. In the present day, Gemma's Jewish family is living somewhere outside a city in Massachusetts. After her grandmother's death, Rebecca Berlin, the youngest of her three granddaughters (referred to as Becca in the novel) begins to believe that there is some meaning behind the bedtime story that her grandmother told to them hundreds of times. She consults Stan, a good friend and journalist who works for an \"alternative\" newspaper and uncovers historical facts. She discovers that her grandmother was actually a survivor of the Holocaust who was persecuted for her Polish ethnicity and Jewish belief, and sent to Chełmno extermination camp to be executed. She decides to visit Chełmno and discovers a link with a man by the name of Josef Potocki in Poland. Becca sets off for Poland to find the identity and the life of her grandmother. In Poland, Josef tells his life story and his meeting with Gemma. In the book, his story is told in the \"castle\" section. He was a target of the Holocaust due to his homosexuality, and became a fugitive, during which time he met many different people, mainly partisans, mainly in Germany. He had heard stories of torture and extermination camps and joined an underground group set out to rescue victims. This leads him to Chełmno (called Kulmhof by the Germans), where he witnesses the gassing to death of numerous people. The people are brought to the camp and then packed into trucks. The trucks drive away, with their exhaust funnelled into the passenger hold. By the time the trucks arrive at their destination, a mass grave, all of the people it was carrying have been gassed to death by the truck exhaust. The people are then dumped into the grave. When Josef sees the bodies of the people dumped, he notices that a woman with red hair (Gemma) is still alive and faintly breathing. He revives her through mouth-to-mouth resuscitation, which the woman, (who is later called KSIĘŻNICZKA, which means 'princess' in Polish) refers to in her fairy tale as \"the kiss of life\". In reality, during this period of time, 320,000 were killed in Chelmno via the method of gassing them in trucks. Later, she hid in the forest with Polish partisans, fighting the Nazis, and married another Jew among them. She became pregnant by him shortly after their marriage. Then he, along with almost all of the other partisans, were killed by the Nazis. She escaped and was brought safely to the United States. She never told a soul about these experiences, rather dealing with the trauma by refashioning them in her mind into the form of a familiar fairytale about an evil witch, a princess rendered unconscious who is then revived by a handsome prince, and a happy ending. The final part of the book is simply a conclusion where Becca returns to the U.S. to tell Stewart and her family about what she discovered. At the airport, Stan is there to pick her up. He kisses her, and says \"We'll get to our happily ever after eventually\"."
}