{
    "book_id": "4863158",
    "mid": "/m/0crjnv",
    "title": "Bumageddon: The Final Pongflict",
    "author": "Andy Griffiths",
    "publication_date": "2005-09-01",
    "genres": [
        "Comic novel",
        "Children's literature"
    ],
    "text": " When Zack got his certificate, the open-air chapel is squashed by a giant-brown-blob (presumably poo, but never mentioned). Everyone fails to get out except for Zack, his bum and Eleanor. While trying to save the others, they find 4 Great White Bums coming towards them. After an argument of who was the real Great White Bum and who was responsible for blobbing the chapel, the trio of bum-fighters manage to escape the 4 Great White Bums. Unfortunately, a fifth Great White Bum flies in front of them and emits what was called a \"death ray\"(which is a teleportation ray) to the three bum-fighters. When they regained vision, Zack and Eleanor are surprised to be in a control center, puzzled. Thinking that Great White Bums had control centers, they heard a familiar voice that had belonged to Ned Smelly. Ned explains that this isn't a Great White Bum, but is in fact a bum-fighting machine called \"Robobum\" who has \"Fully riveted reinforced steel cheeks. Turbo assisted jet repulsion unit. Nuclear wart-head equipped. Matter transport assisted entry and exit. Inside and outside voice options. Onboard tea and coffee making facilities. AND is self-wiping!\" Eleanor explains that everyone is dead. Ned then signals to them to go to the bumcam screens. 3 of them showed destruction to the Pyramids of Giza, New York City and the Eiffel Tower. Ned then explains that Bumageddon is upon them. After that, Ned tells a story that he was hunting for stinkant juice, the most powerful fuel source in the world, when he headed back and the ground collapsed underneath. He found himself in a stinkant nest. He mapped it for a couple of weeks when he found a reservoir full of stinkant juice. He fueled up and found writing on the wall that said \"WARNING! THE GREAT WHITE BUM IS USING THE BROWN HOLE TO SEND PREHISTORIC GREAT WHITE BUMS FORWARD THROUGH TIME. STOP HIM OR THE WORLD IS DOOMED!\". Underneath this was 3 skeletons and that one was holding Imperial Leather soap. This was Zack's grandmothers' favorite soap. After a series of talking, Ned says that Robobum was equipped with time travel. Together, they go back to the bumosaurs' period. Unfortunately, Ned's temporal navigator has a loose screw and sends them back 650,000,000 years instead of 65,000,000 years. Then they find one of the earliest primitive forms of life which turns out to be a bum, thus proving that Sir Roger Francis Rectum was correct about bumolution. Eleanor then takes a photo of the bum. The bum flips on its back to show a clump of eggs, which all hatch except for a pure white one. Zack concludes it's the Great White Bum and tries to kill it, but it gets away. Then, Robobum transports them back in to herself and turns on the tracking system, changing course 50 times. Suddenly, Zack hits his head on the temporal navigator, fixes the loose screw and they travel to the Crapaceous period about 65 million years ago. All three bum-fighters lose their mind and are revived by the fart of Zack's bum. A tyrannosore-arse rex chases them. Robobum is put under manual control by Ned when another tyrannosore-arse rex chases them. Robobum is left by herself to fight them while the three are yet AGAIN in trouble when a tricerabutt chases them. Zack uses his certificate as a cape that a matador uses. This is when we find out Zack's middle name (Henry). The three bum-fighters escape into an undergrowth where they find a guide bum. It tells about the Crack of Doom, the breeding place of Great White Bums. The guide bum guides them toward it while Zack's bum believe it may lead them to a trap while Zack is swatting giant mutant zombie blowflies. A poopasaur almost eats Zack and Zack's bum believes the guide didn't warn about poopasaurs. The 5 bums and bum-fighters rest in a campfire and are stolen by stinkants and find the warning that Ned had seen. There they see Zack's gran, the Forker and the Flicker. Zack's bum and Ned are then brought by other stinkants. Robobum then comes along and squashes all the stinkants. Meanwhile, Gran and the Flicker and the Forker stay behind to finish the message. The guide bum is revealed by Eleanor to be her bum, but her bum gets off, abandoning her. Robobum says she would be the guide, except her BPS wasn't working. She then says that there is an abnormal amount of methane to its north-east. Robobum tries to fly away but remains on the ground. It was found in a sticky vine. Zack, Eleanor, Ned and Zack's bum were cutting through the strands when they hear a voice. Zack and his bum crawl along the vine to find out it was the Mutant Maggot Lord. A bumantula spots them and they quickly get back into Robobum. The bumantula almost crushes them when they are found by the Great White Bum. He pulls off the bumantula, punches it for a while and pulls off its legs. Eleanor realises the Mutant Maggot Lord was in Robobum. He tells the story that after the blowflies were spat out the brown hole they vomited him up. He pulled his pieces back together. He is then renamed the Mutant Spew Lord. Suddenly, Stink Kong, the Great White Bum's mortal enemy, fights the Great White Bum while Robobum is carried away by a bumadactyl. Eleanor sees her bum in the bumadactyl's beak and goes to save her. After saving her bum, Eleanor and Zack go back into Robobum only to find out the Mutant Spew Lord killed Ned. Zack wonders if he had change alliance again. Zack realizes his bum is gone but when Robobum is carried away his bum falls out of the roof. The Mutant Spew Lord almost shoot Eleanor but her bum jumps in front and gets shot instead. Eleanor grabs the bum-gun out of his arm (which Zack thought was an arm). Unfortunately, the bullets pass through him as the Mutant Spew Lord is actually 99 percent water. Robobum insists on using \"wet and dry suction hose located in hall closet\" (a vacuum cleaner). Zack vacuums the Mutant Spew Lord. Zack's Bum is giving Eleanors bum \"bum-to-bum resuscitation\" and she wakes up. Zack and his bum drag Ned's body and his guidebook into the matter transporter and take him up. The Great White Bum arrives at the Crack of Doom with Robobum, where the arseteroid should be hitting. Eleanor and the bums tell Robobum shes wants a wedding dress, flowers and music. The great White Bum accepts and leaves it up to 3 Great White Bums to get her stuff, in which Zack believes is impossible. Unfortunately an hour later, a wedding dress made out of paper-thin bark, a bouquet of ferns and grasses and \"THE GREAT WHITE BUM QUARTET\" come back. Zack says that the music is so unpleasant and smells really bad. The wedding starts with the Prince and Maurice conducting the wedding. Zack and Eleanor plan to blow the nuclear wart-head out at the Great White Bum when he's under the asteroid. Unfortunately, the Mutant Spew Lord puddle comes out and tells the Prince and Maurice that Robobum is a robot. Zack, Eleanor and their bums are shook out. The Mutant Spew Lord Puddle calls the Great White Bum a \"big, pimply loser with half his left cheek missing who doesn't know who his true friends are\" (In the previous book, it was half of the Great White Bum's right cheek missing the skin.). The Mutant Spew Lord Puddle is soaked up in Robobum's dress and thrown into the Crack of Doom. Robobum locks the Great White Bum into an unbreakable hug right under the arseteroid. He tells that the other Great White Bum Zack had disturbed and chased 585 million years into the future was still on Uranus. Zack and Eleanor finally think its all over. Suddenly, Zack's bum steps forward and says that while Eleanor and Zack were saving her bum, he and Robobum discussed the problem, and shot an interplanetary death ray at Uranus, eradicating all forms of life, including Great White Bum's, on Uranus. The arseteroid hits and surely kills everyone at the wedding. Zack and Eleanor find themselves on hay bales. Ned Smelly comes in and tell them to get out. Zack finds a letterbox that says \"Ed Kelly\" on the front, meaning that he must have changed the Earth, but his bums were now attached to their owners and weren't talking. Zack's home city is now known as \"Marbletown\", the Kicker is a footy coach, the Smacker became a baker, Silas became a fishing supplies owner and the Kisser owns new and used cars. Zack meets Percy Freeman, his long-dead grandfather and find out that all their parents are alive. Zack's parents are now playing wind sections in an orchestra. Eleanor's parents are also alive. She tells her mother that she had to rescue Zack on many occasions about bums, bum-fighting and bumosaurs but she doesn't believe her. Zack and Eleanor wash their hands and shockingly, find their bums gone. Zack and Eleanor then see them on the windowsill looking at the sunset hand-in-hand. Zack states its only just begun."
}