{
    "book_id": "2461964",
    "mid": "/m/025sb5z",
    "title": "Casino Royale",
    "author": "Ian Fleming",
    "publication_date": "1953-04-13",
    "genres": [
        "Spy fiction"
    ],
    "text": " M, the Head of the Secret Service, assigns James Bond, Special Agent 007, to play against and bankrupt Le Chiffre, the paymaster for a SMERSH-controlled trade union, in a high-stakes baccarat game at the Royale-Les-Eaux casino in northern France. As part of Bond's cover as a rich Jamaican playboy, M also assigns as his companion Vesper Lynd, personal assistant to the Head of Section S (Soviet Union). The French Deuxième Bureau and the CIA also send agents as observers. The game soon turns into an intense confrontation between Le Chiffre and Bond; Le Chiffre wins the first round, bankrupting Bond. As Bond contemplates the prospect of reporting his failure to M, CIA agent Felix Leiter helps Bond and gives him an envelope with thirty-two million francs and a note: \"Marshall Aid. Thirty-two million francs. With the compliments of the USA.\" The game continues, despite the attempts of one of Le Chiffre's minders to kill Bond. Bond eventually wins, taking from Le Chiffre eighty million francs belonging to SMERSH. Desperate to recover the money, Le Chiffre kidnaps Vesper and subjects Bond to brutal torture, threatening to kill them both if he does not get the money back: before he does so, a SMERSH assassin bursts in and kills Le Chiffre as punishment for losing the money. The agent does not kill Bond, saying that he has no orders so to do, but cuts a Cyrillic 'Ш' (sh) to signify the SHpion (Russian for spy) into Bond's hand so that future SMERSH agents will be able to identify him as such. Lynd visits Bond every day as he recuperates in the hospital and he gradually realises that he loves her; he even contemplates leaving Her Majesty's Secret Service to settle down with her. When Bond is released, they spend time together at a quiet guest house and eventually become lovers. One day they see a mysterious man named Gettler tracking their movements, which greatly distresses Vesper. The following morning, Bond finds that she has committed suicide. She leaves behind a note explaining that she had been working as an unwilling double agent for the MVD. SMERSH had kidnapped her lover, a Polish RAF pilot, who had revealed information about her under torture; SMERSH then used that information to blackmail her into helping them undermine Bond's mission, including her own faked kidnapping. She had tried to start a new life with Bond, but upon seeing Gettler – a SMERSH agent – she realised that she would never be free of her tormentors and that staying with Bond would only put him in danger. Bond informs his service of Vesper's duplicity, coldly telling his contact, \"The bitch is dead now.\""
}