{
    "book_id": "10072879",
    "mid": "/m/02q0wwk",
    "title": "CHERUB: The Fall",
    "author": "Robert Muchamore",
    "publication_date": "2007-03-15",
    "genres": [
        "Thriller",
        "Spy fiction",
        "Children's literature"
    ],
    "text": " An MI5 operation goes disastrously wrong when two agents working with James murder their prime suspect, Denis Obidin, and he is trapped within Aero City, Russia. He is not able to contact campus and when he attempts to he is beaten up badly by a group of Russian thugs. They have heard of a reward offered for James' capture, and as such they call the hotline. A short while later, a man appears, hands them their reward and bundles James into a car. Once they are driving, he reveals himself to be a CIA agent working undercover, and takes James back to his flat where he treats the boy to the best of his ability before challenging him as to why he was there, and why the suspect was killed. When James protests that their intentions were peaceful, he is shown CCTV footage of the murder. The agent lets James call CHERUB campus before he leaves, telling him not to go to sleep at any cost. Ewart appears a while later and takes James to an airfield where two British service people are to help with their escape. The Russian authorities appear, though, and they are forced to take the couple with them. On the flight, James passes out when air trapped in his broken nose expands due to air pressure changes and the pilot ends up making an emergency landing in Helsinki, Finland. Half a week later, James wakes up in hospital on CHERUB campus to the relief of Lauren and Kerry. Once he is up and about, James is made to choose between helping junior CHERUBs preparing for Basic Training or a course in socioeconomics. James chooses the PE training, and is asked to \"help\" a redshirt, Kevin Summer, who is scared of heights. Bruce Norris helps, but breaks his ankle falling from the height course. However, while this freaks James out, Kevin gains confidence and soon decides to try the height course alone. He succeeds, and James is rewarded for his work by having his history GCSE pass guaranteed. Meryl Spencer and some of James' best friends get together and organize a day out and they think he deserves it after all he went through. James has no idea what is happening until he gets a message from Meryl.He heads down to her office terrified as he doesn't know why she wants him. When he arrives he learns that all his friends have put together enough money and vouchers to go to a fancy hotel. Firstly they go motor carting and later they go a Spa Hotel where they get drunk and James pressures his girlfriend Kerry to have sex with him. She refuses and leaves in a crying state, but forgives him the next morning. After the Russia disaster, James has been suspended from all missions and after a talk with Mr. Pike, he suspects Ewart, the mission controller, of betraying him. James needs to have his history homework finished and spills coffee over Kerry's work while he was copying off it, landing in a fight. James is later heartbroken when Kerry shouts at him and accidentally mentions him screwing his mission. James later asks Kerry to help him investigate, but refuses, so James goes alone. While looking through Ewart's office, James is caught by Dana, another CHERUB agent, who decides to help. From investigating some papers they found in the office, they find out that Ewart has been lying about how much evidence he had. After, Dana admits that she fancies James and they end up kissing. Then it leads to stripping and Dana allows James to see her breasts. However, as things develop Lauren walks in and sees James with Dana's bra in his hand. James tries to wiggle out of trouble by saying it was an accident. Lauren is upset and as James tries to comfort her she says to James that he thinks humping is like eating chips. The next morning Dana and James take one of the CHERUB's pool cars and follow Ewart who meets an old reporter who used to write stories about Lord Hilton, a rival of Denis Obidin (James' mark from the Russia mission) and uncovered links that suggested that Lord Hilton was having people who endangered his son's political career and his own aeroplane business assassinated. He had arranged for Ewart to be killed but James and Dana saved his life for which Zara is very grateful. She apologises for keeping James in the dark and awards him and Dana the black shirt. By now, James had decided that he wants to date Dana. When the new couple go to dinner, Kerry (who found out about their kiss from Lauren) starts a fight with Dana. A food fight breaks out as James stands there, grinning as all hell breaks loose around him and that Dana and Kerry are fighting over him."
}