{
    "book_id": "8821138",
    "mid": "/m/027kyq5",
    "title": "CHERUB: The Recruit",
    "author": "Robert Muchamore",
    "publication_date": "2004-04-30",
    "genres": [
        "Thriller",
        "Spy fiction",
        "Children's literature"
    ],
    "text": " The book begins with James Choke getting sent to a children's care home called Nebraska house, after his mother dies from a alcohol related incident, where he shares a room with best friend Kyle Blueman, a CHERUB agent who recruits him. Meanwhile James' sister Lauren is taken to live with her father Ron Onions a scumbag of a step dad. James gets arrested for stealing beer. Next morning James awakes to find himself on the CHERUB campus where the chairman, Dr Terrence McAfferty - often called 'Mac' - introduces him to CHERUB and puts him through a series of entrance tests which he passes, including James changing his surname to Adams. James is admitted into CHERUB. In order to start going on missions all agents must complete Basic Training. Before this, however, he must learn to swim as he has a fear of swimming. He is taught by Amy Collins, a sixteen-year-old cherub in which he passes. During this James meets Kerry Chang, with whom he has a strong friendship. James' first mission takes place in the hippy camp Fort Harmony. James and Amy Collins must befriend the hippies at Fort Harmony and find out more about the potential attack at Petrocon 2004 by the terrorist group Help Earth. The two discover a plot to release anthrax bacteria into the air in the conference centre. James then gets the anthrax virus and is rushed to a military hospital where he is then treated. The police are called in and they raid Fort Harmony to prevent the attack from happening. Fort Harmony is burnt to the ground, and James is saved. * James Adams/Choke: The main character, a twelve year old boy whose mother dies from an alcohol overdose. He meets Kyle Blueman at Nebraska house, a children's home. He joins CHERUB and changes his name from Choke to Adams. Later he embarks on a mission to overthrow an eco-terrorist plot. * Kerry Chang: Kerry is James's basic training partner. She is one of James's closest friends and has a severe knee injury, which prevented her from completing basic training in the past. * Amy Collins: She teaches James to swim and joined him on the mission to infiltrate the Eco terrorist group known as 'Help Earth'. * Bruce Norris: Bruce is a master martial artist, but is revealed to behave like a baby. He is one of James' best friends. * Kyle Blueman: Kyle is James' best friend. He is the first person James knows at Cherub because of the fact that James shared a bedroom with Kyle at Nebraska house. Kyle is two years older than James' and meets his first girlfriend in the process."
}