{
    "book_id": "10707281",
    "mid": "/m/02qmtyw",
    "title": "CHERUB: Mad Dogs",
    "author": "Robert Muchamore",
    "publication_date": "2007-10-01",
    "genres": [
        "Thriller",
        "Spy fiction",
        "Children's literature"
    ],
    "text": " The plot revolves around two major drug dealing gangs in the turf war surrounding the collapse of KMG (Keith Moore's Gang) (See CHERUB: Class A). Gabrielle O'Brien and Michael Hendry are sent to infiltrate the infamous 'Slasher Boys', led by a man who calls himself Major Dee. Later on Gabrielle is stabbed badly in the stomach and back and is sent back to campus. Michael Hendry still stays. In the first part of the book it describes how James Adams15 years old, and his new girlfriend Dana 16 years old, are helping on the last few days of Basic Training as instructors. While there Mr Kazkov is accidentally knocked out when a kid Kevin throws a smoke canister at him. The seven trainees, realising it will be ages before Mr Pike and Dana get to the tents, attack James, his arms and legs are tied together, and the Kids get food and drink. Dana finds James tied up and gagged with a rag crammed into his mouth much later. Although Mr Pike says he would get in trouble if all the trainees were failed, he agrees they should be punished. James says the two ringleaders were Kevin and Ronan, they are dragged out of their tents and forced to stand to attention holding rifles until dawn, which will be in hours. James feels upset about punishing them, but Kazkov says 'A soldier is only as tough as the person who trains them.' After Gabrielle O'Brien's serious injury the Ethics Committee was thinking of calling off the mission but they decided that they would wait and see. Norman Large tries to blackmail Lauren so he can be a teacher at CHERUB again. Kyle, James, Kerry, Lauren and Bruce play a trick on Mr Large's adopted daughter, Hayley Large-Brooks, by getting James to go on a date with her. During the date, Hayley and James play footsie and Hayley get up and signals James to go with her. They cut through a play area and go out the emergancy exit, where Hayley throws herself at him, and they start to kiss, with James' hand on her breasts and Hayley's hands down his trousers. They counter-blackmail Mr. Large with these but they get caught and punished, especially Lauren. Before James leaves for his next mission they have a leaving party for Kyle who is going on a gap year and later going to study Law at Cambridge. James Adams and his friend Bruce Norris are sent to infiltrate the group known as the Mad Dogs. James uses his past relationship with Junior Moore to make infiltrating the gang easier. He is soon accepted into the gang and given a major role. An older gang member, Wheels, takes him on a hotel robbery, where they bind and gag the two room occupants, take several grand out of their bank account, and steal their car. However, James being given a high role annoys Junior, who Sasha Thompson, the Mad Dogs leader, is trying to protect. Junior then gets busted for an armed robbery and is sentenced for 6 years. He contemplated suicide when he was caught, but a policeman calmed him. Meanwhile, Sasha plans a great drug robbery on Major Dee. They get into an apartment where some gangmembers are by pretending the people need to fill in a form. They then taser the Woman who opens the door, before capturing nearly all the people inside with the use of handcuffs and rubber gags. James decides to help a young boy found inside who is not treated well, and one of the cocaine dealers is freed so he can continue dealing and avoid suspicion. However the gang have to leave not long after. James, though reluctant, loses his virginity to Sasha's daughter Lois, who suddenly meets him when he is having a bath. James tells his girlfriend Dana and Dana, although hurt, forgives him. Afterwards, James, Bruce and Michael successfully complete their mission and Bruce earns a black shirt. Mid- way in the book all the fellow members of CHERUB visit a memorial place for all the cherubs that lost their lives, there were only 4 members so far."
}