{
    "book_id": "1544083",
    "mid": "/m/0593hs",
    "title": "Cloud Atlas",
    "author": "David Mitchell",
    "publication_date": "2004",
    "genres": [
        "Fantasy",
        "Fiction",
        "Novel"
    ],
    "text": " Cloud Atlas consists of six nested stories that take the reader from the remote South Pacific in the nineteenth century to a distant, post-apocalyptic future. Each tale is revealed to be a story that is read (or observed) by the main character in the next. The first five stories are interrupted at a key moment. After the sixth story, the other five stories are returned to and closed, in reverse chronological order, and each ends with the main character reading or observing the chronologically next work in the chain. Eventually, readers end where they started, with Adam Ewing in the nineteenth century South Pacific. *The Pacific Journal of Adam Ewing. The first story begins in the Chatham Islands, a remote Pacific Ocean archipelago. Adam Ewing, a guileless American notary from San Francisco during the California Gold Rush, awaits repairs to his ship. There, he learns about the enslavement of the peaceful Moriori tribe by the warlike Māori. He also befriends a doctor named Henry Goose, and catches the eye of a Moriori slave, Autua, who is being whipped. Later, as the ship sails Adam is diagnosed by Dr Goose as being ill and in need of his treatment. At the same time, he finds Autua, who has joined the ship as a stowaway and asks him to help. Adam, helps Autua get a job on the ship, but is becoming increasingly ill despite Dr Goose's treatment. At this point the story suddenly breaks off in mid-sentence. *Letters from Zedelghem. The next story is set in Zedelghem, near Brugges, Belgium, 1931. It is told in the form of letters from Robert Frobisher, a penniless young English musician, to his lover, Rufus Sixsmith, back in Cambridge. Frobisher finds work as an amanuensis to a composer, Vyvyan Ayrs, living in Belgium. There he helps Ayrs with his compositions, while also seducing Ayrs' wife and daughter. At one point, Frobisher briefly mentions reading a printed text of The Pacific Journal of Adam Ewing, and is annoyed that half the text is missing; he is amused that the author seems unaware that Dr Goose is poisoning him. *Half-Lives: The First Luisa Rey Mystery. The third story is written in the style of a mystery novel, and is set in Buenas Yerbas, California, in 1975. Luisa Rey, a young journalist, investigates reports that a new nuclear power plant is unsafe. At one point, she encounters Rufus Sixsmith, the addressee of the letters in the previous story, in an elevator. Sixsmith, now an elderly scientist, hints that the nuclear power plant on Swannekke Island in unsafe. Shortly after, he is murdered, and Luisa learns that that the businessmen in charge of the plant are conspiring to cover up the dangers and are assassinating potential whistleblowers. From Sixsmith's hotel room, Luisa manages to get hold of a copy of the report on the plant's safety issues; she also picks up an envelope containing some of Frobisher's letters and reads them. But the hired assassin follows her and pushes her car off a bridge, at which point the story breaks off. *The Ghastly Ordeal of Timothy Cavendish. The fourth story is comic in tone, and set in Britain in the present day. Timothy Cavendish, a 65-year-old vanity press publisher, flees the brothers of his gangster client. His brother, exasperated by Timothy's endless pleas for financial aid, books him into a remote hotel, which in fact turns out to be a nursing home from which Timothy cannot escape. In the course of his adventures, Timothy briefly mentions that he is reading a manuscript from a prospective author entitled Half-Lives: The First Luisa Rey Mystery, which he is not impressed by. *An Orison of Sonmi~451. The fifth story is set in Nea So Copros, a dystopian futuristic state that is gradually revealed to be in Korea and to be a totalitarian state that has evolved from corporate culture. It is told in the form of an interview between Sonmi~451 and an 'archivist', who is recording her story. Sonmi~451 is a genetically-engineered fabricant (clone), who is one of many fabricants grown to work at a fast-food restaurant called Papa Song's. Fabricants, it is revealed, are treated as slave labor by 'pureblood' society. Sonmi encounters figures from a rebel underground who draw her out of the cloistered fabricant world, and reveal the realities of the abuse of fabricants in Nea So Copros. At one point, she briefly mentions seeing a group of purebloods watching an old movie entitled The Ghastly Ordeal of Timothy Cavendish. *Sloosha's Crossin' an' Ev'rythin' After. The sixth story occupies the central position in the novel, and is the only one not to be interrupted. An old man, Zachry tells a story from his youth. It is gradually revealed that he lives in a primitive post-apocalyptic society on the Big Island of Hawaii. His people, the valley folk, are peaceful farmers, but are often raided by the Kona tribe from the other side of the island. Zachry's people worship a goddess called Sonmi, and know that once there was an event called 'The Fall', in which the civilized peoples of the earth - known as the 'Old Uns' - collapsed, and the surviving humans have been reduced to primitivism. They have short lifespans due to a poisoned environment that causes disease and mutation. Big Island is occasionally visited and studied by a technologically sophisticated people known as the Prescients who arrive in white boats. One Prescient, a woman called Meronym, comes to stay with the villagers, and gradually reveals that she needs a guide to take her to the top of Mauna Kea volcano, a place the villagers are afraid of because of the mysterious temples on its summit. Zachry reluctantly guides her. It is revealed that the 'temples' are in fact the ruins of the Mauna Kea Observatories. Meronym shocks Zachry by telling him that their god Sonmi was in fact a human being, and shows him an 'orison' - an egg-shaped recording device that replays Sonmi telling her story to the archivist. Upon their return, the village is invaded by Kona tribesmen who enslave the villagers. Zachry and Meronym escape, and she takes him to a safer island. The story ends with Zachry's child recalling that his father told many unbelievable tales. The child admits that part of this one may be true because he has inherited Zachry's copy of Sonmi's orison, which he often watches, even though he doesn't speak her language. *An Orison of Sonmi~451. In the second part of the fifth story, Sonmi learns the truth about Nea So Copros: that the fabricants are not released once they have served their time at work, but are killed and recycled into food and more fabricants. At the encouragement of the rebels, she writes an abolitionist Declaration that tells the truth and calls for rebellion. She is then arrested, and finds herself telling her tale to the archivist. She then reveals that she knows everything that happened to her was in fact instigated by the government, to create an artificial hate figure in her that will encourage the oppression of fabricants by purebloods. But she believes her Declaration will be inspirational. Her last wish before being executed is to watch the film she remembers seeing, The Ghastly Ordeal of Timothy Cavendish. *The Ghastly Ordeal of Timothy Cavendish. In the second part of the fourth story, Timothy Cavendish and a band of plucky inmates escape from the nursing home. He sorts out his problems back in London. At the end of his story, he notes that The First Luisa Rey Mystery turned out to be a good read after all, and he is inspired to write his own story as a screenplay. *Half-Lives: The First Luisa Rey Mystery. In the second part of the third story, Luisa Rey escapes from the sinking car and by detective work successfully locates the report into the Swanekke power plant, and exposes the corrupt corporate crooks. Along the way, inspired by reading his letters, she orders Robert Frobisher's obscure Cloud Atlas Sextet at a record store, and is perturbed to find that she recognizes it, even though it is a very rare piece. At the end of the story, she receives a letter from Rufus Sixsmith's niece, containing eight more letters from Frobisher. *Letters from Zedelghem. In the second part of the second story, Frobisher continues to pursue his affairs, while developing his own Cloud Atlas Sextet. Along the way, he discovers the second half of The Pacific Diaries of Adam Ewing propping up a table. He ultimately leaves Vyvyan Ayrs' employment and secludes himself to finish the Sextet, before deciding to kill himself as he believes he has completed his best work. Before shooting himself, he writes a last letter to Sixsmith, and includes his Sextet and Ewing's Pacific Diaries. *The Pacific Diaries of Adam Ewing. In the second part of the first story, Ewing visits the island of Raiatea where he observes missionaries preaching to the indigenous peoples, whom they regard as savages. Back on the ship, he falls further ill, realizing at the last minute that Dr Goose is poisoning him to steal his possessions. He is rescued by Autua, and having been saved by a slave, resolves to devote his life to the Abolitionist movement. When his father scoffs that human nature will never change and that Ewing's life will amount to \"no more than one drop in a limitless ocean\", Ewing responds \"Yet what is any ocean but a multitude of drops?\""
}