{
    "book_id": "3322963",
    "mid": "/m/095sr1",
    "title": "Crispin: The Cross of Lead",
    "author": "Edward Irving Wortis",
    "publication_date": "2002-06",
    "genres": [
        "Children's literature",
        "Young adult literature",
        "Historical novel"
    ],
    "text": " In 1377 England, a 13-year-old boy, known only as Asta's Son, lives as a peasant in a small village. His village is part of the territory of the feudal Lord Furnival. As the lord has been away for years fighting in a war in France, the village has long been under the direct control of the steward, John Aycliffe. When his mother dies, Asta's Son is left alone as he has no other known relatives. Shortly afterwards, John Aycliffe falsely accuses him of theft, and declares him a Wolf's Head, one who may be killed on sight. Asta's Son turns to the village priest, his only friend, who gives to him a lead cross that belonged to his mother, and reveals that his true name is Crispin. The priest promises to reveal to Crispin the truth of who his father was, but before he can, Aycliffe's men murder him, forcing Crispin to flee the village by himself, pursued by the steward. Having lived his whole life as a poor peasant, Crispin has no knowledge of the outside world, and no useful skills. He is saved from starvation by a traveling jester named Bear, who forces Crispin to swear an oath to become his servant. Realizing that Crispin is still being hunted by Aycliffe, Bear asks to view the writing on the lead cross that Crispin still carries. Bear refuses to tell the illiterate Crispin what the words say, although Crispin realizes that it is very important. Bear jerkey with Crispin, criticizing his lack of knowledge and his subservient personality. Crispin is likewise initially put off by Bear's seemingly treasonous and blasphemous attitudes about freedom for the common man from both noble and religious control. During their travels together, however, Bear begins to teach Crispin various skills and Crispin slowly begins to gain confidence in himself. A true bond of friendship begins to develop, and Bear eventually releases Crispin from his oath of servitude. Instead, he asks if Crispin will become his apprentice, which he happily agrees to. Posing as a father and son, the two travel towards the city of Great Wexly. Although it is the capital city of Lord Furnival's lands, Bear insists that he has important business to complete there."
}