{
    "book_id": "3276363",
    "mid": "/m/092w2q",
    "title": "Dark Lord: The Rise of Darth Vader",
    "author": "James Luceno",
    "publication_date": "",
    "genres": [
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " Dark Lord: The Rise of Darth Vader begins in the final hours of the Clone Wars, just before the implementation of Order 66 as depicted in Revenge of the Sith. When a contingent of clone troopers on the planet Murkhana refuses to open fire on Jedi Masters Roan Shryne and Bol Chatak, along with Padawan Olee Starstone, the Jedi with whom it has fought alongside during the war, Emperor Palpatine orders Vader to investigate the matter. Vader's query soon becomes a hunt for the fugitive Jedi, and takes him back to Coruscant, and from there on to Alderaan and Kashyyyk. During the course of Vader's search the whereabouts of several other characters from Episode III, including Bail Organa, R2-D2 and C-3PO, Chewbacca, and Obi-Wan Kenobi. The beginnings of Vader's partnership with Grand Moff Tarkin are also shown. Luceno devotes much of Dark Lord: The Rise of Darth Vader to the internal conflict that Darth Vader undergoes as he tries to shed his former identity of Anakin Skywalker and relearn to master The Force. Palpatine intends for these early missions that he sends Vader on to be as much about learning what it means to be a Sith as they are about consolidating the rule of the nascent Empire. The final chapters of Dark Lord: The Rise of Darth Vader depict the beginning of the Imperial enslavement of the Wookiees of Kashyyyk, an act that will eventually lead to the partnership between Han Solo and Chewbacca. The novel ends with Obi-Wan Kenobi learning of Vader's survival after their duel on Mustafar (depicted in Revenge of the Sith). Fearing for the infant Luke Skywalker's safety, he communes with the spirit of Qui-Gon Jinn, who tells him that Darth Vader will never return to Tatooine; as Qui-Gon explains, the planet is the whole of everything that was Anakin Skywalker, someone Vader wants to forget forever. It is revealed that the general public of the galaxy believes that Anakin Skywalker perished in the attack on the Jedi Temple (which, ironically, Skywalker led as Darth Vader)."
}