{
    "book_id": "4910684",
    "mid": "/m/0ctsf5",
    "title": "Darkfall",
    "author": "Dean Koontz",
    "publication_date": "1984",
    "genres": [
        "Children's literature",
        "Horror",
        "Speculative fiction",
        "Suspense",
        "Fiction"
    ],
    "text": " Jack Dawson is a New York Detective dealing with a variety of situations in his life. His wife Linda has recently died, and that leaves him the sole caretaker for his two children Penny and Davey. Aside from missing his wife very much; he is confronted by an especially brutal string of murders of Mafia criminals. These murders are both grisly and unearthly, seemingly done by animals, although forensics cannot determine any living creature that would simply tear a victim to pieces without actually eating anything. Finally, his partner Rebecca is a woman that does not share his approach to this crimewave. Dawson believes that there may be supernatural or magical factors in the killings, while Rebecca believes this to be absurd. Dawson's instincts are seldom wrong; and although he can't deny the initial absurdity of some kind of magic, alternative explanations are disappearing quickly. In truth these denizens are called forth from hell by a bocor(an evil sorcerer of voodoo). Because of their small size Carver Hampton came to the conclusion that this were just minor devils and the hole to hell is not yet big enough to grant access to greater demons. Though these denizens have different appearance they have similar characteristics such as a number of very sharp claws and teeth and the eyes the color of hot silver. At the end of the novel where Jack is about to arrest Lavelle, he was surprised to see that the pit where this demons pass through has gone so big that it has engulfed the shed where it is concealed. Numerous tentacles have sprouted from the pit and dragged Lavelle to hell. When Jack sees this he comes to the conclusion that this was just a mere finger of a greater evil that was about to come. When holy water doesn't stop the pit from growing, Jack uses his blood from the wound inflicted by a tentacle to stop the pit. He fears that if he fails, he will be forced to sacrifice himself into the pit. The novel ends with all the denizens turning to mud and Jack hearing Rebecca say \"I love you Jack\" in thin air."
}