{
    "book_id": "606789",
    "mid": "/m/02vxpm",
    "title": "Dark Tide: Ruin",
    "author": "Michael A. Stackpole",
    "publication_date": "",
    "genres": [
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " In the aftermath of the Battle of Dantooine in the previous novel, the New Republic is taking the Yuuzhan Vong threat more seriously. But so are the Jedi, most notably a rogue one named Daeshara'cor, whose lover, Miko Reglia, had perished during the Second Battle of Helska back in Vector Prime. Therefore, she elects to travel the galaxy to find a way to construct a super weapon to equal the power of the Death Stars, the Eye of Palpatine and Sun Crusher among others in order to eliminate the Vong. Knowing that such a genocidal ambition, even against an aggressively violent species, would lead a Jedi down the path of the dark side of the Force, Luke Skywalker and Anakin Solo decide to find Daeshara'cor and bring her back to the Order. With help from a man named Chalco, they succeed in retrieving Daeshara'cor and bringing her to her senses. In order to rally military support for the New Republic to counter the Yuuzhan Vong, the government sends Leia Organa Solo to negotiate with Grand Admiral Gilad Pellaeon, leader of the Imperial Remnant. Pellaeon agrees to help the New Republic combat the Vong. Caamasi New Republic Senator Elegos A'Kla decides to allow himself to be taken by the Yuuzhan Vong so that by learning about their culture, he can find a way to bring peace between the New Republic and the Vong. He is taken to Commander Shedao Shai to learn of their ways. Corran Horn, Ganner Rhysode, and Jacen Solo embark on a mission on the Vong-held planet of Garqi with a group of Noghri commandos. When they battle Vong forces down on the planet, they find that the warriors die off because of a certain pollen that asphyxiates their armor. The Jedi and commandos learn that the pollen is native to the bafforr trees on the planet Ithor. Corran decides for the pollen to be burned, because if the Yuuzhan Vong figure out about the pollen that can asphyxiate their armor, they will invade Ithor as their next target. Despite the burning, the Vong figure out the source of what asphyxiated their armor anyway and elect to target Ithor. During the investigation of the Garqi battle, which Shedao Shai is leading, the Vong figure out that Corran Horn was among the Jedi in the strike force. After Shai figures out that Corran was the one who was responsible for the deaths of his kinsmen in the previous novel on Bimmiel, he also figures out that Corran and Elegos A'Kla are friends. Therefore, he decides to kill Elegos and sends his jewel-decorated remains to Corran to acknowledge their blood feud. Corran vows to avenge Elegos's death at all costs. The New Republic, Imperial Remnant, and by extension the Chiss Ascendancy rendezvous at Ithor to protect the planet against the invading Vong. The Battle of Ithor commences, with many dying on both sides, until it is later halted by Corran when he makes use of a Vong villip to contact Shedao Shai. They agree to stop the war for at least a galactic standard week, and by the end of that week, Corran and Shai will engage in a death duel to determine the fate of Ithor; if Corran wins, Ithor is spared; if Shai wins, Ithor is destroyed and he collects the remains of his slain kinsmen that Corran and Ganner took from Bimmiel. During this break in the war, Anakin visits Daeshara'cor at one of Ithor's hospitals, since she was mortally wounded in the battle; and it was because she had decided to save Anakin from an imminent Vong attack. Daeshara'cor tells Anakin that it wasn't his fault that she will die, just as it wasn't his fault that Chewbacca perished on Sernpidal, since he blamed himself because he flew the Millennium Falcon off to save everyone aboard. With that, Daeshara'cor dies and fades away into the Force. By the end of the week, Corran and Shai duel, and Corran wins by stabbing his Vong opponent with his lightsaber, killing him. Shai's personal assistant, Deign Lian, who bore witness to the battle for Shai just as Luke Skywalker bore witness to the duel for Corran, agrees to tell the Yuuzhan Vong to leave Ithor alone. However, when he takes control of the forces in Shai's stead, he orders for the planet to be poisoned under command from the warrior caste's leader Warmaster Tsavong Lah. In retaliation, the New Republic, Imperial Remnant and Chiss forces decimate the remainder of the Vong forces left in the battle. But it is too late; Ithor is gone. In the aftermath of the Battle of Ithor, the Yuuzhan Vong, despite their defeat, expand their forces to include more of the Outer Rim territories. The New Republic, Imperial Remnant and Chiss alliance dissolves. And Corran is called the destroyer of Ithor by the New Republic, despite his attempts to save the planet. Therefore, Corran elects to go into a self-imposed exile to his home planet of Corellia, since his guilt was more out of the fact that he felt himself plunge into the dark side of the Force briefly when he killed Shai in retaliation for Elegos A'Kla's death. He then tells those around him at his announcement of his self-imposed exile that, if the New Republic should ever call upon the killer of Ithor to help them counter the Yuuzhan Vong, then the war will truly have gone out of control for the side of good."
}