{
    "book_id": "606784",
    "mid": "/m/02vxny",
    "title": "Dark Tide: Onslaught",
    "author": "Michael A. Stackpole",
    "publication_date": "",
    "genres": [
        "Science Fiction"
    ],
    "text": " In the aftermath of the Second Battle of Helska, the New Republic believes that the Yuuzhan Vong threat is vanished. But the Skywalkers, Solos and their friends and allies find that this is not so; the Vong have yet to bring a dent of their forces into the galaxy. And in order to wage war against the invaders, the Jedi and their allies decide it'd be best to understand them. Leia Organa Solo, with her daughter Jaina and Danni Quee, work to bring various forces throughout the Outer Rim territories to unite against the threat of the Yuuzhan Vong, backed up by pockets of the New Republic military. Luke Skywalker takes his nephew Jacen Solo with him to Belkaden to find out what the Yuuzhan Vong have done there after the late Yomin Carr poisoned it for terraforming in the previous novel. Meanwhile, Jacen's brother, Anakin, is to take Luke's wife, Mara, to the planet Dantooine where she can find time to combat the Vong disease, brought upon secretly by Nom Anor, ravaging her insides. During that time, Mara will also train Anakin to look and use the Force in ways he never imagined as an apprentice. Elsewhere, Jedi Knights Corran Horn and Ganner Rhysode are assigned to the planet Bimmiel to find missing university students. On Belkaden, during Luke and Jacen's observation of Vong behaviors and routines, Jacen, in his sleep, sees a vision of himself saving various people by defeating several Vong warriors. He takes this vision as an omen that he must free the slaves that the Yuuzhan Vong are holding, and so he goes and confronts a few. He is easily beaten, however, and is strapped to the Embrace of Pain, a Vong torture device. He is soon implanted with a slave coral seed, but it isn't long before Luke saves him after fighting through and killing various Yuuzhan Vong warriors and snapping the coral seed out of his face. Luke then tells Jacen that they now must go to Dantooine, where Anakin and Mara are now on the run from Vong scouts. They get there and help them out in defeating the Yuuzhan Vong who intended to kill Mara and Anakin. On Bimmiel, Corran and Ganner find out that the missing university students are being held by two Yuuzhan Vong warriors, who are treating their slaves as much as those Vong on Belkaden do. The two Jedi go and save the students, but are then confronted by the Vong warriors. Corran orders Ganner to get the students out of there while he will take care of the Vong. He is able to dispatch both warriors, but at extensive injury. Fortunately, those injuries would not reach their full lethal potential, as Ganner would return to retrieve Corran so that they can leave the planet with the students. On Dantooine, refugees from the recently Yuuzhan Vong-conquered Dubrillion are settled down. But it isn't long before the Vong then arrive, launching the Battle of Dantooine, resulting in the loss of fifty percent of the New Republic's forces, but the losses are extensive for the Vong, too. Nevertheless, the Vong still win, and the New Republic evacuate what they can. The novel ends back on Bimmiel, where investigating Yuuzhan Vong, led by Commander Shedao Shai, discover the remains of the two dead Vong warriors, defeated by Corran. Shai takes a ndgin (a Vong creature made to sop up blood) and tastes it for Corran's spilled blood that was the result of his injuries. Shai vows that he will kill the Jedi responsible for his the deaths of his kinsmen (the Vong warriors who were killed thanks to Corran)."
}