{
    "book_id": "5357217",
    "mid": "/m/0dh61j",
    "title": "Dawn",
    "author": "V. C. Andrews",
    "publication_date": "1990-11",
    "genres": [
        "Gothic fiction",
        "Young adult literature"
    ],
    "text": " 14-year-old Dawn Longchamp leads a humble, rootless existence with her parents, Ormond and Sally Jean Longchamp, and her moody older brother Jimmy, who is 16-years-old. Moving around a lot, Dawn's family does not provide much stability for her, but what her lifestyle lacks in stability, her home life makes up for in love. This erratic lifestyle seems to change when Dawn and Jimmy are able to enroll in an exclusive private school when Ormond gets a job there. It is here that Dawn's talent for singing is discovered. Her brother does not enjoy the school, feeling the weight of class differences bear down upon him. Dawn, although optimistic, does not fare much better, and is sternly ordered by the headmistress to be on her best behavior as she is of lesser social status than her classroom peers. On her first day, she also incurs the wrath of the most popular and affluent girl in the school, Clara Sue Cutler, after accidentally ratting her out on her smoking. Clara Sue then proceeds to pull mean-spirited pranks on Dawn and openly refers to her as white trash. Deeply offended, Dawn finally stops trying to like Clara Sue after this insult. However, Clara Sue's older brother, the handsome and charming Philip Cutler, does not share his sister's loathing. Phillip is kind to Dawn, and immediately shows an interest in her. He compares her beauty to that of his mother, Laura Sue Cutler, and is easily entranced. Jimmy is wary of Phillip, but does not overtly oppose Dawn's involvement with him. A shy girl who has had a sheltered upbringing, Dawn is somewhat taken aback by Phillip's immediate romantic overtures, even though she does find him attractive. Phillip urges her to date him, and after constant persuasion from him, Dawn agrees. Meanwhile, Dawn's mother, Sally Jean, has discovered that she is pregnant. This strains the Longchamps' finances, which are already tight, but Dawn is still overjoyed at the prospect of a little sibling, hoping that the baby will look more like her. Sally Jean gives birth to a little girl named Fern, but does not recover her health after the labor. She attempts several holistic ways of recovering her health but to no avail. She remains bedridden for the duration of Dawn's school year. At school, Dawn is excited by the musical opportunities now opening up to her. Her enjoyment of music culminates in her solo song, Somewhere over the Rainbow, at a school concert. Although nervous because of a prank pulled earlier by Clara Sue and her clique, Dawn draws emotional strength from the pearl necklace Sally Jean gave her earlier in the evening, which she claims are a Longchamp heirloom. Dawn's world comes crashing down after her solo performance at the school concert. Her beloved mother, Sally Jean, passes away that night. With the shock of this barely registered, what comes on the heels of Sally Jean's death truly changes Dawn's life forever. A security guard at the hospital where Sally Jean died recognizes the family, and also notices something peculiar in Dawn's appearance. He goes to the authorities, who perform an early morning raid of the Longchamp residence. Through these officers, it is revealed to Dawn that she is not Ormond and Sally Jean's biological daughter, but that she was kidnapped by them as a newborn baby, and that she is actually the daughter of Randolph and Laura Sue Cutler. Dawn is taken back to Cutler's Cove, Virginia, an offshoot of Virginia Beach. Ormond is arrested for child kidnapping. With no nearby relatives to come to their aid, Jimmy and Fern are placed in foster care. Dawn refuses to believe that Ormond kidnapped her, but the authorities prove her identity through a unique birthmark she shares with the description of the kidnapped baby. Dawn is appalled at the realization that the terrible Clara Sue is her sister; even worse, her boyfriend, Phillip, is actually her brother. These concerns fade into the background after her first meeting with Grandmother Cutler at the family's hotel, also named Cutler's Cove. Grandmother Cutler does not seem overjoyed about the return of her long-lost grandchild. She informs Dawn that she will be known by her \"true\" name, Eugenia, and that she will work in the hotel as a maid in order to prove that she is trustworthy. Dawn is shocked and upset by this cold treatment. She tries appealing to her real parents, Randolph and Laura Sue, but they are just as powerless as her. Randolph, though charming and handsome, has little willpower and prefers life to be as smooth as possible. Laura Sue is enchanted by Dawn's prettiness and resemblance to her, but refuses to make any effort to help her, as she is completely cowed by her mother-in-law. Dawn is also put at risk by Clara Sue's malicious tricks. Infuriated by Dawn's return, she does her best to make sure Dawn is fired by stealing jewellery and other items from the hotel guests. Dawn finds some comfort in the housekeeper, Mrs. Boston, who knew Sally Jean and Ormond Longchamp when they worked at the hotel. She cannot believe that her parents stole her, as they were always honest, hard-working people. Mrs. Boston hints that there is more to the \"kidnapping\" than meets the eye. Dawn's life is further brightened by a secret visit from Jimmy, aided and abetted by Phillip. Jimmy confesses that he has been in love with Dawn since they were children, but never dared show it because he felt he was sick for thinking of her that way. Dawn admits the attraction is mutual, but they find it hard to overcome their upbringing as brother and sister. This happy interlude comes to an end when Clara Sue finds Jimmy in the basement, where Dawn hid him. She tells Grandmother Cutler, who goes to the police and has Jimmy taken back to his foster parents. Dawn is heart-broken that Jimmy has to leave and is furious with Clara Sue. Jealous of her obvious affection for Jimmy, Phillip corners Dawn in her bathroom and rapes her. Desperate to get out, Dawn visits Mrs. Dalton, the woman who took care of her just after she was born, and learns that her \"kidnapping\" was staged by Grandmother Cutler because Randolph was not her biological father, as her mother had extramarital affairs, and didn't want a non-Culter child to receive benefits from the family. The Longchamps were paid with family jewels, including Dawn's pearls, to keep them quiet and to provide for Dawn and Jimmy. Outraged, Dawn confronts Grandmother Cutler about this. The old woman eventually agrees that she was the instigator and makes Dawn a deal: if Dawn will go to a singing school in New York, she will get Ormond out of prison. Dawn agrees but on one condition: that she be referred to by Dawn, not Eugenia. The book ends with Dawn going to New York."
}