{
    "book_id": "10858273",
    "mid": "/m/02qs6v1",
    "title": "Dawn",
    "author": "Kate Cary",
    "publication_date": "2005-12-27",
    "genres": [
        "Speculative fiction",
        "Fantasy",
        "Children's literature"
    ],
    "text": " Brambleclaw, Squirrelpaw, Crowpaw, Stormfur and Tawnypelt have returned to the Clans from a quest with a message: the Clans must move to a new home, or risk death. The destruction of the forest has already begun, with the Clans starving as the food supply has been cut off and their habitat destroyed by the humans building a new road. At the same time, cats are being taken away by humans, including a ThunderClan apprentice, Leafpaw. A patrol is sent to rescue the captured cats, but Graystripe is captured after he succeeds in rescuing Leafpaw and other cats from RiverClan and WindClan, as well as many non-Clan cats. It is difficult for Firestar, ThunderClan's leader, to convince ShadowClan and RiverClan to leave. Finally, RiverClan decides to leave when their river becomes poisoned by humans. ShadowClan also agrees to leave when a tree cut down by humans falls in their camp. While trying help ShadowClan, Firestar loses his fourth life when a tree falls on him. Midnight, an intelligent badger from the pervious book, had told the questing cats that a \"dying warrior\" will show the Clans the way to their new home. The dying warrior turns out to be the spirit of Mudfur, the RiverClan medicine cat who died earlier. As the Clans' spiritual ancestors are represented by the star, Mudfur \"runs\" though the night sky as a shooting star and drops behind the mountains, showing the new territory will be beyond the mountains. The Clans travel together through the mountains, guided by Brambleclaw, Squirrelpaw, Crowpaw, Tawnypelt, and Stormfur. While in the mountains, the Clans meet the Tribe of Rushing Water and Stormfur chooses to stay with the Tribe with Brook Where Small Fish Swim, whom he has fallen in love with, and his sister, Feathertail's, spirit. Near the end of the book, Squirrelpaw confesses her love to Brambleclaw and he confesses that he loves her back. At the end of the book, the Clans discover a forest around a lake that reflects all of the stars."
}