{
    "book_id": "16515705",
    "mid": "/m/03y91x8",
    "title": "Dead Heat",
    "author": "Joel C. Rosenberg",
    "publication_date": "",
    "genres": [
        "Mystery",
        "Fiction",
        "Suspense"
    ],
    "text": " The year is 2016. In Yemen, a U.S. Central Intelligence Agency (CIA) covert military strike against one of the head members of the Italy-based terrorist cell “The Legion” succeeds, and the strike team manages to obtain a laptop which bears blueprints for the Staples Center in Los Angeles, California which is currently hosting the Republican National Convention. President James MacPherson is scheduled to deliver a speech at the convention later that day. The president's advisors inform him of the CIA raid in Yemen and about the information recovered from the laptop and express concern for his security. The United States Secret Service also expresses great concern about the president's security, due to new information from British, Canadian, and Mexican intelligence agencies about several terrorist suspects converging on Los Angeles, even with heavy air and ground security at Los Angeles International Airport and the Staples Center. In spite of these security concerns, the president decides to go ahead with his speech. Meanwhile in Jordan, Jon Bennett rushes his wife Erin, a victim of bacterial meningitis, to the hospital in the United Nations relief camp they are working in. As the doctors examine Erin, they discover that she is pregnant. While Erin remains hospitalized, Bennett receives a phone call warning about an impending attack on the United States. At the NORAD Headquarters in Colorado Springs, the Air Force detects the launch of several short-range missiles off the coast of Washington, New York City, Seattle, and Los Angeles. The Air Force, unable to prevent the missiles from reaching their target, fears that each missile is equipped with a nuclear warhead. Their fears prove true when the District of Columbia is obliterated in two massive nuclear blasts. At the same time, Manhattan is flattened and becomes a nuclear wasteland along with Seattle and Los Angeles. NORAD commander Lt. General Charlie Briggs orders the evacuation of the vice president from his private residence in Jacksonville, Florida. Vice President Bill Oaks is sworn in as President of the United States on board Air Force One. Oaks now becomes the forty-fifth President of the United States. Along with death of President MacPherson, the Republican and Democratic Party leadership, members of the United States Congress and the United States Supreme Court are all dead, and millions of lives have been lost. The attack on Washington also leads to the loss of the majority of U.S. intelligence agencies, such as the CIA, and hinders the president's efforts to find those responsible for the attacks. As one of his first acts as president, Oaks orders United States Navy to deploy its entire fleet to sea, in order to avoid an attack similar to Pearl Harbor. As China begins to move military forces towards Taiwan, the president orders the United States Navy's 7th Fleet in Japan to the East China Sea, in order to prevent a possible Chinese invasion of Taiwan. China believes that the United States might be holding them accountable for the attacks. As the United States prepares to respond militarily, China warns it will strike if it feels threatened. The U.S. Coast Guard locates one of the cargo ships which launched the missiles which struck D.C. They then pass this information on to the United States Navy. The Navy contacts General Briggs who orders an F/A-18 figher squadron from Naval Air Station Oceana to destroy the cargo ship. In short order, the Navy fighters destroy the cargo ship. Soon afterwards, Navy and Air Force fighters locate and sink the remaining cargo ships which destroyed New York, Los Angeles, and Seattle. During a meeting in Babylon, U.N. Secretary General Salvador Lucente meets with Iraqi President Mustafa Al-Hassani. There they discuss Israel’s continued construction of the Third Temple and how to stop it. Both agree they will have to tolerate this nuisance until they amass enough power. With American economic and military power effectively neutralized, no one will stand in their way. With Manhattan in ruins, Al-Hassani invites Lucente to move the UN Headquarters to Babylon. Lucente publicly accepts Al-Hassani's offer. In Jordan, the mysterious caller contacts Bennett again and asks him to come with Erin to Bangkok. Bennett explains that the President has arranged for him to return to the United States. The line goes dead. The caller is revealed to be Indira Rajiv, a former mole and traitor in the CIA. She begins to plot how to transport Bennett and Erin to her location. Bennett, with help from the National Security Agency and the Israeli Mossad, attempts to trace the call. The president orders the deployment of Delta Force teams to Thailand to capture the caller. Rajiv, however, narrowly escapes being captured by Delta Force. Bennett and Erin, still on a stretcher, board an ambulance headed to Queen Alia International Airport in Amman where a U.S. military aircraft is waiting to return them to America. On the way, the driver is shot by an unseen sniper, and the ambulance fishtails and lands on its side. As a cement truck is bearing down on it, Bennett manages to crawl out of it right before it crushes the ambulance, killing Erin and the nurses in the back. A small squad of men rush toward him from the surrounding hills and knock him unconscious. In America, Homeland Security Secretary Lee James is sworn in as Vice President. The remnant of the government begins receiving intelligence that implicates North Korea as the culprit in the nuclear attacks. President Oaks orders the Air Force to conduct reconnaissance flights off the coast of North Korea. During one such flight, An Air Force RC-135 from Kadena Air Base in Okinawa is shot down by North Korean fighter jets over the Sea of Japan. Also, satellite imagery shows a massive concentration of troops on the border with South Korea. President Oaks and his military advisors begin collaborating with South Korean officials on how to respond to the threat of an invasion. Meanwhile, back at Cheyenne Mountain, Bobby Caulfield, an aide to President Oaks learns that most of his family died in the attack on New York and begins to suffer a mental breakdown. This is coupled with the fact that his older brother is in the United States Army and is stationed along the DMZ with the Eighth Army in South Korea. Caufield also notices that he has run out of his hidden cocaine stash and begins to suffer from delirium. He then assaults a military policeman and steals his Beretta pistol. As he is a presidential aide, he is able to get into a conference room where the president is having a meeting without being searched. He then holds Oaks at gunpoint, demanding that he order U.S. Forces in South Korea not to fight against the North. Unsatisfied with how his demands are being received, he assassinates the President before committing suicide. Vice President Lee James now becomes the forty-sixth President of the United States. Because of the amount of responsibility now heaped in his lap and his doubts about his abilities, President James becomes a Christian. United States Secretary of Defense Burt Trainor becomes Vice President. Israeli Prime Minister David Doron is awoken in the middle of the night with intel placing Jon Bennett in North Korea. Because he is a friend and helped rediscover the Ark of the Covenant, Doron feels his rescue is a top priority. He orders an extraction team to locate and rescue him. Bennett wakes up in a cold, dark cell in North Korea. When two interrogators walk in to extract information, Indira Rajiv enters and shoots them for killing Erin because she was a friend. She tells Bennett that she did not want them to be harmed. She hands him a drive with a plethora of files detailing the names, locations, and plans of every member in the Legion before shooting herself. In America, President Lee James prepares for the first press conference since the attacks. He signs the orders detailing America’s retaliatory strike against North Korea that includes nuclear missiles which are immediately launched. After Indira commits suicide, Israeli special operations soldiers launch a raid on the North Korean prison Jon Bennett is being held in. They manage to rescue Bennett and escort him to their UH-60 helicopter. After the helicopter manages to take off, Bennett notices something streaking across the sky. Tragically, Bennett and the Israeli soldiers are vaporized by one of the six thousand U.S. cruise missiles launched against North Korea. At his underground command center in Mount Weather, Virginia, President James begins his speech before a global audience of more than three billion. As he details what has happened in the last several days and how the government is responding, North Korean cities and targets are being destroyed in milliseconds. During the course of the address, he instantly vanishes. Dmitri Galishnikov, founder of Medexco, an Israeli oil company, and his wife sit in their family room astonished at what has just happened. Having heard End Times prophecies from the Bennetts and others, he realizes the Rapture has occurred. He immediately calls all Christians he knows, and none answer. In the epilogue, a week has passed since the disappearance of President James and nearly one billion others worldwide. Leaders of thirty-nine countries are gone, too, and with their disappearance, most of Israel's key allies in the global community. David Doron is eager to sign a peace treaty proposed by Salvador Lucente. During this time, the Galishnikovs convert to Christianity. Dead Heat ends with them sending an e-mail to the employees of Medexco outlining their conversion and their plans for the future."
}