{
    "book_id": "18761463",
    "mid": "/m/04gj50d",
    "title": "Diary of a Wimpy Kid: The Last Straw",
    "author": "Jeff Kinney",
    "publication_date": "2009-01-13",
    "genres": [
        "Young adult literature"
    ],
    "text": " As a continuation of the second book, this novel rounds out the second semester of Greg's seventh grade school year. The book starts with New Year's Day. The follow-up is Greg's Christmas, which is similar to Christmas in the first book. Greg gets nothing he likes from anyone. Uncle Charlie gives Greg a \"laundry hoop\" and Greg's mother, inspired, starts making Greg do his own laundry. Due to Greg's laziness, he does not do his laundry and does not plan to either. This plays a significant role later in the story. Valentines Day is coming up, and Greg goes to the Valentines Dance. The dance was originally supposed to be at night, but they couldn't get enough chaperones, so they put it right in the middle of the school day instead. The music is lame, and their dancing would count for 30 percent of their Phys-Ed grades. He eventually finds Holly Hills, and slowly dances toward her, but Fregley had a sugar rush and ruins a moment between Greg and Holly. One day, his dad finds Manny's old blanket, Tingy, and throws it away. Manny gets revenge when he uses his dad's American Civil War battlefield as a play set. Then Manny walks up to Greg and says \"Ploopy!\" Greg doesn't know what it means, so he asks his mom, but she's talking on the phone. She says, \"What is a ploopy?!\" which was the exact thing Greg wanted to know. Then Manny starts calling Greg \"ploopy\" to get whatever he wants. On Easter Sunday, Greg gets in the car, accidentally sitting on Manny's chocolate Easter bunny. He gets out of the car with chocolate on the back of his pants. His Mom then says that the family cannot skip church. When Rodrick takes off his pants and says \"He can wear MY pants,\" Mom gives Greg her Easter Jacket to tie around his waist. During Easter church service, he looks at Manny, who is playing with the things Mom and Dad brought to entertain him, and then thinks about the day when Manny threw a fit at preschool when his mom cut his sandwich in half, not in quarters the way he likes it. Mom had to drive all the way there to make the extra slice. Then he whispers in Manny's ear, \"Ploopy!\" Manny starts crying and Mom can't calm him down, so they have to go home. Afterwards, Greg is enrolled in soccer and dislikes it. His clothes are running out and it fails to toughen him up. Later, the Heffleys see Lenwood at a ticket booth with a crew cut, proper and incredibly polite. This causes Frank to decide to enroll Greg into military school, Spag Union, which takes place during Greg's summer vacation. Greg tries in vain to change his father's mind by doing Boy Scouts. However, it does not work. Finally, he settles for the sad fact he has to settle for Spag Union. But his summer won't be bad if he took some memories with him. He tries to make a good impression on Holly, but when she calls Greg \"Fregley\" his chances are ruined. Also mentioned earlier in the story, the Heffley's neighbors, the Snellas, are having a half-birthday for their youngest child Seth. During the party, the adults in the neighborhood have to perform silly acts and Mr. Snella sends the videotapes to America's Funniest Families, a spoof of America's Funniest Home Videos, to win the $10,000 grand prize. It is revealed that Frank hates the performing and will do anything to get out of it. On the day of the party, Manny throws Seth's present into a tree because he knows that Greg would snatch it away. It is a blue knit blanket, like Tingy in its early stages. When Greg goes and retrieves it, his pants, borrowed from Rodrick, fall down revealing Wonder Woman underwear, which he wore because it was one of the only clean undergarments he has left. Frank, who happens to be next in line to perform gets away as Mr. Snella points his camera to an embarrassed Greg. He repays Greg the next morning by not sending him to military academy, suggesting there are other ways that Greg can stay fit. While Greg enjoys his morning he goes to see Rowley and tells him he didn't have to go to Spag Union after all. Rowley had no idea Greg might have been sent away. The story ends abruptly as Rowley and Greg are sitting on the curb and meet a girl named Trista. Greg thinks Trista is cute and imagines that she and himself are in Rowley's country club in swimsuits with Rowley serving them drinks."
}