{
    "book_id": "6136468",
    "mid": "/m/0fs1s0",
    "title": "Dragon Keeper",
    "author": "Carole Wilkinson",
    "publication_date": "2003",
    "genres": [
        "Children's literature",
        "Fantasy",
        "Speculative fiction",
        "Fiction"
    ],
    "text": " In the far western mountains of the Han Empire in ancient China, an aging dragon, his wife (who soon dies), and a young slave girl are used, abused and neglected by the cruel Master Lan. Nameless and alone, the slave girl is without hope and her only friend is her pet rat, Hua. After one of the Imperial Dragons, the mate of the aging one, suddenly dies, the slave girl feels guilty and responsible. She finds herself coming to the aid of the last dragon, Danzi. The two escape, but when the emperor finds out that one of his dragons is dead, Master Lan blames it on her and she finds herself chased by the imperial guards, who believe she is an evil sorceress. A necromancer and a dragon hunter, who are determined to kill the dragon and take the dragon's stone, are chasing her and the dragon. The dragon, Long Danzi (meaning courageous dragon), tells the slave girl her true name: Ping (meaning duckweed). Ping discovers her destiny as Dragon Keeper, but she is unaware that the dragon stone is an egg. Now she and the dragon must go on a dangerous journey across China to Ocean, an apparent magical healing place. She must protect a mysterious stone that is vital to the dragon's legacy. While travelling with Danzi, Ping learns many things that will, in time, help her with her struggles. Ping also learns the value of friendship and courage. After, Danzi and Hua must go over Ocean when they're hurt by Diao, the dragon hunter. The stone (now found to be an egg) hatches, and out of it comes...a purple vegetable. Or at least that is what Ping thinks. Eventually Danzi claims it is a baby dragon. It moves, and just before Danzi leaves, he gives the baby a name: Long Kai Duan. Ping is now left alone with the baby dragon. The last of the first."
}