{
    "book_id": "612223",
    "mid": "/m/02wgxw",
    "title": "Edge of Victory: Conquest",
    "author": "Gregory Keyes",
    "publication_date": "",
    "genres": [
        "Science Fiction"
    ],
    "text": " Following the events of Balance Point, the Yuuzhan Vong have agreed to halt their galactic invasion in exchange for all of the Jedi being brought to them, dead or alive. One of the Vong's targets is the Jedi praxeum on Yavin 4. Going against direct orders from his uncle and Jedi Master, Luke Skywalker, and the New Republic itself, Anakin Solo travels to Yavin 4 in order to help his fellow Jedi escape. He makes it just in time to help them escape the Peace Brigade occupation, though his best friend, Tahiri Veila, is captured. He decides to go back and save her, and is enlisted the help of a Shamed Yuuzhan Vong named Vua Rapuung. As Rapuung reveals, a Shamed One in Vong society is an outcast, and he has been Shamed because his biology had rejected the ritual Vong implants. He knows, however, that the shaper, which is the equivalent of a scientist in the Yuuzhan Vong, intentionally Shamed him as punishment for turning her down as a mate. So Rapuung teams up with Anakin so that they can accomplish their respective goals; Anakin will get to save Tahiri while Rapuung will seek vengeance on the shaper who shamed him. Meanwhile, Tahiri is tortured and shaped by Master Shaper Mezhan Kwaad and her assistant Nen Yim in a secret heretical practice meant to brainwash Tahiri into believing that she is a Yuuzhan Vong warrior. This way, she will become the first Jedi-Vong hybrid. Anakin and Rapuung later arrive at the shaper damutek that replaced the Jedi praxeum in the wake of the Yuuzhan Vong's occupation. With the both of them disguised in order to infiltrate the compound, Anakin is able to replace the destroyed crystal of his lightsaber (the lightsaber's crystal was damaged in a previous confrontation with the Yuuzhan Vong) with one of the Vong's own lambents (light-creatures). With this, Anakin is now able to sense the Yuuzhan Vong in a whole new way that exists outside the Force, albeit this new sense only gives Anakin a rather fuzzy look at the Vong. When Mezhan Kwaad and Nen Yim's heretical experiments on Tahiri is discovered, the three of them are taken to a ship to be transported off of Yavin 4. Anakin and Rapuung make their move to accomplish their goals, and Rapuung is able to coerce Kwaad into revealing the heresy she performed by intentionally Shaming him. Not only does Kwaad admit to this, but she even expresses her atheism, something that shocks the onlooking Vong crowd. Kwaad is able to kill her captors, mortally wound Rapuung, and injures Anakin, but a brainwashed Tahiri uses a lightsaber to decapitate Kwaad. Anakin then guides Tahiri back to her senses by reminding her of who she is and expressing his true feelings of love for her. Rapuung, meanwhile, offers to sacrifice his own life against the nearby Vong warriors in order to allow Anakin and Tahiri to escape, as a token of his gratitude of helping him accomplish his goal of exposing Kwaad. Rapuung dies against the attacking warriors while Anakin and Tahiri escape. They, along with the other non-Vong occupants of Yavin 4, are soon rescued from the moon and transported out of the system thanks to the help of Talon Karrde. The novel ends with Nen Yim secretly promising herself to continue Mezhan Kwaad's work in order to help the Yuuzhan Vong."
}