{
    "book_id": "5137338",
    "mid": "/m/0d4gkp",
    "title": "Ender in Exile: Ganges",
    "author": "Orson Scott Card",
    "publication_date": "2008-11-11",
    "genres": [
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " One year after the Formics were defeated and the Battle School children have returned to Earth, Ender is still unable to go back to earth because there would be wars over which country would keep Ender to use for their own ends. Ender is offered the Governorship of the first human colony to be planted on one of the Formics' former worlds, a planet that will eventually become known as Shakespeare. His sister Valentine decides to accompany Ender on his journey because she is sick of being controlled by her older brother, Peter, and because she wants to restore the relationship with Ender that she had lost when he left to go to Battle School. On their way to the Shakespeare colony, Valentine begins writing her History of the Bugger Wars books while Ender has an unspoken power struggle with the Captain of the ship, Admiral Quincy Morgan. Once the ship lands on Shakespeare, Ender, who had spent much of his trip learning the names and lives of the colony's residents, takes charge of the colony and wins the colonists over. Ender resides as Governor for a few years in Shakespeare. Near the end of his time as governor, Ender and a young boy from the colony named Abra go to find a site for a new shipment of colonists. Ender wants the new settlement to be far enough away from the other settlements that there will not be competition between them right away, and so they can develop separately. In the process of finding a location for new settlement, Ender stumbles upon what seems to be the equivalent of a note from the Formics. It is a structure made to look like a game he used to play in Battle School. When Ender goes to investigate the structure, he finds the living pupa of a Formic Hive Queen that is fertilized and prepared to make hundreds of thousands of offspring upon its own maturation. The find leads Ender to write his first book as the Speaker for the Dead. It is a book titled The Hive Queen and it tries to look at the Formic wars and their eventual destruction from the point of view of the Formics. Later, Peter Wiggin, nearing the end of his life and knowing that Ender wrote the story, asks him to write one for him for when he dies. This book becomes known as The Hegemon. After this, Ender resigns as Governor of Shakespeare and leaves the colony for another called Ganges. The leader of Ganges is Virlomi. Here he encounters Randall Firth who believes himself to be the son of Achilles de Flandres, and even refers to himself by the name Achilles. Randall spreads propaganda accusing Ender of Xenocide in an attempt to discredit Virlomi and get revenge against Peter Wiggin, who he believes is responsible for his father's defeat. Randall tries twice to meet with Ender and discredit him somehow. On the second visit his plan is to cleverly provoke Ender into killing him so that people will see how violent and dangerous he is, but Ender does not attack. Instead Ender tries to convince Randall that he is not Achilles' son, but that he is in fact the son of Bean and Petra; hence where he gets his gigantism from. Eventually, Ender manages to convince Randall of his parents' identity by allowing Randall to brutally defeat him in a one-sided fistfight, the entire time asserting that he could never hurt his friends' child. Randall ends up changing his name to Arkanian Delphiki amidst his guilt for Ender's horrifying wounds. After Ender heals a bit, he, Valentine, and the Hive Queen pupa board a star ship to go to a new place."
}