{
    "book_id": "11996030",
    "mid": "/m/02vlbfg",
    "title": "Fablehaven: Grip of the Shadow Plague",
    "author": "Brandon Mull",
    "publication_date": "2008-04-21",
    "genres": [
        "Fantasy"
    ],
    "text": " Strange things are happening at Fablehaven. The book begins where the second book left off, during the same summer of their second year at Fablehaven. Kendra and Seth helped save Fablehaven from the Society of the Evening Star, but new troubles present themselves almost immediately. Seth discovers that someone, or something, has released a plague throughout Fablehaven. As the disease spreads throughout the preserve, it is clear they can no longer protect the preserve. Creatures of light are transformed into creatures of darkness. As light creatures can enter most places throughout the preserve, the same rules apply to the darkened form of them. The exception is the shrine of the Fairy Queen, where only Creatures of Light can enter. Sometime throughout the summer, Kendra is requested by the captain of 'The Knights of Dawn' that she should be recruited. For the first time, Kendra and Warren must visit another magical preserve, called Lost Mesa, located in the central state of Arizona. With Lieutenant Dougan Fisk, and dragon tamer Gavin Rose, another hidden artifact must be recovered from Lost Mesa before The Society unveils it. However, the artifact, as told in the secret fairy language Silvian, had a new residence at Fablehaven. Meanwhile, back at Fablehaven, Seth discovers that he has gained new abilities with destroying Fablehaven's revenant and pulling out the nail. With the help of Graulas the dying demon, he is made a shadow-charmer, a person who is able to shadow-walk, hear the voices of prisoners from the dungeon that dwell underneath the main house, and speak the language of many creatures such as giants, goblins, trolls, and demons. Graulas explains how three dark creatures created the plague with the nail. The prisoner from the Quiet Box was never seen to leave the preserve, so this helps prove Vanessa's accusation correct. New friends are introduced and trusted as new magical creatures of light and darkness are confronted. Coulter and Tanu get changed by the plague first, followed by Grandpa and Grandma Sorenson. Then Dale, and finally Warren. Humans are changed to 3D shadows. Will the plague go so far that Kendra and Seth will be contaminated? Seth recovers the Chronometer and brings Patton Burgess forward in time. Patton made artifacts more difficult to recover and also was a famous caretaker of Fablehaven. The Fairy Queen destroys her shrine to make a pebble filled with light energy to help save the plague. Someone must touch the pebble to the nail and the plague will be reversed. One problem though — whoever touches the pebble to the nail dies. When pebble and nail are united by Lena, Lena dies. The plague stops."
}