{
    "book_id": "14207472",
    "mid": "/m/03cxtwl",
    "title": "Fantastic Locations: Dragondown Grotto",
    "author": "Ed Stark",
    "publication_date": "2007",
    "genres": [
        "Role-playing game"
    ],
    "text": " In the first chapter, Spawnscale Nursery, the characters are told of (or discover) an underground complex used to rear abandoned dragon eggs. The self-styled dragonlord Meepo, a kobold fighter has taken charge of the hatchlings, raising them as siblings and has reputedly been selling them as mounts or guardians to various patrons. His dealings have been disrupted by the invasion of a group of hobgoblins and their mercenary blackscale lizardfolk allies who have retaken the complex in order to restore it to its original purpose as a temple to the evil dragon-god Tiamat. After overcoming the occupation force of monsters, the players may either fight Meepo and two of his young dragon charges, or they may elect to negotiate with him--leading them to discover the dark nature of Targan Klem (who they may or may not be working for) who intends to sacrifice the unborn dragons within the eggs as a sacrifice to appease the resurrected dracolich he intends to raise. They are informed that two magical eggs may be retrieved to aid in the defeat of the wizard, which when hatched will birth Aspects of the Five-headed evil Tiamat and the benevolent platinum dragon god Bahamut. Though the two dragon-gods hate one another, they will both fight against a threat to dragonkind as that posed by Klem. They are given a map to find the two eggs. The second chapter, Forest Cliff Lair, begins as the characters follow a nearby stream for a day's travel to make their way to the location of the first egg, the Egg of Bahamut, held in the lair of the female green dragon Sekkatrix. She has enslaved ogres and basilisks to defend her lair. They must obtain the egg and move on to the second objective, the Egg of Tiamat. In chapter three, Dragon Graveyard, the hunt for the Egg of Tiamat takes them to the edge of the forest, where the land flattens into an ashen waste. It is reputed that here a great lord of the dragons once ruled over the entire region. Other dragons have migrated to this place, either to die alongside the revered wyrm or to plunder the graveyard. The egg is located at the center of the waste, on a dais built within the upward jutting ribs of the old dragon king. It is protected by the bound spectres of those who have before tried to rob the treasure. As well, the area is patrolled by cadaver collectors and dragon skeletons. Having taken both eggs, the characters proceed to the last chapter, Dragondown Grotto, a grotto formed from a cave collapse where a cabal of wizards hunted down the dracolich centuries ago after having destroyed its phylactery. Targan Klem and his black dragon cohort Blackbone are in the midst of raising the dracolich, a former blue dragon named Tsaggest Darkweld, when the characters arrive. Blackbone, as well as a group of dragonnes try to keep the adventurers at bay until the spell is finished and the Dracolich is awakened. Klem attempts to continue the ritual until it is absolutely impossible to avoid combat."
}