{
    "book_id": "1712791",
    "mid": "/m/05qf8l",
    "title": "Feed",
    "author": "Matthew Tobin Anderson",
    "publication_date": "2002",
    "genres": [
        "Science Fiction",
        "Fiction",
        "Dystopia"
    ],
    "text": " While spending Spring Break on the moon, Titus and his thrill-seeking friends meet Violet Durn, who is unlike any of them. While at a club, a man from an anti-feed organization hacks their feeds. When they wake up in a hospital, their feeds are unavailable: partially deactivated while under repair. Mostly, this is the teenagers' first experience of life without the influence of the feed. During their recovery, Violet and Titus begin a romantic relationship. Eventually, their feeds are repaired and they return to Earth. However, Violet's feed is not totally fixed. One day, Violet reveals her plan of resisting the feed to Titus. She plans to show interest in a wide and random assortment of products to prevent the corporations that control her feed from developing a reliable consumer profile. The two go to the mall and create wild consumer profiles. Later, Violet realizes that someone, most likely the Coalition of Pity, has been accessing her personal information through her dreams. She calls FeedTech customer service, but receives no help. Later, Violet tells Titus that her feed is severely malfunctioning, and she may die. Due to her deteriorating feed, various parts of Violet's body are shutting down. Throughout the novel, there is also a presence of lesions appearing on the characters' bodies. At first it is something they hide, but eventually the lesions turn into a trend. At School™, Titus notices that Calista has a large artificial lesion cut onto her neck. At a party, Quendy shows up with small artificial lesions over most of her body. Violet is disgusted and determines that everyone has become the feed. After this, she collapses and is taken to the hospital. As a side effect of the malfunction, Violet loses memories of the year before she got the feed installed. To avoid losing more memories, she makes large records of things she can remember. She sends them to Titus, but he deletes them. Violet's body parts continue shutting down. She and her father cannot afford repairs, so they petition FeedTech for assistance. While Titus is in mal with his friends, Violet calls and becomes angry with him. He is unaware of the environmental disaster that happened that morning in Mexico. Some sort of toxic waste has engulfed a number of villages. The Global Alliance is prepared to go to war with the United States. Titus drives to Violet's house. He falls asleep shortly after arriving due to the after effects of the mal. While he sleeps, Violet shares her bad news with Titus in the form of a dream: FeedTech has decided not to help Violet because of her strange customer profile. This is caused by her resistance of the feed. That weekend, Violet comes to Titus' house to ask him to go to the mountains. He is reluctant at first, but ultimately agrees. They begin fighting and break up. On the way home, Violet's arm stops working and when she arrives home her leg fails. Titus drives away. The next day, Violet apologizes to Titus via feed, but Titus does not answer. Titus receives a message from Violet's father saying that Violet wanted Titus to know when it was \"all over.\" He informs him that the time has come. Titus goes to Violet's house, where she lies in a coma. Her father blames Titus and shows him memories of parts of her body and brain shutting down, the pain she experienced. He then tells Titus to be with the eloi. Titus asks what that means, but Mr. Durn refuses to answer, telling him to look it up. They fight, and Titus goes home. In an act of grief, he sits on his floor naked and orders the same pair of jeans continuously until he is entirely out of credit. Two days later, Titus goes to visit Violet again. He tells her any stories he can find in the information available through his feed. Finally, he tells her the story of their relationship in the form of a movie trailer. The book ends with Violet dying and the feed saying \"Everything Must Go.\""
}