{
    "book_id": "7696829",
    "mid": "/m/02696cv",
    "title": "Firebird",
    "author": "",
    "publication_date": "",
    "genres": [
        "Science Fiction"
    ],
    "text": " Firebird is the third daughter of the Queen of Naetai and a military pilot. Because she is a wastling, an unwanted heir to the throne, she is considered expendable. Leading her tagwing fighter group of wastlings on a suicide mission as part of a venture to capture a Federate world outpost, she is captured by Federate colonel Brennen Caldwell, a telepathic intelligence officer seeking to capture an enemy fighter for interrogation. She attempts honorable suicide by poison for her failure, but Caldwell thwarts her medically. Under telepathic duress, her military and political knowledge is used by Caldwell to save the Federate outpost. Firebird begins to see the dishonorable tactics of her mother's government for what they are. Caldwell, in addition to being the most powerful Ehretan telepath of his generation, is the most senior telepath in a government that mistrusts them for their abilities. In addition to the government's mistrust of his people, Caldwell is questioned by his own people for his deep connection with Firebird. In her, he sensed a strong possibility of connaturality, a deep personality congruity that is essential for telepaths to have a successful relationship in marriage. Among his people there is a strong belief that, as the strongest telepath among them he should not marry outside his people, diluting the genes that allow their telepathy. Caldwell rejects his people's attitudes towards non Ehretans and continues his growing friendship with his prisoner, offering life and a future to one who believed herself as good as dead. Following Netaia's failure on Veroh, the queen is forced to honerable suicide and Firebird's sister Carradee ascends the throne. Caldwell is assigned to Naetai as the Federate representative and brings Firebird with him. While Carradee favors a conciliatory posture with the Federacy, their other sister, Phoena, secretly plots the overthrow of Federate occupation along with members of the nobility, by secretly building an ecological weapon of great power. After several political and military dangers are overcome by Caldwell and Firebird, they ignore his orders and carry out a special ops mission to destroy Phoena's research lab. Once all is settled, Firebird and Caldwell accept their relationship (over the continued objection) of his people and become engaged. Firebird is a military pilot assigned to a risky venture to capture a Federate world outpost. Because she is a wastling, she is considered expendable. Leading her tagwing fighter group, she is captured by Federate colonel Brennen Caldwell, a telepath who senses something special about her. She attempts honorable suicide by poison for her failure, but Caldwell thwarts her medically. Under duress, her military knowledge is used by Caldwell to save the Federate outpost. Firebird begins to see the dishonorable tactics of her people for what they are. Caldwell, in addition to being the most powerful Ehretan telepath of his generation, is also heir to religious prophecies among his people, and the most senior telepath in a government that mistrusts them for their abilities. Caldwell is promoted to general for his victory in the Veroh battle, as well as his diplomacy with the captured Firebird. In her, he sensed a strong possibility of connaturality, a deep personality congruity that is essential for telepaths to be married. As he has strong convictions against marrying outside his faith, and being barred from proselytizing, much of the book revolves around Caldwell trying to bridge the gap to Firebird by demonstrating the goodness of his spirit to her, offering life and hope to one who believed herself as good as dead. Following Netaia's failure on Veroh, Firebird's sister Carradee ascends the throne after their mother is forced to honorable suicide. She favors a conciliatory posture with the Federacy. Their other sister, Phoena, secretly plots the overthrow of Federate occupation along with members of the nobility, by secretly building an ecological weapon of great power. After several political and military dangers are overcome by Caldwell and Firebird, they ignore his orders and carry out a special ops mission to destroy Phoena's research lab. During the climactic battle, when Caldwell has been incapacitated and his telepathic powers are not available, Firebird casts her faith to the Great Speaker who sung the universe into existence, and strengthened by this, overcomes great odds to successfully neutralize the weapon. The religious differences thus settled, the story ends with Caldwell proposing pair bonding (marriage) to Firebird."
}