{
    "book_id": "7184908",
    "mid": "/m/025vgwy",
    "title": "For a New Liberty: The Libertarian Manifesto",
    "author": "Murray Rothbard",
    "publication_date": "",
    "genres": [
        "Political philosophy"
    ],
    "text": " Chapter 1, \"The Libertarian Heritage: The American Revolution and Classical Liberalism\", mentions the then-recent successes in U.S. Libertarian electoral politics. Richard Randolph had been elected to the Alaska House of Representatives and the \"Congressional Quarterly\" listed the LP as the third-largest political party. It describes America as having been, above all countries, born in an explicitly libertarian revolution. It argues that libertarianism was crippled by utilitarianism, which was not radical or revolutionary enough because its desire for expediency was in contrast to radical abolitionism, which sought to eliminate wrong and injustice as rapidly as possible. The original chapter i, on \"The New Libertarian Movement,\" being deemed irrelevant and outdated, was transformed into an appendix providing an annotated outline of the complex structure of the current movement. Chapter 2, \"Property and Exchange\", introduces the nonaggression axiom, property rights, free exchange and free contract, and the inextricable connections between property rights and other human rights. It argues that the whether or not immoral practices are supported by the majority of the population is not germane to their nature. It states that one of the libertarian's prime educational tasks is to spread the demystification and desanctification of the state. Chapter 3, \"The State\", defines the state as an aggressor and decries its efforts to cloak its criminal activity in high-sounding rhetoric. It dismisses constitutional restrictions as ineffective. It describes taxation as theft and government as a band of robbers. Chapter 4, \"The Problems\", identifies government as the red thread marking and uniting the major problems of the day. It cites the Vietnam War, the Watergate scandal, stagflation, and others 1970s-era issues in addition to such perennial bugaboos as high taxes and traffic congestion. It faults government for poorly managing that which is in the public domain. Chapter 5, \"Involuntary Servitude\", cites conscription, anti-strike laws, the tax system, the court system, and compulsory commitment as vectors of involuntary servitude. It notes that the court system forces people to give testimony and to serve on juries. It also decries the concept of contempt of court, which allows a judge to act as prosecutor, judge, and jury in accusing, convicting and sentencing the culprit. Chapter 6, \"Personal Liberty\", deals with freedom of speech, freedom of radio and television, pornography, sex laws, wiretapping, gambling, narcotics and other drugs, police corruption, and gun laws. Abortion is dealt with from an evictionist perspective, stating that no human has the right to exist, unbidden, as a parasite within another human being's body. Thus, the female has a right to cause the fetus to be ejected from her body if she wishes; which includes changing her mind if she had earlier decided she wanted to have a child. Chapter 7, \"Education\", voices opposition to government involvement in education. He notes that the very nature of the public school requires the imposition of uniformity and the stamping out of diversity. Social conflict is unnecessarily generated by the school system having to choose between traditional or progressive, segregated or integrated, rather than letting each school and each customer choose individually what is best for them. Chapter 8, \"Welfare and the Welfare State\", argues that welfare should be completely privately provided. It cites welfare checks as promoting present-mindedness, unwillingness to work, and irresponsibility. Thus, ultimately welfare actually hurts the poor. Chapter 9, \"Inflation and the Business Cycle: The Collapse of the Keynesian Paradigm\", argues that government has found ways of inflating money that are more subtle than simply printing more bills. The Federal Reserve determines the total amount of reserves. It lends money out at an artificially cheap rate (the rediscount rate) and conducts open market purchases. Chapter 10, \"The Public Sector, I: Government in Business\", notes that people tend to fall into habits and unquestioned ruts, especially in the field of government. Thus, they blindly assume that government must provide certain services or else they would not be provided. It argues that the question of how the poor will pay for defense, fire protection, and so on, is answered by the counter-question, how do the poor pay for \"anything\" they now obtain on the market? Chapter 11, \"The Public Sector, II: Streets and Roads\", notes that streets will be safer when they are privately owned, and the owners have the ability and incentive to get rid of crime. It states that people would ensure their own ability to enter and exit their land by obtaining easements giving them the right to access rights-of-way through neighboring property. It cites the railroad police as an example of a successful private police force. Chapter 12, \"The Public Sector, III: Police, Law, and the Courts\", states that police protection is not a single, absolute entity but a product that can exist in degrees. For instance, the police can provide personal bodyguards, detectives, uniformed officers, patrols, cars, etc. The chapter argues that allocation of these funds will be made in response to market signals if the police services are privatized, promoting better use of resources. Chapter 13, \"Conservation, Ecology, and Growth\", states that property rights are the solution to pollution. It argues that the emanation of noise, polluted air, and so on, onto others' property should be considered an aggressive act for which one may be held civilly liable. It holds that the current pollution problem is caused by government deciding that some pollution is needed for the common good. Chapter 14, \"War and Foreign Policy\", notes two basic problems with war. First, innocent civilians are killed who had nothing to do with the offense caused by their government. Second, war is financed by coercive taxes. Thus, libertarians oppose war. It also notes that collective security has the potential to draw otherwise uninterested parties into what could have limited to a local skirmish. It calls for the U.S. to dismantle its bases, withdraw its troops, stop its political meddling, and abolish the Central Intelligence Agency. Chapter 15, \"A Strategy for Liberty\", discusses the possible avenues for reform. It argues that libertarians should advocate radical change and hold to the ultimate ideal of abolition of all invasions of liberty. It also notes that the state will not be converted out of power; means will need to be found to remove the State from power. Libertarians will need to find ways of applying pressure. This could include massive failure to cooperate with the state."
}