{
    "book_id": "309409",
    "mid": "/m/01szvx",
    "title": "Foundation",
    "author": "Isaac Asimov",
    "publication_date": "1951",
    "genres": [
        "Science Fiction",
        "Speculative fiction",
        "Children's literature",
        "Fiction",
        "Novel"
    ],
    "text": " Foundation tells the story of a group of scientists who seek to preserve knowledge as the civilizations around them begin to regress. (0 F.E.) (First published as the book edition in 1951) Set in the year 0 F.E., The Psychohistorians opens on Trantor, the capital of the 12,000-year-old Galactic Empire. Though the empire appears stable and powerful, it is slowly decaying in ways that parallel the decline of the Western Roman Empire. Hari Seldon, a mathematician and psychologist, has developed psychohistory, a new field of science and psychology that equates all possibilities in large societies to mathematics, allowing for the prediction of future events. Using psychohistory, Seldon has discovered the declining nature of the Empire, angering the aristocratic members of the Committee of Public Safety, the de facto rulers of the Empire. The Committee considers Seldon's views and statements treasonous, and he is arrested along with young mathematician Gaal Dornick, who has arrived on Trantor to meet Seldon. Seldon is tried by the Committee and defends his beliefs, explaining his theories and predictions, including his belief that the Empire will collapse in 500 years and enter a 30,000-year dark age, to the Committee's members. He informs the Committee that an alternative to this future is attainable, and explains to them that creating a compendium of all human knowledge, the Encyclopedia Galactica, would not avert the inevitable fall of the Empire but would reduce the dark age to one millennium. The skeptical Committee, not wanting to make Seldon a martyr, offers him exile to a remote world, Terminus, with others who could help him create the Encyclopedia. He accepts their offer, prepares for the departure of the \"Encyclopedists\" and receives an imperial decree officially acknowledging his actions. (50 F.E.) (published May 1942 as \"Foundation\") Set in 50 F.E., The Encyclopedists begins on Terminus, which has no mineral resources but one region suitable for the development of large city, named Terminus City. The colony of professionals, devoted to the creation of the Encyclopedia, is managed by the Board of Trustees of the Encyclopedia Galactica Foundation, composed solely of scientists. The affairs of Terminus City itself are handled by the city's mayor, Salvor Hardin, who is virtually powerless due to the influence of the Board of Trustees. However, Hardin does not accept the status quo, which he believes puts Terminus in danger of political exploitation by the neighboring prefects of the Empire, which have declared independence and severed contact with Trantor. Hardin, recognizing the imminent downfall of imperial power due to the loss of the Empire's outermost region, decides that the only way to ensure Terminus's continued survival is to pit the four neighboring \"kingdoms\" against one another. Hardin manages to avoid an attempt by the Kingdom of Anacreon to establish military bases on Terminus and to take advantage of nuclear power, which Terminus retains but which the Four Kingdoms do not. Hardin succeeds in diverting Anacreon from its initial goal and furthers his goal of the establishment of a stable political system on Terminus. Hardin's efforts, however, are still resisted by the Board of Trustees and its chairman, Dr. Louis Pirenne. To remove this obstacle, Hardin and his chief advisor, Yohan Lee, plan a coup d'etat designed to remove the Board of Trustees from its politically-powerful position on the same day that, in the city's Time Vault, a holographic recording of Hari Seldon is programmed to play. The recording will contain psychohistoric proof of Hardin's success or failure; Hardin realizes that his coup is a great gamble due to the possible case that his beliefs are incompatible with Seldon's original goals. At the playing of the Seldon recording, it is revealed that the Encyclopedia Galactica is a distraction intended to make the colony's creation possible. The true goal of the Foundation is to further science in a galaxy consumed by interplanetary strife, the Board realizes, and hands its political power to the Terminus City mayoralty. Meanwhile, Lee engineers the nonviolent takeover of Foundation institutions by the city government. (80 F.E.) (published June 1942 as \"Bridle and Saddle\") Set in 80 F.E., three decades after the events of The Encyclopedists, The Mayors is set in a time where the Encyclopedia Foundation's scientific understanding has given it significant leverage over the Four Kingdoms, though it is still isolated from the Galactic Empire. Exercising its control over the region through an artificial religion, Scientism, the Foundation shares its technology with the Four Kingdoms while referring to it as religious truth. Maintenance technicians comprise Scientism's priesthood, trained on Terminus. A majority of the priests themselves are unaware of the true importance of their \"religion\", referring to advanced technology as \"holy food\". The religion is not suppressed by the secular elite of the Four Kingdoms, reminscient of Western European rulers of the early medieval period, who use it to consolidate their power over the zealous populaces. Salvor Hardin, as Mayor of Terminus City, is the effective ruler of the Foundation, and has been reelected as mayor continuously since his political victory over the Encyclopedia Galactica Board of Trustees. However, his influence is suddenly checked by a new political movement led by city councillor Sef Sermak, which encourages direct action against the Four Kingdoms and a cessation of the scientific proselytizing encouraged by Hardin's administration. The movement, whose followers refer to themselves as Actionists, is wildly popular, and Hardin is unable to appease Sermak and the Actionist leadership. The kingdom that is most concerning to the Actionists is that of Anacreon, ruled by Prince Regent Wienis and his nephew, the teenaged King Lepold I. Wienis plans to overthrow the Foundation's power by launching a direct military assault against Terminus, making use of an abandoned Imperial space cruiser redesigned by Foundation experts to fit the needs of the elite Anacreonian navy. However, Hardin orders several secret technological devices to be incorporated into the ship's design prior to its completion. Wienis plans to launch his offensive on the night of his nephew's coronation as king and sole ruler of Anacreon. Hardin attends the coronation ceremony and is arrested, but has arranged with Anacreonian High Priest Poly Verisof, who is aware of the true nature of Scientism, to foster a popular uprising against Wienis. Convincing the Anacreonian populace that an assault against the Foundation and Terminus is blasphemous, Verisof leads an infuriated mob to the royal palace and surrounds it, demanding Hardin's release. Meanwhile, the crew of the space cruiser mutinies against its commander, Admiral Prince Lefkin, Wienis's son. Lefkin confronts the mutineers and, captured, is forced to broadcast a message to Anacreon demanding Wienis's arrest and threatening a bombardment of the royal palace if that and other demands are not met. Wienis, maddened by his failure, orders Hardin's execution, but his royal guardsmen refuse to obey him. Attempting and failing, due to a protective energy field, to kill Hardin personally, Wienis commits suicide. Hardin is proven correct again upon his return to Terminus City by another Seldon recording, set to play at this date. Though Actionists continue to hold a significant amount of power, an attempt to impeach the mayor fails and his popularity is renewed among the city's residents. It is also confirmed by Hari Seldon that the Foundation's immediate neighbors, the Four Kingdoms, will now be virtually powerless and incapable of resisting Scientism's advance. (About 135 F.E.) (published October 1944 as \"The Wedge\") The events of The Traders are set around 135 F.E., at a time during which the Foundation has expanded greatly and has sent out officially-sanctioned Traders to exchange technology with neighboring planets for what amounts to greater political and economic power. Master Trader Eskel Gorov, also an agent of the Foundation government, has traveled to the worlds of Askone, where he hopes to trade nucleics. Gorov, however, is met with resistance by Askone's governing Elders due to traditional taboos that effectively ban advanced technology. Gorov is imprisoned and sentenced to death; the Elders refuse Foundation requests for clemency. Trader Linmar Ponyets is ordered by the Foundation to try and negotiate with the Elders, and travels to the central Askonian planet. Ponyets meets with the Elders' Grand Master and deduces that, though he is determined to have Gorov executed, he may be willing to exchange the captive for a suitable bribe, which Ponyets realizes would be a sum of gold. Ponyets clumsily fashions a transmuter that will convert iron into gold. The Grand Master informs Ponyets that others who have attempted this have failed and have been punished with execution for both their attempt and for their failure; Ponyets succeeds and convinces the Grand Master that the gold is appropriate for Askonian religious decoration, which pleases the Elders. Councilor Pherl, the Grand Master's protégé, appears to be wary of Ponyets. Meeting with the Councilor, Ponyets discovers that Pherl is instead quite willing to work with him, if only due to the chances of eventually attaining the Grand Mastership himself. Pherl, from a different ethnic background than traditional Grand Masters and a young man, believes that a stable supply of gold will be able to dramatically increase his power, and Ponyets provides him with the transmuter. It appears that the friendly Pherl will ascend to the Grand Mastership, while Gorov is released quickly. Ponyets discusses his success with Gorov, who criticizes his techniques due to what he perceives as Ponyets's lack of morality. Ponyets replies by reminding Gorov of an alleged statement made by Salvor Hardin: \"Never let your sense of morals prevent you from doing what is right!\" (About 155 F.E.) (published August 1944 as \"The Big and the Little\") Set around 155 F.E., The Merchant Princes takes places against the backdrop of a powerful Foundation, which has subjugated the neighboring Four Kingdoms and expanded its commercial and technological empire throughout numerous stellar systems. However, it continues to meet resistance, and three Foundation vessels have vanished near the planets of the Republic of Korell, a nation suspected of independent technological development. Master Trader Hober Mallow is assigned to deal with Korell and also to investigate their technological developments and find the missing ships. Those who have assigned this mission to Mallow, Foreign Secretary Publius Manlio and the Mayor's secretary, Jorane Sutt, believe that a \"Seldon Crisis\" is underway; they fear that domestic tensions caused by the great autonomy given to Traders and shaky foreign relations may give rise to a nuclear conflict involving the Foundation. Sutt and Manlio, believing that they can weaken the Traders by staging an embarrassing diplomatic incident, plant an agent aboard Mallow's ship. The agent, a respected Trader, invites a Foundation missionary onto the ship once it reaches Korell. Such missionaries are forbidden to enter Korell, and an angry mob immediately surrounds the ship, demanding the missionary. This rapid response in a remote location arouses Mallow's suspicions, and Mallow gives the missionary to the mob, despite the frantic intervention of the agent. Later, Mallow meets with Korell's authoritarian ruler, Commdor Asper Argo, who appears friendly and welcomes Foundation technological gifts. Argo refuses to allow Scientism on Korell, and Mallow agrees not to encourage missionary work in the Republic. Mallow is invited to tour a steel foundry belonging to Korell's government, where he notes guards carrying atomic handguns. He is surprised to discover that these weapons bear the markings of the Galactic Empire, which the Foundation assumes has fallen by this time. Mallow's discoveries lead him to believe that the Empire may be attempting to expand into the Periphery again, and has been providing weapons to client states such as Korell. Leaving the Republic and his ship, he journeys alone to the planet Siwenna, which he believes may be the capital of an Imperial province. He finds Siwenna a desolate and sad place, and meets the impoverished patrician Onum Barr in the latter's isolated mansion, which is slowly crumbling. Barr, a former provincial senator and a leading citizen, had served in the Imperial government on Siwenna during a fairly stable time several decades earlier, before a series of corrupt and ambitious viceroys who each harbored dreams of becoming Emperor. After the previous viceroy rebelled against the Emperor, Barr participated in a revolution that overthrew the viceroy. However, the Imperial fleet also sent to remove the viceroy wanted to conquer a rebellious province even if it was no longer in rebellion, and began a massacre that claimed the lives of all but one of Barr's children. Mallow is tried for murder upon his return to Terminus, due to turning over the Foundation missionary to the mob. However, he is able to convince the court that the \"missionary\" was in fact a Korellian secret policeman who played a part in the conspiracy against the Traders manufactured by Sutt and Manlio. Acquitted, Mallow is received with delight by the population of Terminus, which will almost undoubtedly select him as Mayor in the elections scheduled to take place in the following year. To prepare for the election, Mallow engineers the arrest of Sutt and Manlio, and eventually takes office. However, he is soon faced with tensions between the Foundation and Korell, which declares war on the Foundation, using its powerful Imperial flotilla to attack Foundation ships. Instead of counterattacking, Mallow takes no action, waiting until the lack of Foundation goods forces Korell to surrender."
}