{
    "book_id": "553671",
    "mid": "/m/02p9z1",
    "title": "Free Culture: How Big Media Uses Technology and the Law to Lock Down Culture and Control Creativity",
    "author": "Lawrence Lessig",
    "publication_date": "2004",
    "genres": [
        "Non-fiction"
    ],
    "text": " This book is an outgrowth of the U.S. Supreme Court decision in Eldred v. Ashcroft, which Lessig lost. Article I, Section 8, Clause 8 of the U.S. Constitution says, \"The Congress shall have Power ... To promote the Progress of Science and useful Arts, by securing for limited Times to Authors and Inventors the exclusive Right to their respective Writings and Discoveries.\" Several times in the past century, congress has extended the copyright law in several ways. One way was to extend the term \"on the installment plan\". Another was to broaden the scope to include not only copying but creating \"derivative works\". This latter broadening is so ambiguous that it provides a foundation for massive abuse of power by companies holding large copyright portfolios. For example, the Recording Industry Association of America sued a freshman at Rensselaer Polytechnic Institute (RPI) for $10,000,000 for improving a search engine used only inside RPI. Lessig cites another example where Fox demanded $10,000 for the rights to use a 4.5 second video clip with The Simpsons playing on a television in a corner of a scene in a documentary. Anyone producing a collage of video clips can potentially be similarly sued on the grounds the collage is a \"derivative work\" of something copyrighted or that the collage contains a shot that is copyrighted. Lessig argues that this substantially limits the growth of creative arts and culture, in violation of the US Constitution; the Supreme Court ruled that Congress has the constitutional authority to properly balance competing interests on cases like this. In the preface of Free Culture, Lessig compares this book with a previous book of his, Code and Other Laws of Cyberspace, which propounded that software has the effect of law. Free Culture's message is different, Lessig writes, because it is \"about the consequence of the Internet to a part of our tradition that is much more fundamental, and, as hard as this is for a geek-wanna-be to admit, much more important.\" (pg. xiv) Professor Lessig analyzes the tension that exists between the concepts of piracy and property in the intellectual property realm in the context of what he calls the present \"depressingly compromised process of making law\" that has been captured in most nations by multinational corporations that are interested in the accumulation of capital and not the free exchange of ideas. The book also chronicles his prosecution of Eldred and his attempt to develop the Eldred Act, also known as the Public Domain Enhancement Act or the Copyright Deregulation Act. Lessig concludes his book by suggesting that as society evolves into an information society there is a choice to be made to decide if that society is to be free or feudal in nature. In his afterword he suggests that free software pioneer Richard Stallman and the Free Software Foundation model of making content available is not against the capitalist approach that has allowed such corporate models as Westlaw and LexisNexis to have subscribers to pay for materials that are essentially in the public domain but with underlying licenses like those created by his organization Creative Commons. He also argues for the creation of shorter renewable periods of copyright and a limitation on derivative rights, such as limiting a publisher's ability to stop the publication of copies of an author's book on the internet for non-commercial purposes or create a compulsory licensing scheme to ensure that creators obtain direct royalties for their works based upon their usage statistics and some kind of taxation scheme such as suggested by professor William Fisher of Harvard Law School http://cyber.law.harvard.edu/people/tfisher/PTKChapter6.pdf that is similar to a longstanding proposal of Richard Stallman."
}