{
    "book_id": "18547030",
    "mid": "/m/04g1q3x",
    "title": "Gears of War: Aspho Fields",
    "author": "Karen Traviss",
    "publication_date": "2008-10-28",
    "genres": [
        "Science Fiction"
    ],
    "text": " Gears of War: Ashpo Fields follows two storylines, constantly jumping between different time periods both before and after the events of Gears of War. One begins one week after the events of the first game, and the other flashes back to decades earlier, chronicling Marcus Fenix's childhood up to his involvement in Operation Leveler three years before E-Day. Flashing back to 26 years before the events of the first game, a 10-year-old Marcus Fenix arrives at Olafson Intermediate School. His quiet demeanor and rich background attract the attention of school bullies, but Carlos Santiago is quick to rise to his defense. Marcus quickly becomes fast friends with Carlos and his brother Dom, and spends most of his time with the Santiago family, becoming an 'honorary Santiago.' The Santiago family is in sharp contrast to Marcus's own, with the Fenix parents putting their work before their family as compared to the closeness of the Santiagos. During this time, Marcus's mother disappears, further dividing Marcus and his father. Four years before Emergence Day, Marcus decides to enlist in the COG army, following Carlos's path despite Adam Fenix's intentions for Marcus to join the COG as an officer after finishing his education. Dom, at 16, is expecting a child with girlfriend and future wife Maria. He also enlists, becoming a special forces commando. A year later, the COG begin planning Operation Leveler, a covert assault on an enemy research facility developing the Hammer of Dawn at Aspho Fields. Dom's squad is selected to infiltrate the base, while the COG army surround and protect the base from any attempt at attack. Although the battle is a pivotal event of the Pendulum Wars the war is also notable as important Gears perish during this time, such as Anya Stroud's mother, Major Helena Stroud, as well as Dom's brother, Carlos. Planning continues for the invasion of Aspho Point, with both then-Major Hoffman and Adam Fenix taking part in the plans for the operation. It is revealed that the area near the research facility has been reinforced albeit in the wrong position, but the COG continue with the covert operation. The commando squad led by Hoffman that includes Dom infiltrates the base and begins capturing personnel and data. At the same time, the COG land ashore north of Aspho Fields and establish themselves along Aspho Point to divert the Pellegrian forces from the COG forces' objectives. The covert mission's secrecy is compromised when a lone security guard in the research facility manages to evade capture and alert the nearby reinforcements. While the commandos struggle to complete their task, the main army comes under attack. During the present course of the novel, the story picks up one week after the Lightmass Bombing from the finale of the first game. During this time, Marcus and the rest of Delta Squad unexpectedly find Bernadette Mataki, a Gear that had been Marcus' superior during Operation Leveler. Her reappearance causes Dom to question Carlos' death again, asking Bernie for her version of the events resulting in the death of his brother, as Marcus has given him little information. However, she is equally reluctant. At the same time, a Locust attack is discovered to be aiming for the city of Jacinto's food supply at North Gate. A contingency plan is organized for the COG to transport the necessary equipment from North Gate to a secure location."
}