{
    "book_id": "7685271",
    "mid": "/m/0268vhw",
    "title": "Ghost Story",
    "author": "Peter Straub",
    "publication_date": "",
    "genres": [
        "Speculative fiction",
        "Horror",
        "Fiction"
    ],
    "text": " The novel opens with a man named Donald Wanderley traveling with a young girl whom he has apparently kidnapped. Eventually Donald and the girl arrive in Panama City, Florida, at which point the novel jumps back in time to the events of the previous winter. Living in the small New York town of Milburn are four elderly men who are members of a group called the Chowder Society. John Jaffrey, a doctor; Lewis Benedikt, a retired entrepreneur; Sears James, an attorney; and Ricky Hawthorne, an attorney and James' partner. For the past fifty years these best friends have gathered together and told each other stories and have been great companions. Once upon a time, however, their group consisted of five members. One year earlier Jaffrey had thrown a party at his house in honor of a visiting actress, and their fifth member, Edward Wanderly, had died in an upstairs bedroom during the festivities. When his body was found there was a look of absolute horror on his face, as if he had been frightened to death. Ever since that night the friends have been plagued with horrible nightmares, and have taken to telling each other ghost stories. At one of their meetings, Sears tells them a The Turn of the Screw-like ghost story about when he was a young man. Before deciding to attend law school James had taken a teaching position in a rural community. He developed a fascination with one of his students, a young boy named Fenny Bate. Fenny and his sister were ostracized by the community, and upon making some inquiries he finds out why. The two children once had an older brother named Gregory, and it was generally believed that Gregory sexually molested his young brother. The parents of the siblings were dead, and Gregory was their guardian. One day while repairing a roof Gregory fell off the ladder and was killed, and someone thought they saw the two young Bate children running away from the scene. Sears tells his friends that in time he began to see a threatening young man hanging around the school, and he eventually comes to believe it to be the spirit of Gregory Bate. Sears attempted to save Fenny from the clutches of his dead brother, but to no avail. Fenny died, and Sears was legally obligated to finish out the school year and then he left the small community. The next morning after telling his story Sears and Ricky are called out to the farm of one of their clients, who has found some mutilated livestock in his field. Later in the car Sears reveals to Ricky that the previous night's story was not fictitious, but had actually happened to him in his youth. Sears also admits that he is scared, as are all the members of the Chowder Society. They decide to write to Edward's nephew Donald Wanderly, as Donald had written an occult novel and they think that his research abilities might be employed to good use on their behalf. Before Donald can arrive, however, Jaffrey dies in an apparent suicide by jumping off of a bridge. Donald arrives just as the funeral is coming to a close. The three remaining members of the Society tell him that they want him to investigate any possible avenues that he might deem appropriate. Several years previously Donald's twin brother David had died under mysterious circumstances, and it led him to write his horror novel. Donald tells them the story of what he thinks actually happened. Several years previously he had landed a teaching position at Berkeley on the strength of his first novel. While there he began seeing a beautiful grad student named Alma Mobley. At first he was inseparable from her, and there was talk of marriage. But over time he began to notice strange things about her. He described it as more of a sensation, but he felt that there was something unnatural about Alma. He stopped seeing her as much, his work suffered, and one day Alma simply vanished. Upon investigating he found out that a great many things that Alma had told him about her past were fabrications. A few months later David called him and told him that he and Alma were engaged, and that he wanted things to be right between Donald and his fiance. Donald tried to warn David, but to no avail. And soon thereafter David was dead. Not long after this Lewis Benedikt dies in the forest, and Sears and Ricky decide that is time to tell Donald the most terrible story that the Chowder Society knows...and it is a true tale. 50 years previously a young woman named Eva Galli had moved to the town. She was in her early twenties and all five of the young men fell head over heels for her. One night in 1929—not long after Black Monday—Eva came to see them, but she was not acting like herself. She made sexual advances and belittled them. There was a struggle, and Eva fell and hit her head. Believing her to be dead, they conspired to hide the body by putting it in a car and driving it into a deep pond. But at the last moment Eva's body disappeared from the inside of the car, and there was a lynx looking at them from the other bank. Donald begins his research and quickly comes to the conclusion that what they are dealing with is a manitou, or some other kind of shape-shifting creature. He also believes that Alma Mobley is actually Eva Galli. Donald theorizes that since these creatures live much longer than humans Eva waited fifty years before returning for her revenge. Donald, Ricky, and Sears are joined in their struggle by Peter Barnes, a young man whose mother was killed by these creatures. Sears is ambushed and killed in his car, and the survivors now realize that Gregory and a reanimated Fenny are helping Eva in her endeavors. Gregory tells them that a woman named Florence de Peyser helped resurrect him, and it seems that Eva is also subservient to the de Peyser woman. Gregory and Fenny attack Peter, Don, and Ricky in a movie theater, but they are both killed in the ensuing struggle, leaving Donald to realize that though they have other-worldly powers, the creatures are not truly immortal. The survivors track Eva down and defeat her, but she escapes. Exhausted, Ricky leaves Milburn for an extended vacation with his wife, and Peter prepares for college. Donald keeps watch to see what form Eva will next appear in, and believes it to be the little girl in the opening part of the book. While in Florida, Eva emerges from the form of the little girl and attempts to twist Donald's mind. He is able to resist and kills her after she tries to take the form of a wasp to escape. Donald then prepares to go to San Francisco to hunt down the de Peyser woman."
}