{
    "book_id": "16097630",
    "mid": "/m/03qp33s",
    "title": "Grief: a Novel",
    "author": "Andrew Holleran",
    "publication_date": "2006",
    "genres": [
        "Novel"
    ],
    "text": " The narrative takes place in a predominantly gay neighborhood in Washington D.C. near the famous Dupont Circle. The story focuses on the exploits of a middle-aged, gay man who has recently moved to the city after the death of his mother. The novel follows this protagonist as he goes through the grieving process, holding true to the belief our deceased loved ones stay with us forever, or at least as long as we continue to grieve for them. Considering the novel’s exploration of the complex and highly personal emotion of grief the title seems simple, yet remains effective. The protagonist convinces himself the emotion has become one of the major aspects of his life as a survivor. In essence, he lives to grieve both his mother and the numerous gay friends he lost during the 1980s AIDS epidemic. Characters frequently debate grief at various instances. Some of these individuals find the emotion unnecessary baggage. The protagonist refuses to accept this argument; he feels strongly that grief provides a crucial link between the living and the dead. The novel opens with a first-person narrator, a nameless, middle-aged, gay man. He has decided to take a teaching position in Washington D.C. He starts his journey waiting for his flight during a layover in Atlanta. Sitting in the departure lounge, he can’t help but think about his late mother. He reminisces how his life used to revolve around her when she was terminally ill. He remembers how he lacked any serious social life because he would spend every weekend with her after picking her up from the nursing home. After she passed, he realized a change in scenery was in order. His life in Florida had become hollow and depressing. The narrator arrives at his new residence on N Street N.W. to discover his landlord and future roommate is out of town. He has mixed emotions about having the new house to himself on his arrival. He enjoys the solitude, but feels a bit lonely. He takes time to observe the furniture, art work, and architecture of his new residence, as well as the exteriors of the other residential buildings throughout the neighborhood. Overall, he rather likes his new environment. During his first night in the house he comes across a book in his room entitled, Mary Todd Lincoln: Her Life and Letters. The work consists of numerous letters written by the former first lady after the death of her husband. The narrator relates deeply to the grief Mary Todd Lincoln expresses throughout the pages of the text. After her husband died, she no longer had a stable home; she simply wandered the world in a permanent state of mourning. The narrator continuously reads this book throughout the novel; comparing Mary Todd Lincoln’s suffering to that of his own. During his first few days alone in the house, he encounters numerous interesting locals around N Street. He meets a homeless man who works as a con-artist, telling people he needs money to take his nonexistent wife to the hospital. He also notices the handsome, yet reclusive, military veteran who cleans leaves off the sidewalk and receives helpful advice from the homosexual couple who live in the townhouse beneath him. The landlord soon returns from his business trip and introduces himself to the narrator. Similar to the protagonist, this character also remains nameless. The landlord is also gay, middle-aged, and currently single. The two men acquaint themselves and discuss current events taking place in the city. Apparently, a racial schism has broken out between blacks and whites after the mistreatment of a local African American politician. The narrator realizes he has picked a very tumultuous time to move to the nation's capitol. After getting settled, the narrator decides to visit his friend, Frank, who recommended him for the teaching position. Frank is also gay; however, he behaves far more flagrantly than the narrator or the landlord. During their visit the two discuss the death of the narrator’s mother and the hardship of living as middle-aged gay men. Frank also mentions he has a new boyfriend, a handsome and muscular young man which he refers to as the Lug. Desperate for the two of them to meet, Frank suggests the three of them should go out to a movie. The narrator declines, explaining he would rather explore the more intellectual aspects of his new city. Over the next couple weeks he peruses the numerous museums and evening concerts Washington D.C. has to offer. He enjoys the culturally experience, but regrets having to do it alone. Walking through the streets alone at night tends to remind him of the grief he feels from his mother. One morning, after the landlord has left for work, the narrator discovers the man keeps his dog, Biscuit, cooped up in the study all day. He opens the door in hope the dog will come out, only to realize the animal enjoys her confinement. The narrator begins liberating the dog from the study on a regular basis and grows fond of her company. He keeps this secret from the landlord, worried it will upset the man. As the days turn to months, the narrator and his landlord develop a platonic friendship with one another. They share meals together and frequently discuss the local gay community. The landlord reveals himself to be a very popular individual on N Street. Unfortunately, personal issues have driven him to leave his previous social life behind. He admits to having been romantically involved with a member of the gay couple living beneath them. The relationship ended badly and the landlord finds it difficult to socialize while his ex-lover lives happily with another man. Nevertheless, the landlord continues to post personal ads in the local newspaper with the hope of attracting a new boyfriend. With time the narrator grows comfortable in his teaching position at the local university. His course focuses on literature specifically relating to homosexuality. He decides to reference the Mary Todd Lincoln book by comparing the assassination of Abraham Lincoln to the homosexual AIDS epidemic of the 1980s. This analogy angers one of his students, who viciously argues gays had a choice while Lincoln did not. The narrator proceeds to end the discussion by stating that “AIDS is dead,” considering it was primarily a homosexual disease, which will never impact the remaining population on such a high level. Few middle-age American homosexuals exist as a result of the 1980s epidemic. Such thoughts remind him of the numerous gay friends he lost to the virus. Just for living through the decade, he feels very much like a survivor. The narrator realizes he harbors a great deal of grief not just for his late mother, but for the many gay friends he lost during the 1980s. A few days later, the narrator encounters the belligerent student at the Metropolitan Museum. The student explains he takes the discussion of AIDS personally, because he had a gay brother who died from the virus. Their parents were appalled by their son’s homosexuality, so he tended to his dying brother alone. The student quickly excuses himself, but leaves the narrator with many thoughts about his deceased gay friends and the choices they had made. One day while liberating Biscuit from the study, the narrator comes across a photo album. Flipping through the pages he notices his landlord knew his late friend, Nick. The two discuss their mutual friend in detail. Nick was a beautiful young man who the narrator had known in New York City several years ago. Nick was one of the many AIDS victims during the 1980s. The landlord explains that Nick’s mother lives alone in Washington, not far from their house. The narrator pays her a visit and the two end up spending the day together. Over dinner, the two discuss grief and the impact it has had on both of their lives. In the end, they both agree mourning for lost loved ones remains one of the most human qualities on earth. As spring approaches, the narrator’s teaching position ends and he prepares for his departure. Both his landlord and Frank encourage him to stay in Washington, assuring him the transition would be beneficial. Nevertheless, the narrator feels he must return to his house in Florida. He still has emotional issues he needs to deal with before he can truly move on with his life. Shortly before leaving, the narrator confesses to Frank he had lied to his mother about his sexual orientation. Allowing his mother to die ignorant of his homosexuality fills him with the grief he carries everyday of his life. Upon returning to his Florida home he finds the grief to be overwhelming. He turns to pray in a hope God will bless the spirits of his deceased father and mother."
}