{
    "book_id": "2386360",
    "mid": "/m/078b7z",
    "title": "Hard to Be a God",
    "author": "Boris Strugatsky",
    "publication_date": "1964",
    "genres": [
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " The first chapter shows a scene from Anton's childhood, when he sneaks away from his boarding school with his friends, Pashka (Paul) and Anka (Anna), for a small role-play in the woods. It reveals that children live in a futuristic utopia, and the teenagers are drawn to the adventures on far away planets, where Earth tries to stimulate progress, by sending undercover agents (known as 'observers', not to be confused with latter-day progressors). While children play they find an abandoned road with a road sign \"wrong way\". Anton decides to go further and discovers remnants from World War II - a skeleton of German gunner chained to his machine gun. Later it is revealed that both Anton and Pashka grow up to be observers on the other planet, and are based in two neighbouring states: Anton in the Arkanar Kingdom and Pashka in the Irukan Duchy. The actual story begins when don Rumata (Anton) visits the Drunken Den, a meeting place for observers working in the Lands Beyond the Strait (Запроливье). Currently, he is investigating the disappearance of a famed scientist, Doctor Budah, who might have been kidnapped by the Prime Minister of Arkanar, don Reba. Don Reba leads a campaign against all educated people in the kingdom, blaming them for all the calamities and misfortunes of the kingdom. Rumata is alarmed, as the kingdom is rapidly morphing into a fascist police state. Apparently, all Rumata's efforts are concentrated on saving most talented poets, writers, doctors and scientists and smuggling them abroad, into neighboring countries. However, most of his native friends are murdered or broken by Don Reba's regime. Rumata tries to convince his colleagues that a more active intervention must take place. However, don Goog (Pashka) and don Kondor (an elder and more experienced observer) feel that he became to involved in native affairs and can't see the historical perspective objectively. They remind him of the vices of overly active meddling with the history of the planet. Not convinced, but left with no other choice, Rumata agrees to continue his work. Back in the city, Rumata tries pumping multiple people for information, including Vaga the Wheel, the head of local organised crime. He also comes to a soiree organised by don Reba's lover, dona Okana, who is also rumored to be don Reba's confidante. Rumata hopes to seduce he, and pump for information, however, he cannot hide the disgust, of whoring himself out, and has to retreat. Rumata's love interest, a young commoner named Kira, who can't stand any longer the brutality and horrors of fascist Arkanar asks Rumata to stay in his house. Rumata gladly agrees and promises to evetually take her with him to 'a wonderful place far far away' - meaning Earth, of whose existence Kira is unaware. His other plans don't go that smoothly. Life in Arcanar becomes less and less tolerable. Reba orders the torture and execution of dona Okana. Rumata - faced with the horrible consequences of his power play - goes into drunken stupor. Finally, left no other option, Rumata openly blames don Reba in front of the King Pitz VI for kidnapping a famous physician, that he, Rumata, invited to tend to King's maladies. The ensuing events prove that don Reba has anticipated and prepared for this. After confessing that he, in fact, kidnapped Dr. Budah, fearing that the man is not to be trusted with King's life, don Reba apologizes. He then brings forward a physician, introducing him as Dr. Budah. The next night, Rumata, who's turn is to guard royal prince and the only heir to the throne, is suddenly overwhelmed by dozens of Don Reba's men, and while fighting for his life witnesses them murdering the prince. They are in turn massacred by monks, apparently members of the Holy Order, a militaristic religious sect. Defeated Rumata is brought in front of don Reba. Don Reba reveals that he has been watching don Rumata for some time - in fact he knows Rumata to be an impostor - the real Rumata died long time ago. However, don Reba realizes that there is some supernatural power behind Rumata. Rumata's gold is of impossible high quality and Rumata's sword fighting style is unheard of - and yet - he never killed a single person while staying in Arcanar. Don Reba instinctively feels that killing Rumata may lead to retribution from his supernatural allies (he assumes Rumata to be a denizen of hell) and tries to forge a treaty with him. During their conversation, Rumata finally understands the magnitude of Reba's plotting. The presented physician was not Budah - impostor was promised a position of royal physician and was instructed to give King a potion - that was really a poison. King died and the physician was executed for murdering the king. With death of royal prince during Rumata's guard and king dead by hands of \"Budah\" - a doctor that was brought by Rumata and against Reba's wishes, Rumata can be easily blamed for staging a coup - in fact nobody would ever believe that he is not Reba's accomplice. In the same time, organized crime group of Vaga the Wheel, secretly encouraged by don Reba, started pillaging the city. Don Reba's then called in the Holy Order's army which quickly dispatched the criminals and the guardsmen alike, seizing the defenceless city with minimal losses. Reba - who might have been a pawn of Holy Order from the beginning - has become a new head of state, a magister of the Holy Order and bishop and governor of Arkanar. Shocked and infuriated, Rumata still holds his ground, and forms a non-aggression pact with Don Reba. He uses his new status to rescue the real Dr. Budah as well as his friend Baron Pampa from prison. Around him, Arcanar succumbs to the Holy Order. As the last of his friends and allies die and suffer in the turmoil, Rumata acts with all haste to expedite the departure of Budah. Rumata returns to his home, to discover his most loyal servant killed during a fight with a squad of Reba's stormtroopers who had gained entrance into the house; the rest of the household were then saved by a unit of the Holy Order. The three observers meet again to discuss the future. Both his colleagues are tortured by remorse, however, there is nothing to be done now. Don Kondor suggest that Rumata act carefully, as it is clear that rascal Reba can go back on their deal at any moment. He particularly advices to send Rumata's lover, Kira, to Earth with uttermost speed, as \"all that we hold dear should be either in our heart or on Earth\". Before Budah's departure, Rumata poses before him a theological question: \"what would you ask a god, if he could come from sky and fullfil any of your wishes\". After a long discussion - with Budah wishing and Rumata explaining the dire consequences of each of the wishes, Budah finally states that the only true gift, a god could give the people - is to leave them to their affairs. To this, Rumata replies, that god cannot bear the sight of their suffering. Budah crosses the border successfully and is saved. Feeling confident in his superior abilities and contacts in the military and the criminal world alike, Rumata plans to escape with Kira to Earth. However a unit of soldiers (either the friends of Kira's brother, or more likely, henchmen of don Reba) arrive in order to capture Kira and in the confusion she is shot dead by a crossbowman through the window. She dies in Rumata's hands. As the soldiers break the front door, Rumata, maddened with grief, unsheathes his swords and waits for them. The rest is narrated by Pasha to Anka. It is told, that space station was put on alert, when the house was attacked, however they did not have chance to react. The Earthmen doused the entire city with a sleep-inducing gas, but before that Anton-Rumata had fought his way through the city towards the palace - bathing his way in blood - where he finally killed don Reba. Remembering their childhood, Pashka wonders whether that episode, when Anton decided to disobey \"wrong way\" sign, and found a skeleton, had a deeper meaning - as going back to the past - to medieval world - could bring nothing but trouble."
}