{
    "book_id": "10097776",
    "mid": "/m/02q1qq8",
    "title": "Heart-Shaped Box: A Novel",
    "author": "Joe Hill",
    "publication_date": "2007-02-13",
    "genres": [
        "Speculative fiction",
        "Horror"
    ],
    "text": " Aging rock star Judas Coyne spends his retirement collecting morbid memorabillia such as a witch's confession, a real snuff film and, after being sent an e-mail directly about the item online, a dead man's suit. He is told, by the daughter(whom he does not know at the time), that the old man's spirit is attached to this funeral suit. The ghost will go wherever it does and so buying this suit would effectively be buying a poltergeist; Judas cannot pass up this opportunity. The suit soon arrives in a heart-shaped box. Various odd occurrences alert Judas to the fact that the ghost is dangerous and is out to kill him and those around him. His assistant, Danny Wooten realizes that the ghost of the suit will try to kill everyone round Jude. He leaves Jude's service, but not before contacting the woman who sent the suit. Jude finds out that the ghost was the father of a groupie, Florida (it is later revealed that her real name is Anna), whom he dated for a few months and who had later committed suicide. The ghost wanted revenge on Jude for causing Anna's death, as he saw it. His current girlfriend, Georgia (whose name is actually Marybeth), refuses to leave and together they run from the house with the ghost chasing them. The ghost's intention is to keep Jude away from his two dogs, Angus and Bon, as it turns out that dogs, as familiars, can protect their owners from the dead. But Georgia insists on taking the dogs with them. The animals save the couple several times, but the ghost eventually manages to kill both dogs. Jude and Georgia investigate and find out the true story about Florida. She did not commit suicide because of the breakup between her and Jude. Florida had many emotional problems and Jude had tried to help her but, in the end, he gave up. The reason she was so unstable was that she was being hypnotized and molested by her stepfather, the now dead and ghostly, Craddock McDermott. When Florida left Jude she had nowhere to go but back to her twisted family, but eventually she threatened to contact Jude to have him help her escape the incestuous relationship and file charges against Craddock and her elder sister, Jessica. They drove her to suicide to prevent her from doing so. At a later point, Craddock, a man knowledgeable in the dark arts, realized he was dying and planned with Jessica to get revenge on Judas. They believed that Judas had \"ruined\" Florida by making her reject her family and their incest. Craddock hexed the suit; once he was dead, Jessica set the plan in motion. After a series of gory battles between Judas Coyne and Craddock McDermott, Georgia finds the way to bring Florida back from the grave and help Jude fight her stepfather. In the end, the evil Craddock is vanquished, freeing Jude and Georgia from his cruel curse. The two make it through the horrendous event and happily marry."
}