{
    "book_id": "3302985",
    "mid": "/m/094dhn",
    "title": "Heavy Weather",
    "author": "P. G. Wodehouse",
    "publication_date": "1933-07-28",
    "genres": [
        "Comic novel",
        "Comedy",
        "Fiction",
        "Humour"
    ],
    "text": " Monty Bodkin, despite his wealth, needs to hold a job down for a full year (\"There are wheels within wheels\"), so when he is sacked from his job assistant-editing Tiny Tots for Lord Tilbury's Mammoth Publishing Company, he jumps at his pal Hugo Carmody's tip that his old job as Lord Emsworth's secretary is available, especially on hearing that his former fiancee Sue Brown will be on the premises. Hearing that Monty is on his way, and fearing Ronnie's jealous nature, Sue heads to London, dines with Bodkin and warns him to be distant; on the train back, they both encounter Ronnie's formidable mother Lady Julia, and claim not to know each other. Lady Julia, having seen Sue and Monty at lunch together, tells her son about their suspicious behaviour, and Ronnie is at once convinced that Sue loves Monty. Meanwhile, Connie and Parsloe-Parsloe, unaware of these developments, task Percy Pilbeam with obtaining Galahad's manuscript, used to ensure Sue and Ronnie's marriage is permitted. Lord Tilbury, also wanting the book, visits the castle and is rebuffed. Leaving, he calls on the Empress, but is locked in a shed by Pirbright the pig-man, instructed by a suspicious Lord Emsworth to guard the pig closely. He is released by Monty Bodkin, who he persuades to steal the book by offering him a year's guaranteed employment - he is worried about his tenure at the castle, as Lord Emsworth suspects him, being the nephew of his rival Parsloe-Parsloe, of scheming to nobble his pig, the Empress. Beach, catching Pilbeam in the act of grabbing the book, tells Galahad and is instructed to guard the book himself. When he overhears Tilbury and Bodkin plotting in the garden at the Emsworth Arms, however, he sees the task is too much for him and hands the book on to Ronnie Fish. Fish is distracted by his loss of Sue's love, but once the storm breaks feels better; he sees Monty Bodkin, drenched from the rain, and is friendly towards him. However, when he sees \"Sue\" tattooed on Bodkin's chest, his mood turns sour once more. Sue, having heard Ronnie's kind words, is also cheered and rushes to find Ronnie; when he is once more cold and distant, she breaks down and breaks off the engagement. Bodkin finds Ronnie and asks him a favour - to get Beach to hand over the book, explaining he needs it in order to marry his girl. Ronnie, inwardly furious, chivalrously hands it over. Gally sees Sue is upset, learns all and confronts Ronnie with his idiocy. He explains about Bodkin and Sue, and Ronnie forgives her. Gally then confronts his sisters, threatening them once more with his book; although Julia is at first unmoved, when Gally relates a few of the stories it contains concerning her late husband \"Fishy\" Fish, she is defeated. Bodkin, having engaged Pilbeam to find the book for him, tells the detective he is no longer needed, revealing where he has hidden the manuscript. Pilbeam steals it, planning to auction it between Tilbury and the Connie-Parsloe syndicate, and hides it in a disused shed. He informs Lord Emsworth that Bodkin released Tilbury, and Bodkin is fired. Pilbeam is summoned to see Lady Constance, and primes himself with a bottle of champagne. She is insulting, and Pilbeam vows to sell the book to Tilbury, who he calls promising to deliver it, but he retires to bed first to sleep off the booze. Lord Emsworth, having moved the Empress to her new sty for safety, finds her eating the manuscript. Pilbeam sees this, and hurries to Connie and Parsloe-Parsloe, but is denied his fee when they find the pig has eaten the book. He then rushes to the Emsworth Arms, and gets a cheque out of Lord Tilbury, telling him the book is in the pigsty. Bodkin is on hand, however, and destroys the cheque and warns Emsworth by phone that someone is heading for his sty. Later, full of remorse, he offers Pilbeam a thousand pounds to employ him for a year in his agency. While Emsworth is being badgered by his sisters into denying Ronnie his money, a mud-spattered Lord Tilbury is brought in, captured by Pirbright. Gally and Sue then appear, informing Emsworth that Ronnie has the pig in his car and will drive off with it if denied his cash. Emsworth coughs up, and the happy couple depart, much to Gally's satisfaction."
}