{
    "book_id": "692200",
    "mid": "/m/0336z1",
    "title": "Iacocca: An Autobiography",
    "author": "William Novak",
    "publication_date": "1985-01",
    "genres": [
        "Autobiography",
        "Non-fiction"
    ],
    "text": " In part 1 of the book, Iacocca speaks of his Italian immigrant family and his experiences at school. Because he couldn't join the army for World War II due to rheumatic fever as a child, he attended Lehigh University, where he completed his studies in 8 straight semesters. He was offered a job at Ford straight out of college, but at the same time, he was offered a fellowship for a graduate degree at Princeton University. He took the fellowship with the promise of a job after leaving Princeton. Unfortunately, in his year at Princeton, his recruiter was drafted into the war and by the time he was finished with school, no one at Ford had heard of him. After explaining what had happened, he was given the 51st spot on the training group. In part 2 of the book, \"The Ford Story\", Iacocca tells of his triumph of the Mustang and his climb to power in the company. He and Henry Ford II developed a father-son relationship, and he also had developed a lasting relationship with Robert McNamara. After becoming President of Ford, Henry Ford II began fearing that Iacocca would be after the CEO job next. He established a plot to fire Iacocca, and Iacocca was to resign from the company on October 15, 1978, his 54th birthday. In Part 3, \"The Chrysler Story\", Iacocca tells of his difficult task of saving Chrysler from bankruptcy. He began a total reorganization of the company (including many layoffs) and received a US$1.2 billion loan guarantee http://thomas.loc.gov/cgi-bin/bdquery/z?d096:HR05860:@@@D&summ2=m& from the government with many stipulations, including increased fuel efficiency of its vehicles and restructuring the company to be profitable. On July 13, 1983, the loan was paid back in full and Chrysler began to flourish under the management of Iacocca. The final portion of the book, titled \"Straight Talk\", consists of rhetoric arguing for legislation compelling Americans to wear seatbelts, the high cost of labor, the Japanese challenge, and making America great again."
}