{
    "book_id": "3251094",
    "mid": "/m/09191h",
    "title": "Ice",
    "author": "Shane Johnson",
    "publication_date": "2002-07",
    "genres": [
        "Alternate history",
        "Science Fiction"
    ],
    "text": " In February 1975, Apollo 19 lands near the Aitken Basin near the lunar south pole (called \"Marlow\" in the novel) following a discovery of a vast quantity of water ice at that location. (Observation data from the 1994 unmanned spacecraft Clementine has indicated the existence of subsurface water ice mixed with lunar soil, as confirmed by Lunar Prospector and subsequent missions, but exposed water ice on the moon's surface has not been recognized by the scientific community.) There the crew tests an experimental heavy Lunar rover, launched to their location earlier by a Saturn 1B and delivered to the Moon using a stand-alone LM descent stage called the \"LM Truck.\" (Both of these vehicles might have been actually used on the Moon, according to Johnson, had not Project Apollo been cut short.) All goes well until the astronauts are ready to lift off to return to the orbiting Apollo CSM. Unfortunately, their LM ascent engine fails to fire. Repeated attempts to restart that engine—the only part of the LM system without a backup—all end in failure. Finding themselves stranded, the mission commander and LM pilot say goodbye to their wives. The commander peremptorily orders his CM pilot, in orbit around the Moon, to return home. He and the LM pilot then abandon the LM and strike out on their own, driving their rover to the limit of its remaining driving range \"to see what we can see.\" In their last message to Earth, they ask their colleague and Capsule Communicator to help their returning crewmate understand that he must not blame himself for their deaths. Before their oxygen runs out entirely, they find a vast and incredible Out-of-place artifact that might save their lives - or kill them. It is an ancient, abandoned, but fully functioning Lunar base - which they find immediately before the last seconds of their air run out. The base contains technology far beyond the reach of human science and engineering, best exemplified in the \"war room\" that they find immediately upon entry. This leads the two men to argue whether extrasolar visitors built it. LM Pilot Charlie Shepherd, a fundamentalist Christian, refuses to admit the possibility, because the Bible contains no warrant for it. Both men agree, however, that whoever the base builders are (or were) would be able to conquer Earth easily, had they chosen to attack—though why they never did attack remains a mystery. The two men soon find EVA suits that are one-third again as tall as human EVA suits are. Shortly thereafter, they find many members of the base crew—dead of various acts of violence, and in at least one case, a suicide. The suicide's living quarters contains multiple artworks depicting various scenes of torture, indicating that the base builders were a thoroughly evil people whose mania for causing suffering is incomprehensible. Subsequently Mission Commander Gary Lucas vanishes into an apparent journey into the past—specifically to the builders' home world. His friend, left on the base, searches it in vain for his friend, not realizing that his friend has entered a machine that can simulate events stored in its historical memory, based on input from a base-wide and planet-wide surveillance system. Shepherd finds a means of sustenance, and then finds a hangar—which turns out to be empty. Angered and desperate, Shepherd activates all the base' systems in the war room, except for one system that refuses to activate. In the process, he activates the base computer system, which regards him as non-human and starts broadcasting a distress signal to Earth. That signal will turn out to be the salvation of the two astronauts—because Congress, on the point of cancelling Project Apollo completely, reverses itself and authorizes Apollo 20 in direct response to the signal, which clearly is coming from the Marlow Basin. They cannot read the message, but—at least subconsciously—they realize that its activation after the men of Apollo 19 were supposed to have died cannot be coincidental. Gary Lucas has many perilous adventures in the \"home world\" simulation, which he accepts as entirely real. They begin with his rescue of a woman being assaulted, and continue with his capture by men bent on offering him as a human sacrifice and by his rescue by the woman's husband and brother-in-law. In gratitude, Lucas offers to join the workforce that is now applying the finishing touches to a vast granary that his hosts have been building and stocking. Meanwhile, Shepherd tries again to activate the last war-room system—and realizes, too late, that he has in fact started a self-destruct sequence. One by one, various base systems—gravity, climate control, and ultimately the food dispensary—begin to shut down. Lucas is injured during the storehouse construction project and, after the householders have an apparent argument concerning him, is given a sedative. He awakes to find himself in an empty house and steps outside in time to hear the roar of an onrushing wall of water, which lifts the storehouse off its foundations (incredibly, without damaging it) and threatens to sweep Lucas to his death. But then Lucas finds himself back on the base, in time to watch its crew destroy one another in mutiny, mayhem, murder, human sacrifice, and the eventual suicide of the base commander, who is the crew's last survivor. Following this, Lucas experiences an attack of vertigo. In fact the simulator machine has run its program, sounds three piercing alarm tones, and ejects him into the waiting arms of Shepherd just as the crew of Apollo 20 arrive to rescue them. That rescue is just in time—because after Apollo 20 completes trans-Earth injection, the self-destruct sequence runs its course, and the base destroys itself, apparently in a thermonuclear detonation. Back on Earth, the mission commander studies the Bible—and realizes that he actually witnessed the Noachic Flood and even ate at Noah's table. Also, the base builders never attacked Earth, because they were from Earth originally—from Antediluvian Earth. He and Shepherd further realize that God has entrusted him with a warning, which he must convey to anyone who will listen."
}