{
    "book_id": "6858376",
    "mid": "/m/0gsx_k",
    "title": "Imperium: A Novel of Ancient Rome",
    "author": "Robert Harris",
    "publication_date": "2006-09-04",
    "genres": [
        "Speculative fiction",
        "Historical fiction",
        "Fiction",
        "Historical novel"
    ],
    "text": " Part One – Senator – 79-70 BC The books opens and it is Tiro, M. Tullius, the secretary of Cicero who is the narrator, looking back in time over the thirty-six years he was with his master. They met when he was twenty-four years old and Cicero twenty-seven on the family estate in the hills of Arpinum. Cicero decides to consult the leading teachers of rhetoric, most of whom lived in Greece and Asia Minor, and borrows Tiro, never to return him. After trying the so-called Asiatic method, Cicero decides to enrol in the school of Apollonius Molon, a lawyer from Alabanda, who had retired to Rhodes to open his rhetorical school. It is here that Cicero develops the physical physique and voice that will make him such a popular and effective orator. Returning to Rome and becoming a senator, Cicero does a year of obligatory government service in Sicily and makes his way back to Rome to seek his fame and fortune. The plot develops when the senator and lawyer are visited some months later by Sthenius of Thermae, who has fled from Sicily after being threatened by the Governor of Sicily, Gaius Verres. Cicero decides to defend him and raises the matter in the Roman senate but his motion is talked out by Catulus and finally Hortensius, an aristocrat, Cicero’s arch rival and the leading lawyer in Rome. Cicero despatches Tiro to the National Archive, Catulus’s domain, to check Verres’s quaestorian records as governor and finds no accounts submitted. In the meantime, Verres finds Sthenius guilty of spying in his absence and sentences him to death. Tiro arranges for a place to hide him – in one of his wife’s garrets in the Roman slums – and a decision is made to appeal to the tribunes and a deal is made with Palicanus, one of Pompey’s lackeys – Pompey the Great will assist over Sthenius if Cicero supports Pompey's consular ambitions. Gaius Verres, the pro-praetor of Sicily, sends his freeman Timarchides to search Cicero’s house and Terentia, his wife, berates her husband to act. The next day Cicero, accompanied by Terentia and Quintus, his brother, makes a speech before the ten tribunes and Sthenius is safe as long as he remains in Rome.Crassus returns to Rome, victorious after his defeat of Sparticus and Cicero goes out to welcome him, following an invitation, on the Appian Way. However, the two men intensely dislike each other and refuses to support Crassus’s request for a triumph. Pompey the Great also returns from Spain and strikes a bargain with Crassus that they will share the consulship and Cicero’s career looks finished. Sthenius, who has been ignored for some time, turns up at the house one morning, accompanied by Heraclius and Epicrates who have also been swindled out of their estates by Verres. Over dinner one evening, Cicero declares his intention to stand for election as aedile and to accomplish it by prosecuting Gaius Verres for extortion, based on the accumulated evidence. Over the following months, Quintus acts as his campaign manager. Pompey is given his triumph. Gaius Verres returns to Rome. At the embezzlement court, chaired by Glabrio, Cicero submits his postulates, an application to prosecute. However, the court also receives a second application to prosecute Verres from Verres’s quaestor, Caecilius Niger – a time delaying tactic by Hortensius and Cicero has to fight it out at the Temple of Castor and eventually wins against a biased jury, surprisingly supported by Catulus, the hard and snobbish old senator who is, nevertheless, a patriot to his marrow. Cicero is forced to borrow money from Terentia to support his case and leaves Rome on the Ides of January to seek evidence against Verres in Sicily. He, Lucius, his cousin, and Tiro gather a lot of incriminating evidence, particularly after a raid on the office of the tax collectors in Syracuse where they find out about the extent of Verres’s extortion from a set of duplicate records (the originals have been removed) kept by Vibius, the financial director during Verres’s term of office. On a visit to the stone quarries, the encounter crews of merchant ships imprisoned there that should have been captured pirates whom Verres had ransomed. Cicero has an argument with Metellus, the Governor, over his appropriation of the records but is allowed, under law, to make a fair copy of them and is supported by leading members of the city’s most eminent men. On his return to Rome, Cicero discovers Hortensius hoping to tie up the extortion court’s time until the consular elections. To fund his case and also his aedile election campaign, Cicero is obliged once more to borrow money from Terentia. At the first round of the elections, Cicero learns that Verres is bribing the voters with his immense wealth; Marcus Metellus also draws the election court as praetor. At his wit’s end, Cicero pays a visit with Tiro to Pompey’s house and a secret bargain is made. The second round of the aedile elections takes place on the Field of Mars Marcus Cicero is victorious against all the odds. His energies renewed, Cicero brings all this Sicilian witnesses to the extortion court, on the 5th August in the consulship of Gnaeus Pompey Magnus and Marcus Licinius Crassus, and the trial of Gaius Verres begins. With only ten days to go until the games of Pompey the Great, Cicero follows Terentia’s advice and makes a short, withering speech saying he will make his case in the space of ten days and his success if confirmed when the court hears of the case of a Roman citizen, named Herennius, beheaded by Verres because he knew of the Governor’s taking bribes from the pirates. On the last day, a Sicilian named Numitorius tells the story of Publius Gavius, flogged to death in public despite saying ‘I am a Roman citizen’ at every stroke of the lash. All that is left is to determine the fine. Verres disappears and Hortenius makes a written offer of one and a half million which Cicero and his team reject. However, Pompey pays a call to his house who orders them to accept it (it turns out Cicero had asked Pompey to ensure Glabrio, the judge of the extortion trial, remained independent) – Pompey himself does not want to be caught in the middle of a civil war between the people and the senate. Part Two – Praetorian 68-64 BC Cicero enjoys two years of success and happiness. In his thirty-ninth year he is looking forward to the elections for a praetorship. He maintains relations with Pompey and decides to take on the case of Marcus Fonteius, the former governor of Further Gaul who is being prosecuted for corruption. Cicero does it so that he can deal with the rumour that he supports foreigners above his own people and lay it to rest. Back in the extortion court he wins his case against the Gauls but is saddened by the death of his cousin, Lucius, whom Tiro knows commits suicide, as well as his father. Whilst staying at the family farm, news arrives that Rome is threatened by pirates and Pompey request his presence at a council of war back in Rome. A plan is hatched to divided the Mediterranean into fifteen zones, with each zone to have its own legate, responsible for scouring his area clean of pirates and then to make treaties with the local rulers to prevent their return – all to report to one supreme commander, Pompey the Great. Knowing that the aristocrats will baulk at this concentration of power, Cicero persuades Pompey not to put his name anywhere on the bill setting up the supreme command and to leave it to the people to vote it to him. Rome is in a panic with the burning of Ostia by the pirates and when the Latin Festival finishes, Gabinus mounts the rostra to demand a supreme commander and at a meeting in the Senate Pompey’s arrival is greeting with boos and jeering and Piso and the other aristocrats attack him for wanting to be a second Romulus in their determination to vote down the lex Gabinia. Back at Pompey’s mansion there is a determination to prevent Crassus stealing Pompey’s glory. Cicero’s plan is to have Gabinus summon Pompey to the rostra the next day, asking him to serve as supreme commander, and to have Pompey reject it and then the people would demand he take it. Cicero writes his speech and Pompey makes his announcement to retire from public office. Crassus and Pompey are evenly matched against one another, with each having enough supporters to veto the bill if required. Crassus turns up at Cicero’s house and suggests a joint supreme command, and offering to support Cicero for consul if he conveys the offer to Pompey but Cicero’s rejects the proposal, despite being threatened by Crassus with suffering the same fate as Tiberius Gracchus. Tiro is dispatched once more to the National Archive to research Gracchus and Cicero learns that his agrarian reform law was vetoed by the tribune, Marcus Octavius, and Gracchus called upon the people to vote him out of office but was later beaten to death with sticks by the aristocrats and his body thrown into the Tiber. At a meeting at Pompey’s house, Cicero reads out the extract from the Annals and it is decided to use the same precedent – although a dangerous one for the health of the republic – to get Pompey the supreme command. Gabinus oversees a vote although he is opposed by a fellow tribune, Trebellius, a supporter of Crassus, and so Gabinus puts it to the voters to vote him out of office. Catalus tries to intervene and Roscius tries to propose splitting the joint command but is ignored by Gabinus and the lex Gabinia is passed. Pompey later arrives in the forum wearing the paludamentum, the bright scarlet cloak of every Roman proconsul on active service, and leaves the city to tackle the pirates, not to return for another six years. Cicero is elected praetor and is allocated the extortion court. The lex Manilia is proposed, granting command of the war against Mithradates to Pompey, along with the government of the provinces of Asia, Cilicia and Bithynia, the latter two held by Lucullus, which is opposed by Catulus and Hortensius. Marcus Caelius Rufus, the son of a wealthy banker, becomes Cicero’s pupil and brings him political gossip. Cicero is summoned to the house of Metellus Pius, pontifex maximus, and requested to prosecute Catilina over his extortion as governor in Africa. Turning down a governorship of a province and the lucrative money-making opportunities, Cicero opts instead to defend Caius Cornelius, Pompey’s former tribune, who has been charged with treason by the aristocrats and the jury acquits him of all charges. Events take a turn for the worse when Publius Clodius Pulcher lays charges against Sergius Catilina for the crimes he committed in Africa and Cicero thinks about defending Catilina. Terentia gives birth to a baby boy named Marcus, much to the household’s delight, and Cicero goes to Catilina’s house once more and says he is so guilty he cannot be is advocate. Cicero leaves Rome to campaign among the northern for their vote in the consulship election. He is assisted and stays with governor Piso who tells him that the aristocracy are behind Antonius Hybrida and, on his return to Rome, learns that Hybrida and Catilina are planning to run on a joint ticket. He learns from his close friend, Atticus, that Crassus is attempting to hijack the election through bribery. Using two political agents, Ranunculus and Filum, he eventually is taken to a bribery agent, Gaius Salinator, who tells him under duress that he has been paid by Crassus to deliver votes for Hybrida and Catilina and that Crassus is attempting to buy eight thousand electoral votes at the cost of twenty million. Tiro is dispatched off to meet with Caelius Rufus, who is now working for Crassus, to find out what his plans are. Rufus, who dislikes old baldhead intensely, agrees to hide Tiro in a secret panel behind a tapestry during an important meeting. About twenty important men meet at Crassus’ house, including Caesar and Catilina, and on his return to Cicero they work together on his transcribed notes, finding out that the conspirators plan to seize control of the state, introduce a land reform bill, sell of vast amounts of conquered land abroad and then annex Egypt for further acquisition of land in Italy for the plebs. It is Terentia's idea to Cicero to use the aristocrats to support him. A copy of the meeting’s notes are sent to Quintus Hortensius Hortalus. Cicero makes a devastating attack on Mucius in the senate, calling him a whore for being paid to slander Cicero’s reputation, and then goes on to indirectly attack Crassus for using bribery to reject an anti-bribery bill. Cicero then turns his attack on Catilina and, on returning home, has to wait for a reaction from Hortensius. He receives a message and is taken to Lucullus’ new house outside Rome, and Quintus Metellus, whom tried to block Cicero’s efforts in Sicily, is also present. They are suspicious of the meeting’s notes but Tiro convinces them by recording their own conversation using his shorthand script and in the early hours of the morning a deal is struck between the ‘new man’ and the aristocrats. The next day is the consular election on the Field of Mars. On returning home Cicero informs Quintus of what has transpired, and Terentia is also supportive. Cicero puts on a splendid show with a large crowd of supporters and followers accompanying him on the parade and Hortensius comes up to him with a message which leaves Catilina and Hybrida confused as they know the two men are arch enemies. The aristocratic centuries have been instructed to switch their support from Catilina to Cicero and, despite Crassus’ vote purchase, the turnout is large enough to swing the election Cicero’s way, and he is the outright winner for consul with 193 centuries, followed by Hybrida with 102. At the age of forty-two, the youngest age allowable to achieve the supreme imperium of the Roman consulship, the ‘new man’ has achieved his ultimate ambition."
}