{
    "book_id": "1529600",
    "mid": "/m/058c86",
    "title": "In Desert and Wilderness",
    "author": "Henryk Sienkiewicz",
    "publication_date": "1912",
    "genres": [
        "Young adult literature",
        "Fiction"
    ],
    "text": " The story takes place in the 19th century Egypt. A 14-year-old Polish boy Stanisław (Staś) Tarkowski and 8-year-old English girl Nel Rawlison live with their families and grow up in the city of Port Said. Their fathers are engineers who supervise the maintenance of the Suez Canal. One day an anti-British rebellion begins in Sudan, led by a Muslim preacher Mahdi. Staś and Nel are captured as hostages by a group of Arabs who hope that they can exchange the children for Fatima, Mahdi's relative that had been arrested by the British at the beginning of the novel. The children are forced to travel through the Sahara Desert to Khartoum, where they are to be presented to Mahdi. The journey is difficult and exhausting, especially for delicate and vulnerable Nel. Staś, who is a brave and responsible boy, protects his friend from the abductors' cruelty, even though that means that he is beaten and punished. His plans to escape fail and the children gradually lose their hope. When the group arrive to Khartoum, the Arabs are disappointed by the fact that Mahdi - busy with leading the revolt - ingored their \"mission\" and turned down their offers. They take their anger and frustration on the children. Staś and Nel, exhausted by heat, thirst, hunger and poor treatment, live for some time in the city ruined by war, poverty and diseases. After a while the children and Arabs in another journey further south, to Fashoda. One day the group encounters a lion who attacks them. The Arabs (who don't know how to fire a shotgun) hand in the weapon to Staś and beg him to shoot the beast. Staś kills the lion, and then shots down the Arabs as well. This is dictated by the despair and fury: the boy knows that the men were not going to set the children free. He also hated the Arabs for abusing them - especially Nel. Once free, the children set out in an arduous journey through the African desert and jungle in hope that sooner or later they encounter British explorers or British army. The journey is full of dangers and adventures. The children, accompanied by two black slaves (a boy named Kali and a girl named Mea) whom Staś had freed from the Arabs, encounter a number of wonders and perils. The children stay for a rest on a beautiful hill near a waterfall. They soon find out that a gigantic elephant has been trapped in a gully near the waterfall. Nel, who loves animals, takes pity on the beast and saves it from starvation by throwing fruits and leaves into the gorge. The girl and the elephant (which is extremely intelligent and benign and whom Nel calls \"King\" because of its size) quickly become friends. Soon Nel is stricken with malaria and is about to die; Staś, mad with grief, decides to go to what he thinks is a Bedouine camp and beg for quinine. When he gets to the camp he find out that it belongs to an old Swiss explorer named Linde. The man had been severely injured by a wild boar and is waiting for death. All his Negro servants had fallen ill to sleeping sickness and die one after another. Although horrified by this gruesome death camp, Staś becomes friend with Linde who generously supplies him with food, weapon, gunpowder and quinine. Thanks to the medicine Nel recovers. Staś, grateful for Linde's help, accompanies the Swiss until the man's death. Then, using Linde's gunpowder, he frees King from the trap and they set out in further journey. Accompanying the children further on their journey is the 12-year-old slave boy of Linde, Nasibu. The group sojourns on top of a small mountain mentioned by Linde before his death where Staś teaches Kali how to shoot. On a certain day, a furious gorilla on the mountain attacks Nasibu but Nasibu is rescued by their now-tamed elephant which attacks and kills the gorilla. Deciding that the mountaintop is no longer safe, the protagonists move onto the village of Wa-Hima. The tribes-people, seeing Staś riding upon an elephant, honor him and Nel as a Good Mzibu (a good spirit/goddess). The group stays in the villages a short time, for Kali is by birth-right the prince of the Wa-Hima tribe and therefore well-known. Staś is further venerated by the villagers when he kills the wobo (a black leopard) that was plaguing the villages. Upon reaching Kali's home village the group learns that his tribe has been invaded by and attacked by their enemies since time immemorial - the Sambur tribe. Due to assistance from Kali's tribe and the guns carried by Staś and Nel, the war is won in the protagonist's favour. Though because of his good nature, Staś and Nel command that the tribes-people of the Sambur tribe not be killed but rather united with the Wa-Hima, and Staś urges the tribes to accept Christianity and live peacefully together. Staś, Nel, Saba, King, Kali, and 100 Sambur and Wa-Hima tribes-people move on to the East, which has not been mapped, in hopes of reaching the Indian Ocean and being found by English explorers who might be searching for them. Kali has accompanied with him also two witch-doctors: M'Kunje and M'Rua, in fear that they not plot against him while he is gone from his home. However, it finishes tragically for the group: both of the witch-doctors steal food and the last of the water but are soon found killed by either a lion or leopard. Many of the tribes-people accompanying Nel and Staś die for lack of water. After the group has gone for at least 3 days without any water in the scorching dry desert, the children are at last saved at the last moment by two familiar officers which had recovered kites inscribed by Staś and Nel earlier in their plight describing their whereabouts and destination. The group are saved and are informed that Mahdi has died of a heart attack. Staś, Nel and Saba are re-united with their fathers and they return to Europe, and Kali and his tribe members return to their settlement on Lake Rudolf. Staś and Nel get married when they grow up and visit their friends in Africa after 10 years."
}