{
    "book_id": "2445043",
    "mid": "/m/07dk45",
    "title": "Ironside: A Modern Faery's Tale",
    "author": "Holly Black",
    "publication_date": "2007-04-24",
    "genres": [
        "Fantasy",
        "Urban fantasy",
        "Young adult literature"
    ],
    "text": " In the realm of Faery, the time has come for Roiben’s coronation. Uneasy in the midst of the malevolent Unseelie Court, pixie Kaye is sure only of one thing— her love for Roiben. But when Kaye, on faerie wine, declares herself to him, he sends her on a seemingly impossible quest. Kaye the protagonist in the novel Ironside A Modern Faery’s Tale is given a quest that is described by being “Impossible”. Now Kaye cannot see or speak with Roiben unless she can find the one thing she knows does not exist: a faerie who can tell a lie. Corny and Kaye decide to watch Ellen her mother perform in a bar. A male character is watching Kaye. Corney goes over to him and tells him to back off. Unaware that this character is a faery Corny speaks to the faery in the bathroom. The faery curses Corny so that anything he touches withers. Miserable and convinced she belongs nowhere, Kaye decides to tell her mother the truth— that she is a changeling left in place of her human daughter stolen long ago. Her mother’s shock and horror sends Kaye back to the world of the Fae to find her human counterpart and bring her back to Ironside. But once back in the faery realm, Kaye and Corny find themselves a pawn in the games of Silarial, queen of the Seelie Court. Silarial wants Roiben’s throne, and she will use Kaye, and any means necessary, to get it. Meanwhile, Silarial is offering Roiben a lifeline- beat her champion and win seven years of peace while placing Roiben's sister Ethine on the throne instead, or die trying. While she is in the court, the Seelie queen attempts to make Kaye use Roiben's name by bribing her with the return of the \"real\" Kaye. Kaye uses a fake name, then escapes with Ethine as a hostage. Corny later gives Ethine back in exchange for the release of a friend's brother. (Luis, previously seen in Valiant) Kaye then finds out that Roiben is going to have to battle Ethine, not the knight Talathain, who they believed was the Bright Court's champion. She goes to warn Roiben. In order to speak to him, Kaye must complete his quest, and she does, claiming that she can lie, which in itself is an untruth. He beats Ethine but instead of simply killing her, he asks her who she will pass the crown on to. The Seelie queen objects to this, but Roiben declares that his sister has the right to declare her successor even with her last breath. Silarial tells him that if Bright Court will easily defeat the Unseelie Court if they were to fight; Roiben asks her if she will void their previous bargain, and Silarial agrees. Roiben reveals that he has gathered an army from the exiled fae, which would overwhelm the Seelie Court, but Silarial then threatens Kaye's life. Ethine kills Silarial with the sword she had been given, declaring that Silarial is no longer her Queen. Ethine now holds the crown because she was Silarial's heir, but she chooses to give it to Roiben, saying \"Take it and be damned.\" Roiben states that his sister's hate was a fair price to pay for peace and now rules both the Seelie and Unseelie Courts, and peace will be held as long as he controls both courts. Kaye tells Roiben that she plans to open a coffee shop in Ironside and spend half her time in Faery; she reveals that she was able to say she could lie because \"lying\" can also mean lying on the ground."
}