{
    "book_id": "59782",
    "mid": "/m/0g8ln",
    "title": "Job: A Comedy of Justice",
    "author": "Robert A. Heinlein",
    "publication_date": "1984",
    "genres": [
        "Science Fiction",
        "Speculative fiction",
        "Novel"
    ],
    "text": " The story examines religion through the eyes of Alex, a Christian political activist who is corrupted by Margrethe, a Danish Norse cruise ship hostess &mdash; and who loves every minute of it. Enduring a shipwreck, an earthquake, and a series of world-changes brought about by Loki (with Jehovah's permission), Alex and Marga work their way from Mexico back to Kansas as dishwasher and waitress. Whenever they manage to make some stake, an inconveniently timed change into a new alternate reality throws them off their stride (once, the money they earned is left behind in another reality; in another case, the paper money earned in a Mexico which is an empire is worthless in another Mexico which is a republic). These repeated misfortunes, clearly effected by some malevolent entity, make the hero identify with the Biblical Job. On the way they unknowingly enjoy the Texas hospitality of Satan himself, but as they near their destination they are separated by the Rapture &mdash; Margrethe worships Odin, and pagans do not go to Heaven. Finding that the reward for his faith, eternity as promised in the Revelation, is worthless without her, Alex's journey through timeless space in search of his lost lady takes him to Hell and beyond. Heinlein's vivid depiction of a Heaven ruled by snotty angels and a Hell where everyone has a wonderful, or at least productive, time &mdash; with Mary Magdalene shuttling breezily between both places &mdash; is a satire on American evangelical Christianity. It owes much to Mark Twain's Captain Stormfield's Visit to Heaven. The novel is linked to Heinlein's short story, \"They\", by the term, \"the Glaroon\", and to his earlier novel The Moon is a Harsh Mistress by referring to the Moon colonies \"Luna City\" and \"Tycho Under\"."
}