{
    "book_id": "232367",
    "mid": "/m/01hsn2",
    "title": "Journey to the West",
    "author": "Wu Cheng'en",
    "publication_date": "",
    "genres": [
        "Fiction"
    ],
    "text": " The novel has 100 chapters. These can be divided into four very unequal parts. The first, which includes chapters 1–7, is really a self-contained introduction to the main story. It deals entirely with the earlier exploits of Sun Wukong, a monkey born from a stone nourished by the Five Elements, who learns the art of the Tao, 72 polymorphic transformations, combat, and secrets of immortality, and through guile and force makes a name for himself, Qitian Dasheng (), or \"Great Sage Equal to Heaven\". His powers grow to match the forces of all of the Eastern (Taoist) deities, and the prologue culminates in Sun's rebellion against Heaven, during a time when he garnered a post in the celestial bureaucracy. Hubris proves his downfall when the Buddha manages to trap him under a mountain, sealing the mountain with a talisman for five hundred years. Only following this introductory story is the nominal main character, Xuanzang (Tang Sanzang), introduced. Chapters 8–12 provide his early biography and the background to his great journey. Dismayed that \"the land of the South knows only greed, hedonism, promiscuity, and sins\", the Buddha instructs the bodhisattva Avalokiteśvara (Guanyin) to search Tang China for someone to take the Buddhist sutras of \"transcendence and persuasion for good will\" back to the East. Part of the story here also relates to how Xuanzang becomes a monk (as well as revealing his past life as a disciple of the Buddha named \"Golden Cicada\" (金蟬子) and comes about being sent on this pilgrimage by Emperor Taizong, who previously escaped death with the help of an official in the Underworld). The third and longest section of the work is chapters 13–99, an episodic adventure story in which Xuanzang sets out to bring back Buddhist scriptures from Leiyin Temple on Vulture Peak in India, but encounters various evils along the way. The section is set in the sparsely populated lands along the Silk Road between China and India, including Xinjiang, Turkestan, and Afghanistan. The geography described in the book is, however, almost entirely fantastic; once Xuanzang departs Chang'an, the Tang capital, and crosses the frontier (somewhere in Gansu province), he finds himself in a wilderness of deep gorges and tall mountains, inhabited by demons and animal spirits, who regard him as a potential meal (since his flesh was believed to give immortality to whoever ate it), with the occasional hidden monastery or royal city-state amidst the harsh setting. Episodes consist of 1–4 chapters and usually involve Xuanzang being captured and having his life threatened while his disciples try to find an ingenious (and often violent) way of liberating him. Although some of Xuanzang's predicaments are political and involve ordinary human beings, they more frequently consist of run-ins with various demons, many of whom turn out to be earthly manifestations of heavenly beings (whose sins will be negated by eating the flesh of Xuanzang) or animal-spirits with enough Taoist spiritual merit to assume semi-human forms. Chapters 13–22 do not follow this structure precisely, as they introduce Xuanzang's disciples, who, inspired or goaded by Guanyin, meet and agree to serve him along the way in order to atone for their sins in their past lives. * The first is Sun Wukong, or Monkey, whose given name loosely means \"awakened to emptiness\" (see the character's main page for a more complete description), trapped by the Buddha for defying Heaven. He appears right away in chapter 13. The most intelligent and violent of the disciples, he is constantly reproved for his violence by Xuanzang. Ultimately, he can only be controlled by a magic gold ring that Guanyin has placed around his head, which causes him unbearable headaches when Xuanzang chants the Ring Tightening Mantra. * The second, appearing in chapter 19, is Zhu Bajie, literally \"Eight Precepts Pig\", sometimes translated as Pigsy or just Pig. He was previously the Marshal of the Heavenly Canopy, a commander of Heaven's naval forces, and was banished to the mortal realm for flirting with the moon goddess Chang'e. A reliable fighter, he is characterised by his insatiable appetites for food and sex, and is constantly looking for a way out of his duties, which causes significant conflict with Sun Wukong. * The third, appearing in chapter 22, is the river ogre Sha Wujing, also translated as Friar Sand or Sandy. He was previously the celestial Curtain Lifting General, and was banished to the mortal realm for dropping (and shattering) a crystal goblet of the Queen Mother of the West. He is a quiet but generally dependable character, who serves as the straight foil to the comic relief of Sun and Zhu. * The fourth is the third son of the Dragon King of the West Sea, who was sentenced to death for setting fire to his father's great pearl. He was saved by Guanyin from execution to stay and wait for his call of duty. He appears first in chapter 15, but has almost no speaking role, as throughout the story he mainly appears as a horse that Xuanzang rides on. Chapter 22, where Sha Wujing is introduced, also provides a geographical boundary, as the river that the travelers cross brings them into a new \"continent\". Chapters 23–86 take place in the wilderness, and consist of 24 episodes of varying length, each characterised by a different magical monster or evil magician. There are impassably wide rivers, flaming mountains, a kingdom with an all-female population, a lair of seductive spider spirits, and many other fantastic scenarios. Throughout the journey, the four brave disciples have to fend off attacks on their master and teacher Xuanzang from various monsters and calamities. It is strongly suggested that most of these calamities are engineered by fate and/or the Buddha, as, while the monsters who attack are vast in power and many in number, no real harm ever comes to the four travellers. Some of the monsters turn out to be escaped celestial beasts belonging to bodhisattvas or Taoist sages and deities. Towards the end of the book there is a scene where the Buddha literally commands the fulfillment of the last disaster, because Xuanzang is one short of the 81 tribulations he needs to face before attaining Buddhahood. In chapter 87, Xuanzang finally reaches the borderlands of India, and chapters 87–99 present magical adventures in a somewhat more mundane (though still exotic) setting. At length, after a pilgrimage said to have taken fourteen years (the text actually only provides evidence for nine of those years, but presumably there was room to add additional episodes) they arrive at the half-real, half-legendary destination of Vulture Peak, where, in a scene simultaneously mystical and comic, Xuanzang receives the scriptures from the living Buddha. Chapter 100, the last of all, quickly describes the return journey to the Tang Empire, and the aftermath in which each traveller receives a reward in the form of posts in the bureaucracy of the heavens. Sun Wukong and Xuanzang achieve Buddhahood, Sha Wujing becomes an arhat, the dragon horse is made a nāga, and Zhu Bajie, whose good deeds have always been tempered by his greed, is promoted to an altar cleanser (i.e. eater of excess offerings at altars)."
}