{
    "book_id": "12009118",
    "mid": "/m/02vltb1",
    "title": "Jurassic Park Adventures: Prey",
    "author": "Scott Ciencin",
    "publication_date": "2001-10-23",
    "genres": [
        "Science Fiction",
        "Fantasy"
    ],
    "text": " Prey reveals that Alan Grant has become part of a UN project to protect the dinosaurs of Isla Sorna. He is (somewhat unwillingly) forced to stay in the island coordinating a crew of scientists and other experts, and is decided to return balance to the dinosaur ecosystem by relocating some predators to other parts of the island. In this story, Eric Kirby blackmails Alan Grant so that he will let him go to the island. Alan agrees, but tricks Eric taking him during Christmas time where there are no operations going on in the island. Meanwhile, a group of teenagers led by 18 year old Simon Tunney lands in the island and try to film a movie about the island, so that they will become celebrities (just as Eric has, seemingly, after writing \"Survivor\"). Simon is obsessed with becoming a rich celebrity, even if that means to endanger his peers. Upon realizing this, Grant and his team go to the jungle and try to find them, while Eric escapes the headquarters and finds them himself. The teenagers then provoke a herd of Triceratops, and they attack them, but Eric saves them by imitating a Velociraptor's call. Eric tries to convince them to go to Grant's headquarters but Simon refuses fearing that Grant will confiscate his footage, and continues his trip. Angered, Eric follows, knowing that they are getting in the territory of large predators. Later, both Grant's and Simon's teams are attacked by three Carnotaurus. Grant realizes that the leader of the pack has a personal vendetta against him and runs away from the group to save the others. But the carnotaurs keep chasing the teenagers and almost kill one of them (Simon's little brother, who he sacrifices instead of his valuable footage). Eric saves the boy in the nick of time and the carnotaurs are dominated by Grant's full team. With recorded video evidence of his behavior, Simon is now trapped and is taken to prison while Grant praises Eric's braveness and allows him to become a temporal member of his team."
}