{
    "book_id": "15852265",
    "mid": "/m/03nx41l",
    "title": "Kyle XY: Nowhere to Hide",
    "author": "",
    "publication_date": "",
    "genres": [
        "Science Fiction",
        "Young adult literature"
    ],
    "text": " The story begins by introducing a high school classroom, and introduces a small portion of Kyle's past. After Kyle learns about an unknown event, the Monster Mash, he begins to question the concept of costumes and Halloween, which he had no previous knowledge concerning. Josh takes it upon himself to teach Kyle all about Halloween by taking Kyle to a costume store. There Josh dresses in a football costume, which causes one girl, Samantha Jeffries, to mistakenly believe him to be a quarterback (with Josh's help). Kyle finds himself upset with the entire concept of \"pretending\" for Halloween and considers it lying. Nicole tries to ease Kyle's pain by explaining the fun of Halloween, but Kyle struggles with this concept. Due to his amnesia he believes he is already pretending to be someone he is not. As Kyle questions his role in Halloween, Lori and Josh experience their own problems. Lori continues to struggle with her relationship to Declan. While Lori wants to go with Declan and attend the Monster Mash together, Lori refuses to ask Declan to go, believing that the man should ask the woman, much to Hilary's chagrin. As Josh prepares for his date with Samantha, whom he considers to be the hottest girl around, he realizes he needs to learn how to handle alcohol consumption, as many of the football players drink. When he fails to get into his parents' locked liquor cabinet he finds a bottle of vodka and begins pouring shots. After several drinks, he passes out. The next day, Lori notices that Josh is hungover, and the incident helps Josh to realize he never wants to drink again. Kyle's quest to get Amanda to notice him takes an interesting turn when Hilary decides to launch Operation Make Her Jealous, in an effort to get Amanda away from Charlie and with Kyle. Hilary begins spreading rumors about Kyle, while a rumor that Declan had a date put Lori on edge. When the Mash finally arrives, Josh is forced to reveal that he is not a football player, which immediately disgusts Samantha. As she drunkily stumbles away Josh realizes that it was better if he wasn't with her, and ironically, he runs into Ashleigh Redmond, the girl who skinny-dipped with Josh in Diving In. Kyle decides he doesn't want to lie to Amanda when he sees her look of disappointment at the notion of Kyle and Hilary together. Amanda disappears from the Mash, while Kyle tries to look for her and explain. On the school roof, a fight breaks out as Kyle arrives to look for Amanda. In the midst of the fight, Kyle and Asheigh are thrown from the roof, and Kyle instictively grabs Asheligh, but cannot land evenly, crashing onto his back. Having worn a Halloween mask, Kyle escapes without anyone realizing his identity. Declan visits Lori at home, where she stayed and the two reconcile their feelings. After returning to the Mash sans mask, Kyle finds Amanda and the two connect for the first time. Amanda is unsure what to say to Kyle, but she is interrupted by Charlie. After Amanda leaves, Kyle and Hilary have a discussion in which Hilary, for the first time tells the truth, admitting her crush on Kyle. As the dance ends, Kyle cannot wait to return home."
}