{
    "book_id": "597618",
    "mid": "/m/02txlz",
    "title": "Lanark: A Life in Four Books",
    "author": "Alasdair Gray",
    "publication_date": "1981",
    "genres": [
        "Science Fiction",
        "Fantasy",
        "Fiction",
        "Dystopia",
        "Novel"
    ],
    "text": " Lanark comprises four books, arranged in the order Three, One, Two, Four (there is also a Prologue before Book One, and an Epilogue four chapters before the end of the book). In the Epilogue, the author explains this by saying that \"I want Lanark to be read in one order but eventually thought of in another\", and that the epilogue itself is \"too important\" to go at the end (p.&nbsp;483). In Book Three, a young man awakes alone in a train carriage. He has no memory of his past and picks his name from a strangely familiar photograph on the wall. He soon arrives in Unthank, a strange Glasgow-like fantasy city in which there is no daylight and whose disappearing residents suffer from strange symbolic diseases. Lanark begins to associate with a group of twenty-somethings to whom he cannot fully relate and whose mores he cannot understand, and soon begins to suffer from Dragonhide, a disease which turns his skin into scales as an external manifestation of his emotional repression. Lanark is eventually swallowed by the earth, and awakes in The Institute, a sort of hospital which cures patients of their diseases but uses the hopeless cases for power and food. Upon learning this, Lanark is horrified and determines to leave. Books One and Two constitute a realist Bildungsroman beginning in pre-War Glasgow, and tell the story of Duncan Thaw (\"based on myself, he was tougher and more honest\"), a difficult and precocious child born to impecunious and frustrated parents in the East End of Glasgow. The book follows Thaw's wartime evacuation, difficult secondary education and his scholarship to the Glasgow School of Art, where his inability to form relationships with women and his obsessive artistic vision lead to his descent into madness and eventual suicide by drowning. Book Four sees Lanark begin a bizarre, dreamlike journey back to Unthank, which he finds on the point of total disintegration, wracked by political strife, avarice, paranoia and economic meltdown, all of which he is unable to prevent. During various stages of the journey, during which he meets his author, he rapidly ages. He finally finds himself old, sitting in a hilltop cemetery as Unthank breaks down in an apocalypse of fire and flood, and, his time of death having been revealed to him, he ends the book calmly awaiting it."
}