{
    "book_id": "14531370",
    "mid": "/m/03d6lrq",
    "title": "Light House: A Trifle",
    "author": "William Monahan",
    "publication_date": "2000",
    "genres": [
        "Satire",
        "Novel"
    ],
    "text": " The story begins with a painter named Tim Picasso who suffers critical rejection from his peers and decides to take a break in the Caribbean, where he ends up crewing on a drug smuggling sailboat. When the captain gets drunk and falls overboard, Picasso takes the boat to Florida, and meets up with Jesus Castro, the lead drug smuggler. Castro intimidates Picasso into running the drugs from Miami to Boston, however after Picasso collects the $1.5 million payment from the Irish Republican Army, he escapes by train to the New England town of Tyburn, where a winter storm is picking up force. He decides to lodge at the seaside Admiral Benbow Inn for the weekend, until he can depart for Italy. Meanwhile, Mr. Glowery, a bitter New York journalist and writer who believes that a rival author is sabotaging his literary career, arrives in Tyburn where he is to speak at a fiction workshop being held at the Admiral Benbow Inn. He is immediately tasered by one of Castro's detectives, who mistakenly confuses him for Picasso. Back at the Admiral Benbow Inn, the innkeeper, George Hawthorne, worries about Mr. Briscoe, a cross-dressing contract worker who is stranded in the abandoned lighthouse just off the coast because of the raging nor'easter, while his unhappy wife, Magdalene Hawthorne, threatens to leave him. The next morning, Mr. Glowery is stuck in a restaurant where he is being coerced by a psychotic cook to peddle his novel in order to pay off a debt he incurred during the night. When Professor Eggman, the director of the fiction workshop, comes across Mr. Glowery, he rescues him and brings him back to the inn. However, few people show up for the fiction workshop because of the storm. Hawthorne's wife returns from a spa with Picasso; Mr. Hawthorne informs her that he is trying to procure a prostitute for his new arrival, Jesus Castro, who has registered under the false name of Mr. Wassermann. Mr. Hawthorne asks Picasso if he has had sex with his wife and Picasso meekly admits to it. At the lighthouse, Mr. Briscoe decides to brave the storm in a landing craft, but is immediately swamped with water and carried by the tide towards the mainland. After Castro avails himself of the services of a prostitute, he rampages around the property searching for Picasso. The storm crashes through the inn. A guest is killed by a billiards table that falls on top of him and is dragged off into the sea. Mr. Glowery is also dragged off into the sea by the storm. Castro and his assistant round up the guests and interrogate them about the location of the $1.5 million Picasso stole. In another part of the inn a fire starts. Finally, Mr. Briscoe shows up and kills Castro's assistant before knocking Castro unconscious. While Hawthorne learns his wife is leaving him for the prostitute, the inn becomes completely engulfed in flames. Picasso, Hawthorne, and Briscoe motor a lobster boat over to the lighthouse, and dump Castro's dead assistant into the sea along with Castro himself, weighed down with two cinder blocks chained to his ankles. When they land on the island, Briscoe runs into the lighthouse and blows himself up. Amongst the rubble of the lighthouse, Picasso notices the inscription \"MORTE D'AUTHOR\" painted on one of the surrounding rocks and says to the innkeeper \"He's been thinking about this for some time, George.\""
}