{
    "book_id": "6642870",
    "mid": "/m/0gfvcs",
    "title": "Line of Delirium",
    "author": "Sergey Lukyanenko",
    "publication_date": "",
    "genres": [
        "Space opera",
        "Science Fiction"
    ],
    "text": " The first novel, \"Line of Delirium\", takes place decades after a devastating interstellar conflict — the Vague War. While the reason for and details of the war remain largely unexplained, it is clear that almost every alien race was at some point involved in hostilities with the humans. The war was going badly for Earth, until two Earth officers decided to take matters into their own hands. Disobeying orders, they turned their fleet and headed for Earth, demanding the government's surrender. One of the officers, a man named Grey, established the Human Empire and became the emperor. His co-conspirator Lemak became the supreme commander of all human forces. While it is not exactly clear how the tide was turned, it is known that all races opposing the new empire were eventually beaten. Two of which, the cyborg Meklar and the ursine Bulrathi formed a subsequent pact with the humans — the Trinary Alliance, creating a nearly unbeatable force (humans excel at ship-to-ship combat, Meklar are master engineers, and Bulrathi are superb ground combatants). Close to the end of the war, a man named Curtis van Curtis acquires an alien device he calls \"aTan\" (from athanatos, \"immortal\" [Greek: Αθάνατος, literally, \"without death\"] ) giving immortality to anyone who can afford it. He formed the aTan company, which quickly became almost as powerful as the Human Empire (as some characters in the novel call it, \"an empire within an empire\"). The secret of the device is coveted by many, as the aTan company holds exclusive rights, with Emperor Grey's grudging approval (in exchange he gets free reincarnations). Kay Altos is a professional bodyguard whose homeworld was destroyed by the imperial forces after it was invaded by the Sakkra — a fast-multiplying frog-shaped race, which was subsequently exterminated by the Empire. One fine morning he wakes up to face a teenager holding a gun, trying to avenge his sister's accidental death at Kay's hands. Kay's main problem — he did not have time to pay for his next reincarnation. He tries to trick the kid but ends up dying anyway. He is surprised to find himself in an aTan facility on Terra — the capital of the Empire with none other than Curtis van Curtis himself greeting him. Van Curtis hires Altos to safely bring his only son Arthur to an obscure planet known as Grail. Van Curtis's main concern is anyone finding out that Arthur is his son and kidnapping him in order to find out his father's secrets. Kay's payment should he succeed — unlimited free reincarnations. His payment in case of failure — eternal torture and executions. Kay agrees, and a backstory is created where Kay Ovald is a space merchant, travelling with his son Arthur, when their ship explodes. After reincarnating on a planet in the middle of a civil war, Imperial Security officer Isabella Kal recognizes Arthur and begins to chase him all over the Empire, even going as far as asking Admiral Lemak for help. Unfortunately for Arthur van Curtis and his bodyguard, Kal is not the only one seeking to stop them. A mysterious race known as the Silicoids seem to know of Arthur's mission to Grail and wish to prevent him from reaching his goal in order to preserve the galactic balance. Kay and Arthur board a luxury liner to the next planet on their way to Grail. Altos knows that, in all likelihood, Imperial Security is waiting for them at their destination. They manage to get passage on a shuttle, dropping off several passengers on a world close to their course. By a stroke of misfortune, that shuttle is stopped by a quarantine ship, and all passengers are secretly taken to a planet belonging to the Darloks — an ancient race exceptional at espionage and sabotage. Kay and Arthur soon discover that the Darloks plan to turn them into their agents and also manage to learn the Darloks' true form (unlike Master of Orion, Darloks here are not shapeshifters but Goa'uld-like snake parasites). It is there that Kay first meets Viacheslav Shegal — an agent of \"Shield\", Emperor's special forces. He helps Shegal commit suicide (to be reincarnated on a human world), so that the true nature of Darloks is known to all. Meanwhile, a massive Silicoid fleet arrives and proceeds to bombard the planet from orbit. Troops are sent in to retrieve Kay and Arthur and bring them before Sedimin — the Foot of the Silicoid Basis (a rank equal to emperor). Sedimin wants to know the true mission that van Curtis entrusted to Arthur. It is on the Silicoid ship that Arthur finally reveals to Kay an awful truth — he is not Curtis van Curtis's son. Arthur is a clone and, as such, has no rights under Imperial law. As Arthur puts it, \"immortals need no heirs.\" Since Arthur is being honest, Kay reveals that his true name is Kay Dutch and that he is a super — a genetically engineered being with increased speed, strength, memory, and other characteristics much higher than a normal human. By law, Kay also has no rights, but his past was covered up by a senator who adopted him. While Arthur still hides his true mission goal from Kay, he reveals it to Sedimin, who decides to let them go. They are dropped off on Tauri — a paradise planet for retired Imperial officers and their families. While Kay is out purchasing a ship, Arthur is kidnapped by Isabella Kal. Kay's determination to free Arthur is guided less by his obligation to his client than his friendship with the boy. His first destination, however, is the planet where he was killed prior to being recruited by van Curtis. He finds his killer, a teenager named Tommy Arano, and, instead of killing him, takes him to his hypership that was left on the planet. The next morning, Kay explains to Tommy that he is, in fact, Arthur van Curtis, whose mind was wiped by the Silicoids on one of his previous attempts to reach Grail. The mind-wiped Arthur was given to a human family to raise as their son, while another Arthur was reincarnated by \"aTan\" back on Terra because the machine assumed he died. Kay and Tommy then head to an Imperial planet almost entired ruled by a crime syndicate known as 'the Family'. The Mother of the Family is his genetic sister, also created in a test tube. She uses the Family's resources to locate Arthur on a heavily defended Imperial station. She agrees to given them all they need to retrieve the boy: outfit their ship with a masking device, provide them with advanced power armor and weapons (including an \"Excalibur\" tachion rifle for Kay that shoots a full second before the trigger is pulled), and four soldiers — two conditioned humans, a human cyborg, and a Meklar. Kay has himself souped-up with artificial enhancements (drastically shortening his lifespan). The strike group manages to infiltrate the base and fight their way to the medical wing, where Arthur is being tortured. Once Arthur is retrieved, they fight back to the ship, losing the two conditioned soldiers. In the hangar bay, Kay faces off against a Meklar working for Isabella Kal and is probably the first human (or almost-human) to pose a challenge to a twelve-foot-long mechanized reptile. Kay's Meklar companion clashes with the Imperial Security Meklar, giving the others time to escape. Once aboard his ship, Kay finds out that, due to his torture, Arthur is dying. Their only hope is to make it to Grail before he dies. When they finally make it Grail's orbit, another obstacle awaits them — Admiral Lemak and Isabella Kal on an Imperial destroyer. While Kay is trying to find a way out, his ship's illegal AI makes its own decision and the ship into the destroyer's shields. While Kay, Tommy, and Arthur are being reincarnated in Grail's branch of aTan, Kal forces Lemak to have her shot, so that she can follow them. The two clones and the bodyguard manage to make it to Grail's Dead Zone — an area on the planet where most mechanical devices fail for no apparent reason. It is there that Arthur finally reveals to Kay his true mission and the reason for van Curtis to have a clone: Curtis van Curtis did not obtain the \"aTan\" device from aliens. Van Curtis discovered Grail during the Vague War. There he found God or rather a being/machine that created the universe. God made van Curtis an offer — a universe created based on his subconscious desires, just like this universe was created for someone else. Van Curtis asked for more time to think about it. God then gave van Curtis the knowledge to create a device allowing him to live forever. Finally, after many decades, Curtis van Curtis decides to find out how new universes are created and sell these universes to the public. Kay realizes that this would destroy the Empire and attempts to stop them, but finds out that neither Tommy and Arthur nor Curtis van Curtis (who suddenly apprears) can be killed in the Dead Zone. Van Curtis takes Arthur and Tommy and leads them to the Threshold, but Tommy refuses and opts to leave with Kay instead. The novel ends as they both walk towards an uncertain future. \"Emperors of Illusions\" is the second novel, continuing the story of Kay Dutch as he travels with Tommy Arano, trying to stop Curtis van Curtis from destroying the Human Empire. They believe he is trying to do that to get back at the person he believes responsible for the creation of this universe — Emperor Grey. The only way Kay thinks he can stop van Curtis is by killing the Emperor, a virtual impossibility. \"Shadows of Dreams\" is a short prequel to \"Line of Delirium\" that describes life on a small quiet human colony that is turned upside down when a Psilon battleship enters the system, still believing that the Vague War is on. The Psilons are the most advanced race in the galaxy, with only two or three troopers wearing power armor necessary to destroy an entire city. As the colonists prepare for a hopeless battle, one man reflects on his life thus far."
}