{
    "book_id": "11166324",
    "mid": "/m/02r27mt",
    "title": "Little Green Men: A Novel",
    "author": "Christopher Buckley",
    "publication_date": "1999",
    "genres": [
        "Science Fiction",
        "Speculative fiction",
        "Mystery",
        "Satire",
        "Fiction",
        "Suspense"
    ],
    "text": " John O. Banion is a well-known pundit, who hosts a popular Sunday-morning television show (similar to Meet the Press). One morning, Banion grills the president of the United States on issues surrounding NASA. Shortly after, while enjoying a game of golf, Banion is abducted by what he believes are aliens and taken to their lab and probed. When he is returned, Banion is a changed man. He sets about trying to convince his friends in the Washington elite that the alien threat is real, but he is met with skepticism and derision. His marriage begins to fall apart and his friends abandon him. Banion starts to doubt himself, but is soon abducted a second time. When he returns from this abduction he completely abandons his old life and redevotes all his energy to pressuring Congress and the White House to investigate the alien threat. In fact, Banion was not abducted by aliens at all. Rather, he was abducted by Majestic, a government agency so secret that not even the president knew it existed. The purpose of Majestic was to occasionally make U.S. citizens believe they had been abducted by aliens. The abductees helped spread paranoia that was crucial to sustain public support for NASA's funding levels. When Majestic saw that Banion was critical of these funding levels, a Majestic agent authorized the abduction. However, the abduction of a well-known public figure caused problems within Majestic. Normally, they abducted slightly crazy people because, while helping \"spread the word\", nobody would take them too seriously. In an attempt to cover up the error, the leader of Majestic attempts to have Banion sentenced to death. As the truth about Majestic is discovered, the agency is ultimately forced to disband and the charges against Banion are dropped, although his life as a \"Beltway insider\" is ruined."
}