{
    "book_id": "2098128",
    "mid": "/m/06l_54",
    "title": "Mao: The Unknown Story",
    "author": "Jung Chang",
    "publication_date": "2005-10",
    "genres": [
        "Biography"
    ],
    "text": " Chang and Halliday do not accept the idealistic explanations for Mao's rise to power or common claims for his rule. They argue that from his earliest years he was motivated by a lust for power and that Mao had many political opponents arrested and murdered, including some of his personal friends. During the 1920s and 1930s, they argue, Mao could not have gained control of the party without Stalin's patronage, nor were Mao's decisions during the Long March as heroic and ingenious as Edgar Snow's Red Star Over China claimed and thereby entered the mythology of the revolution. Chiang Kai-shek deliberately did not pursue and capture the Red Army. Areas under Communist control during the Second United Front and Chinese Civil War, such as the Jiangxi and Yan'an soviets, were ruled through terror and financed by opium. Mao, they say, sacrificed thousands of troops simply in order to get rid of party rivals, such as Chang Kuo-tao, nor did he take the initiative in fighting the Japanese invaders. Despite being born into a peasant family, when Mao came to power in 1949 he had little concern for the welfare of the Chinese peasantry. Mao's determination to use agricultual surplus to subsidize industry and intimidation of dissent led to murderous famines resulting from the Great Leap Forward, exacerbated by allowing the export of grain to continue even when it became clear that China did not have sufficient grain to feed its population. Chang and Halliday argue that the Long March was not the heroic endeavour portrayed by the Chinese Communist Party and that Mao's role in leading it was exaggerated. Officially portrayed as an inspiring commander, the authors write that he was nearly left behind by the March and only commanded a fairly small force. He was apparently disliked by almost all of the people on the March and his tactics and strategy were flawed. They also write that Chiang Kai-shek allowed the Communists to proceed without significant hindrance as his son was being held hostage in Moscow and that he feared he would be killed if the Communists were crushed. Mao is also portrayed, along with the Communist elite, as a privileged person who was usually carried around in litters and protected from the suffering of his subordinates, rather than sharing their hardship. Despite the high level of casualties amongst ordinary soldiers, supposedly no high-ranking leaders died on the journey, regardless of how ill or badly wounded they were. The book says that, contrary to revolutionary mythology, there was no battle at Luding Bridge and that tales of a \"heroic\" crossing against the odds was merely propaganda. Chang found a witness, Li Xiu-zhen, who told her that she saw no fighting and that the bridge was not on fire. In addition, she said that despite claims by the Communists that the fighting was fierce, all of the vanguard survived the battle. Chang also cited Nationalist (Kuomintang) battleplans and communiques that indicated the force guarding the bridge had been withdrawn before the Communists arrived. A number of historical works, even outside of China, do depict such a battle, though not of such heroic proportions. Harrison E. Salisbury's The Long March: The Untold Story and Charlotte Salisbury's Long March Diary mention a battle at Luding Bridge, but they relied on second-hand information. However, there is disagreement in other sources over the incident. Chinese journalist Sun Shuyun agreed that the official accounts were exaggerated. She interviewed a local blacksmith who had witnessed the event and said that \"when [the troops opposing the Red Army] saw the soldiers coming, they panicked and fled — their officers had long abandoned them. There wasn't really much of a battle.\" Archives in Chengdu further supported this claim. In October 2005, The Age newspaper reported that it had been unable to find Chang's local witness. In addition, The Sydney Morning Herald found an 85-year old eyewitness, Li Guixiu, aged 15 at the time of the crossing, whose account disputed Chang's claims. According to Li, there was a battle: \"The fighting started in the evening. There were many killed on the Red Army side. The KMT set fire to the bridge-house on the other side, to try to melt the chains, and one of the chains was cut. After it was taken, the Red Army took seven days and seven nights to cross.\" In a speech given at Stanford University, former US National Security Advisor Zbigniew Brzezinski mentioned a conversation that he once had with Deng Xiaoping. He recalled that Deng smiled and said, “Well, that’s the way it’s presented in our propaganda. We needed that to express the fighting spirit of our forces. In fact, it was a very easy military operation.\" One of the allegations in the book against Mao was that he not just tolerated the production of opium in regions that the Communists controlled during the Chinese Civil War but also participated in the trade of it, in order to provide funding for his soldiers. According to Russian sources that the authors state they found, at the time the trade generated around $60 million a year for the Communists. This was stopped only due to overproduction driving down the price and Communist officials other than Mao deciding that the practice was immoral. Mao is alleged to have exposed men under his command to unnecessary suffering just to eliminate his opponents. Zhang Guotao, a rival in the Politburo, was sent with his army in 1936 on a hopeless mission into the Gobi desert. When it inevitably failed Mao ordered that the survivors be executed. Chang and Haliday suggest that Mao used other underhanded means in eliminating opponents. Apart from general purges like the Hundred Flowers Campaign and other operations like the Cultural Revolution, he had Wang Ming (another Politburo rival) poisoned twice, who had to seek treatment in Russia. Chang and Halliday write that in comparison to official history provided by the Chinese authorities that Communist forces waged a tough guerrilla war against the Imperial Japanese Army, in truth they rarely fought the Japanese. Mao was more interested in saving his forces for fighting against the Chinese Nationalists. On the few occasions that the Communists did fight the Japanese, Mao was very angry. Notable members of the KMT were claimed to have been secretly working for the Chinese Communists. One such \"sleeper\" was Hu Zongnan, a senior National Revolutionary Army general. Hu's son objected to this description and his threat of legal action led Jung Chang's publishers in Taiwan to abandon the release of the book there. Rather than reluctantly entering the conflict as the Chinese government suggests, Mao is alleged to have deliberately entered the Korean War, having promised Chinese troops to Kim Il Sung (then leader of North Korea) before the conflict started. Halliday had previously conducted research into this conflict, publishing his book Korea: The Unknown War. The book opens with the sentence \"Mao Tse-tung, who for decades held absolute power over the lives of one-quarter of the world's population, was responsible for well over 70 million deaths in peacetime, more than any other twentieth century leader.\" Chang and Halliday claim that he was willing for half of China to die to achieve military-nuclear superpowerdom. Estimates of the numbers of deaths during this period vary, though Chang and Halliday's estimate is one of the highest. Sinologist Stuart Schram, in a review of the book, noted that \"the exact figure... has been estimated by well-informed writers at between 40 and 70 million\". China scholars agree that the famine during the Great Leap Forward caused tens of millions of deaths. Chang and Halliday argue that this period accounts for roughly half of the 70 million total. An official estimate by Hu Yaobang in 1980 put the death toll at 20 million, whereas Philip Short in his 2000 book Mao: A Life found 20 to 30 million to be the most credible number. Chang and Halliday's figure is 37.67 million, which historian Stuart Schram indicated that he believes \"may well be the most accurate.\" Yang Jisheng, a Communist party member and former reporter for Xinhua, puts the number of famine deaths at 36 million. In his 2010 book Mao's Great Famine, Hong Kong based historian Frank Dikötter, who has had access to newly opened local archives, places the death toll for the Great Leap Forward at 45 million, and describes it as \"one of the most deadly mass killings of human history.\" Professor R. J. Rummel published updated figures on worldwide democide in 2005, stating that he believed Chang and Halliday's estimates to be mostly correct and that he had revised his figures for China under Mao accordingly."
}