{
    "book_id": "4312658",
    "mid": "/m/0bwjhl",
    "title": "Meg: Hell's Aquarium",
    "author": "Steve Alten",
    "publication_date": "2008",
    "genres": [
        "Science Fiction"
    ],
    "text": " Meg: Hell's Aquarium begins a couple of years after the Meg: Primal Waters ended. The prologue starts with Scarface, Michael Maren's pet Meg, and Angel's last surviving offspring from her first litter, hunting. Scarface gets enticed by a new prospective meal, Leedsichthys. While the Meg's attention is caught by the new meal, another creature of even more gigantic proportions (~100+ feet long) quickly seizes the opportunity and kills the distracted Megalodon. This larger creature, which was hinted at previously in the last book, is a Liopleurodon, which has evolved the ability to breathe underwater (much like the Kronosaurs from The Trench) . Danielle \"Dani\" Taylor is working at the Tanaka Institute with Jonas, Terry and Mac. David comes home from college for the summer to work at the institute. Besides its main attraction, Angel, the institute now holds Angel's five pups: Mary Kate, Ashley, Angelica, Belle, and Lizzy. Angel's behavior changes; unlike before, Angel refuses to respond to the feeding stimulus she has known all her life. The peace that the Taylors have enjoyed gets destroyed when a working accident causes Angel to go berserk, killing one of her feeders, injuring the other, and giving Dani some serious injuries. Angel's pups have separated themselves into two groups: Belle and Lizzy, who are just as aggressive as Angel but fear her due to her size and ferocity, and the other three females, who are much more docile, Mary Kate, Ashley and Angelica. An animal rights group called R.A.W. (Release Animals to the Wild) decides to try to get the Tanaka Institute to free the young females, even though the world knows the damage that Angel and her mother did when she escaped many years previously. Jonas and Terry want to expand the Institute to separate all of the siblings due to their increased aggression and appetite, but the state won't allow any expansion of the facility. Angelica is soon attacked by one of her siblings while being moved, and is killed. The cousin of the Dubai prince, Fiesal Bin Rashidi, comes to negotiate purchasing Mary Kate and Ashley for a large aquarium in Dubai. They also want Jonas to help them catch some prehistoric marine creatures from the Panthalassa, a hidden underground ocean which is all that remains of the primordial ocean of the same name. Michael Maren had discovered it and hinted at its existence shortly before he died in Primal Waters. Rashidi soon notices the talent and knowledge that Jonas' son David possesses during a private showing of Angel and they approach him and offer him a job for the summer. All he has to do is train pilots in how to use the Manta Ray submersibles that the institute uses. He goes off to Dubai while Jonas, Mac, Terry and Dani deal with Angel, Belle and Lizzy. In Dubai, David falls for a girl, Kaylie, who is recruited to pilot a sub for bin Rashidi's mission in Panthalassa. David helps train the crew to use the Manta Ray subs and he helps get Mary Kate and Ashley situated in their new home. One of the young Megalodons dies, but David is able to save the other's life. He gets a preview of what the Dubai aquarium wants&nbsp;— including a Kronosaurus and a Liopleurodon. Despite being offered lots of money, he refuses the mission of tracking down the prehistoric marine reptiles. Back at the Institute, pressure is mounting to release the remaining pups. Scientists come in and find out that the Megs have evolved to a state where males are not needed for reproduction anymore, so Angel and the pups either are pregnant now, or will be soon. Jonas and Mac have an implant put into Angel's brain which will allow them to control her brain stimuli which ultimately gives them total control of her. Jonas and Terry secretly arrange to release Angel back to the Mariana Trench while the R.A.W. group decides to release Lizzy and Belle by themselves. Lizzy and Belle cause havoc and death with their release and cannot be reined in. David eventually dates Kaylie, and she is chosen to go on the dive to Panthalassa, and bin Rashidi informs David of the Dunkleosteus, the \"Monster Fish\", which, along with Zahra, formerly called Mary Kate, resides in Dubai Land Aquarium; this effectively captures David's interest in Panthalassa, which plays into bin Rashidi's plan to have David, who is the best pilot on the team, attract and catch the residents of the Panthalassa sea. Kaylie insists on going on the dive with him and they end up in Panthalassa where they are attacked by many large and violent creatures and get attacked by a large 122-foot long Liopleurodon. The two escape the beast by hiding in a wreck of a ship that may have burst through the crust revealing the Panthalassa. Eventually, the two make it to one of Michael Maren's underwater labs and end up killing a mosasaur when the legs of the lab crush the head of the creature. Jonas finds out that David is trapped and uses the control they have of Angel to help him save David. Jonas gets attacked by another mosasaur, but Angel kills it, attracting the attention of the Liopleurodon. Jonas manages to get the lab through Panthalassa but not without problems. Due to their aggressiveness and territoriality, the Liopleurodon and Angel too leave Panthalassa and angrily fight over territory and Angel's kill. David and Kaylie escape the lab but find out that Angel is caught in bin Rashidi's nets. The Liopleurodon murders the trapped Angel and then sinks back to the depths. David and Kaylie almost make it out, but they soon find out that the mosasaur carcass is next to them. As Jonas wakes up, the Liopleurodon kills and eats Kaylie. David hasn't been having an easy time coping and he has concluded that therapy doesn't help, but he can't kill himself by cutting his wrists, so he will take off on a \"business trip\", either to destroy Panthalassa or kill the Liopleurodon in revenge for its murder of Kaylie and Angel. Though Angel has died, her pups are still hunting and reproducing.... leaving the opening for the next installation in the series \"Meg: Night Stalkers\"."
}