{
    "book_id": "3803226",
    "mid": "/m/0b0tmj",
    "title": "Meg: A Novel of Deep Terror",
    "author": "Steve Alten",
    "publication_date": "1997-07",
    "genres": [
        "Science Fiction",
        "Horror"
    ],
    "text": " Jonas Taylor (1956-) is a deep sea diver working for the United States Navy on a top-secret dive in the Mariana Trench. He sees a megalodon, the \"Meg\" of the title, a massive ancient predator that is believed to be extinct. Because he is the only survivor he is disbelieved. He becomes a paleontologist and tries to prove that the megalodon is real, but is still considered a crackpot. An old friend, Masao Tanaka, asks him to go back and help recover a UNIS (Unmanned Nautical Informational Submersible), which helps predict earthquakes, from the Mariana Trench. Again, they encounter a megalodon in the depths: the species has indeed survived, but is trapped in the Mariana Trench due to the 'cold water barrier' (the bottom of the Trench is heated by geothermal ducts, keeping the water warm, but that warmth has limited range and the far colder water above it keeps the sharks trapped there as the cold water would apparently have highly negative effects on the giant sharks unless traversed properly). A male megalodon attacks them and kills Tanaka's son before being entangled in the metal ropes connecting the submarine to the ship, which start dragging the shark up. However, the male shark's vulnerable state prompts an even larger female megalodon to emerge and attack it, and as the female rips it apart, she is bathed in the shark's warm blood as she follows the entangled male upwards, the warm flood of liquid keeping the female protected from the cold water long enough for it to reach the warmer surface waters of the ocean, hence unleashing the megalodon anew on the ocean's ecosystem. It doesn't take long for the shark to pick up where it left off after it reaches the surface, as it starts killing and eating whales, and sometimes people, including Jonas's estranged wife, Maggie. To make matters worse, the female is pregnant and gives birth. Both are tracked, as Taylor and Tanaka wish to capture the creature. They manage to get the mother, but it breaks free and starts attacking boats in the area where it was captured. Taylor manages to kill the mother in the carnage by ramming a submersible down its throat, slicing his way through its inner body, and eventually cutting through its heart before escaping. Jonas also manages to capture the offspring of the meg, ending the novel."
}