{
    "book_id": "2590334",
    "mid": "/m/07q4jm",
    "title": "Metaphysics",
    "author": "Aristotle",
    "publication_date": "",
    "genres": [
        "Metaphysics"
    ],
    "text": " Book I or Alpha outlines \"first philosophy\", which is a knowledge of the first principles or causes of things. The wise are able to teach because they know the why of things, unlike those who only know that things are a certain way based on their memory and sensations. Because of their knowledge of first causes and principles they are better fitted to command, rather than to obey. Book Alpha also surveys previous philosophies from Thales to Plato, especially their treatment of causes. Book II or \"little alpha\": The purpose of this chapter is to address a possible objection to Aristotle’s account of how we understand first principles and thus acquire wisdom. Aristotle replies that the idea of an infinite causal series is absurd, and thus there must be a first cause which is not itself caused. This idea is developed later in book Lambda, where he develops an argument for the existence of God. Book III or Beta lists the main problems or puzzles (Gr. ἀπορία, \"aporia\") of philosophy. Book IV or Gamma: Chapters 2 and 3 argue for its status as a subject in its own right. The rest is a defense of (a) what we now call the principle of contradiction, the principle that it is not possible for the same proposition to be (the case) and not to be (the case), and (b) what we now call the principle of excluded middle: tertium non datur - there cannot be an intermediary between contradictory statements. Book V or Delta (\"philosophical lexicon\") is a list of definitions of about fifty key terms such as cause, nature, one, and many. Book VI or Epsilon has two main concerns. Aristotle is first concerned with a hierarchy of the sciences. As we know, a science can be either productive, practical or theoretical. Because theoretical sciences study being or beings for their own sake—for example, Physics studies beings that can be moved (1025b27) -- and do not have an end (telos) beyond themselves, they are superior. The study of being qua being is superior out of all the theoretical sciences because it is concerned with that which is separate and immovable. The second concern of Epsilon is proving why accidents cannot be studied as a science. Accidents do not involve art (techne) and do not exist by necessity, and therefore do not deserve to be studied as a science. Aristotle dismisses the study of accidents a science fit for Sophists, a group whose philosophies (or lack thereof) he consistently rejects throughout the Metaphysics. The Middle Books are generally considered the core of the Metaphysics. Book Zeta begins with the remark that ‘Being’ has many senses. The purpose of philosophy is to understand being. The primary kind of being is what Aristotle calls substance. What substances are there, and are there any substances besides perceptible ones? Aristotle considers four candidates for substance: (i) the ‘essence’ or ‘what it was to be a thing’ (ii) the Platonic universal, (iii) the genus to which a substance belongs and (iv) the substratum or ‘matter’ which underlies all the properties of a thing. He dismisses the idea that matter can be substance, for if we eliminate everything that is a property from what can have the property, we are left with something that has no properties at all. Such 'ultimate matter' cannot be substance. Separability and 'this-ness' are fundamental to our concept of substance. Chapters 4-12 are devoted to Aristotle’s own theory that essence is the criterion of substantiality. The essence of something is what is included in a secundum se ('according to itself') account of a thing, i.e. which tells what a thing is by its very nature. You are not musical by your very nature. But you are a human by your very nature. Your essence is what is mentioned in the definition of you. Chapters 13-15 consider, and dismiss, the idea that substance is the universal or the genus, and are mostly an attack on the Platonic theory of Ideas. Aristotle argues that if genus and species are individual things, then different species of the same genus contain the genus as individual thing, which leads to absurdities. Moreover, individuals are incapable of definition. Chapter 17 takes an entirely fresh direction, which turns on the idea that substance is really a cause. Book Eta consists of a summary of what has been said so far (i.e., in Book Zeta) about substance, and adds a few further details regarding difference and unity. Theta sets out to define potentiality and actuality. Chapters 1-5 discuss potentiality. We learn that this term indicates the potential (dunamis) of something to change: potentiality is \"a principle of change in another thing or in the thing itself qua other\" (1046a9). In chapter 6 Aristotle turns to actuality. We can only know actuality through observation or \"analogy;\" thus \"as that which builds is to that which is capable of building, so is that which is awake to that which is asleep...or that which is separated from matter to matter itself\" (1048b1-4). Actuality is the completed state of something that had the potential to be completed. The relationship between actuality and potentiality can be thought of as the relationship between form and matter, but with the added aspect of time. Actuality and potentiality are diachronic (across time) distinctions, whereas form and matter are synchronic (at one time) distinctions. Book X or Iota: Discussion of unity, one and many, sameness and difference. Book XI or Kappa: Briefer versions of other chapters and of parts of the Physics. Book XII or Lambda: Further remarks on beings in general, first principles, and God or gods. This book includes Aristotle's famous description of the unmoved mover, \"the most divine of things observed by us\", as \"the thinking of thinking\". Books XIII & XIV, or Mu & Nu: Philosophy of mathematics, in particular how numbers exist."
}