{
    "book_id": "12835753",
    "mid": "/m/02x6xtn",
    "title": "Mistborn: The Well of Ascension",
    "author": "Brandon Sanderson",
    "publication_date": "2007-08-21",
    "genres": [
        "Speculative fiction",
        "Fantasy",
        "Fiction"
    ],
    "text": " The book begins with two armies laying siege to Luthadel - the army of Elend's father, Straff Venture and another one headed by Cett. Elend is now the King of Luthadel, with Vin as his girlfriend and the rest of the team as his close confidants. A short time later, a third army of koloss arrives, led by one of Elend's former friends, who is buying their obedience with counterfeit coins. Vin is starting to become suspicious of the mist, as they no longer make her feel as at home as they used to. At the same time, Sazed on his journeys has come across suspicious deaths which appear to be due to the mist. There is a lot of politicking during the middle part of the book, as Elend becomes a victim of the same laws he wrote as the Assembly has voted to depose him and elect a new king. The Assembly elects Lord Penrod as their new king, rejecting Elend. At the same time, Vin is going through a personal crisis due in large part to Zane, the son of Staff Venture and Elend's half brother, an apparently mentally ill Mistborn who is trying to seduce Vin and get her to go away with him. At the urging of Zane, Vin kills hundreds of Cett's soldiers at the mansion he was staying at in Luthadel, but stops short of killing Cett himself. Cett decides to leave the city and abandon his siege. Sazed and the rest of the crew scheme to get Elend and Vin out of the city, with Sazed creating a fake map to the Well of Ascension, where Vin is convinced she must go. Straff Venture withdraws his army and allows the koloss army to attack Luthadel, planning to rescue the city after the koloss have destroyed most of it and suffered casualties. Vin returns to Luthadel just in time to save Sazed. She also realizes that she is able to control the koloss using her allomancy, which is how the Lord Ruler kept them in check. She stops the slaughtering and pillaging that they were doing, and with the rest of the human army from Luthadel, attacks Straff Venture's army. Vin kills Straff and his generals as Cett decides to ally himself with Luthadel. Vin tells the armies that Elend is their new emperor, and Cett, Penrod and the last general of Straff's army can be kings under him. Vin realizes that the Well of Ascension is in Luthadel, and finds a hitherto unknown doorway in the Lord Ruler's former dwelling, that leads down to a series of caves. She finds the Well of Ascension, but is urged to \"release\" the power for the good of the world. She decides not to try to use the power to heal the dying Elend or fix anything else, but to release it. The moment she releases it, an entity shouts out that it is now free. Elend consumes a small piece of metal which makes him a Mistborn and he heals himself."
}