{
    "book_id": "3698358",
    "mid": "/m/09w07k",
    "title": "Mr. Monk Goes to the Firehouse",
    "author": "Lee Goldberg",
    "publication_date": "2006-01-03",
    "genres": [
        "Mystery"
    ],
    "text": " Adrian Monk and Natalie Teeger stop by the University of California to investigate an open-and-shut self-defense murder. Professor Jeremiah Cowan was giving a class when a gunman burst into the room and pointed a gun at him. Cowan shot the intruder before the intruder could get a shot. The shooter's name is Ford Oldman, who apparently made several threats at Cowan in the past. Monk explains to Captain Stottlemeyer and Lieutenant Disher how Cowan staged the scene, but before he can explain Cowan's motive, Natalie cuts him off, since the department hasn't paid Monk for his consulting. Later that day, Stottlemeyer calls Natalie to say that he has Monk's check at the station. Arriving at the station, they notice that the San Francisco Police Department is making large budget cuts. It starts when Disher asks if they can break a $20 so he can get a cup of coffee from the machine, which Monk isn't exactly willing to do. Stottlemeyer asks Monk to accompany him to the Conference of Metropolitan Homicide Detectives, which this year is being held in San Francisco. At the conference, Stottlemeyer reveals several things like Monk's high 120% clearance rate. Afterwards, the captain thinks that Paul Braddock, the moderator (and a detective from Banning, California), was simply asking questions that the other cops were thinking. He is humiliated, and states that Braddock used to work for the SFPD until Stottlemeyer threatened to expose his abusive methods to Internal Affairs. While having coffee with Natalie, Stottlemeyer asks her and Monk to come with him to Mill Valley, where he is planning on checking in on a police informant he once worked with. The man's name is Bill Peschel. They travel out later that day to meet Peschel, who lives with his daughter Carol, her husband Phil, and their two children. He motions them to sit down at his bar. It becomes clear that Peschel is diagnosed with dementia because he keeps thinking that he is running his bar. Keeping the part, Stottlemeyer acts like Monk is his rookie partner and they are seeking information. Peschel first starts by saying that Hy Conrad was in here bragging about a smash-and-grab, but then gets to the point when he tells them that a fancy lady came in asking someone to kill her rich husband and make it look like an accident. Leaving Peschel, Natalie is convinced that he is crazy and has Alzheimers, and additionally dementia, since he thinks that this is still the tavern he owned. Talking to Carol Atwater, Monk takes an obsession in the Diaper Genie diapers she uses. Carol mentions that most cops her father used to know now hang up on him when he calls in late at night with his tips. Peschel has also invested big in stock of InTouchSpace, a social networking site. When Monk and Natalie arrive at the police station the next day, Stottlemeyer explains that due to the budget issue, Monk's contract as a private consultant has been officially declared void. Natalie is infuriated, since she can't get paid unless Monk is paid. Disher walks in, informing them that Judge Clarence Stanton was just gunned down in Golden Gate Park. Hearing this, Monk prepares to go to the scene, even if no longer a consultant. Examining the area outside the crime tape, Monk finds several clues that tell them that the killer is a woman. Judging from the impression of the killer's bike, it has a different distance from the seat to the handlebars, and the frame's top tube is at an angle, consistent with that of a woman's bicycle. The treads also match those of female running shoes. Back at the apartment, Monk (desperate to use his Diaper Genies) \"accidentally\" creates several messes to prove that the Diaper Genies are great for trash bags. Natalie empties the Diaper Genie and walks back in to find Monk talking to the police hotline under assumed names with tips about Judge Stanton's shooting death. In the next morning's issue of the San Francisco Chronicle, the article about the shooting explains that Stanton was about to preside over the trial of Salvatore Lucarelli, the West Coast Godfather. Monk happens to open to an article about a hit-and-run and calls the police hotline anonymously again. This is too much for Natalie, who unplugs the phone suggesting Monk look through the Help Wanted ads. As Monk is about to consider becoming a taxicab driver, Stottlemeyer calls to tell Monk to stop sending in anonymous tips, since their caller ID systems traced the calls back to him. Just then, someone knocks at the door. The man's name is Nicholas Slade, and he is looking to hire Monk and Natalie at his private detective agency, Intertect. Slade explains how he used to be a vice detective on the force until ten years ago when he went private and started his agency. His agency is essentially a \"private eye\" in many ways. He was at the conference when he witnessed Monk's interview, knowing that Stottlemeyer was about to change the consulting agreement. Natalie goes down to the office to fill out paperwork and meets her new office assistant, Danielle Hossack. Danielle describes how wonderful Slade is, having made some strategic investments in the stock market and used the profits to start Intertect. She even describes the fact that her loyalty is as Slade has instructed her to both Monk and to Natalie. She is on their back and on call at any time. In short, Natalie is disturbed to find that she is effectively getting what she calls \"her own Natalie\", since after all Danielle's loyalty is to both of them, although Natalie is still loyal to Monk even though Intertect is now paying her. That afternoon, Monk is at work solving the open case files. He quickly proves a missing diamond case to be an inside job, and that a spy at a helicopter manufacturing company is using a wheelchair to smuggle secrets to the competition. Natalie also trades her Buick Lucerne for a Lexus company car. As part of their employment at Intertect, both Monk and Natalie have their own benefits. With regards to Monk, Intertect is now paying for his sessions with Dr. Bell. Natalie has a new company car and a new dental plan. When Natalie goes into work the next morning, Monk is still there, trying to solve the death of a man who has been stabbed in the chest. It's a six-month-old case involving Lou Wickersham, who was killed during a burglary. As Natalie informs Danielle that she can't be wheeling in case files to Monk like this, Danielle explains that the police have caught a break in the Stanton case. They are focusing on violent offenders Judge Stanton sent to prison and who have been recently released. They also pursuing a theory that Salvatore Lucarelli had him killed to avoid trial. Going back on the Wickersham case, Monk realizes that the circumstances around where Wickersham's body was found and the lack of defensive wounds don't add up. He realizes that it was a suicide, and explains that Wickersham ransacked his own house to hide the fact that he had sold his wife's jewelry and everything valuable to pay off loans. He only was able to buy some time. The best thing possible for him was to stage a home invasion, and stage his suicide as a murder to guarantee his wife a more comfortable life. As Danielle, Monk and Natalie try to debate how to find proof that Wickersham's death was a suicide, Natalie receives a call from Slade. Another judge, Alan Carnegie, has been shot dead and the new client has asked specifically for Monk. The name of this client is Salvatore Lucarelli. Although Natalie says that he would never do that, Slade says that Lucarelli and Monk have met. As they are driving towards the jail, Monk explains to Natalie the events of his encounter with Salvatore Lucarelli in the season 3 episode \"Mr. Monk Meets the Godfather\". A man named Phil Bedard (who was played in the episode by Devon Gummersall), who worked for the US Mint, walked into a barbershop that was a front for Lucarelli's gambling and protection racket. He had stolen some money from his employers, and hidden it in the gumball machine at the shop. When the barbershop client tried to intervene as Bedard attempted to retrieve the pennies, Bedard grabbed his gun and fired like a maniac, killing everyone in the room in what was known as the Barbershop Massacre. Lucarelli and his men wanted revenge, but as he didn't want to spark a mob war, he pressed Monk and his first assistant Sharona Fleming to clear his name. Monk only took the job because the FBI and ATF saw an opportunity to get a man on the inside. Although Lucarelli was cleared of any charges, the feds were angry at Monk because he washed and ironed his wired tie, ruining it. Now, with Stanton dead, Carnegie was to be the next in line to preside over Lucarelli's trial. Carnegie was shot while walking his dog. In the interview, Lucarelli says that he only kills lobsters at his restaurant, just like before in the episode. When Monk and Natalie arrive at the scene of Judge Carnegie's murder, they find Stottlemeyer and Disher there. At first, Stottlemeyer does not understand what Monk is doing looking at the body, since as Monk is no longer working for the SFPD, he shouldn't be crossing the police line. Natalie tries explaining otherwise, when Slade arrives. Slade suggests that Stottlemeyer reconsider his decision about not joining Intertect, and even tells him that Lucarelli had Monk come out to help. He even says that Monk, Natalie and Stottlemeyer would make a great team (which Natalie refers to as the Odd Squad). Disher points Monk over to Carnegie's house. No one heard any screams or cars screeching away, which allows Monk to close up the murders of Judges Stanton and Carnegie. At Carnegie's house, Monk explains to Alan's widow Rhonda that her husband was the alternate to hear the case against Salvatore Lucarelli should something happen to Stanton. She wanted her husband's murder to look like a mob hit. It is the fact that the Carnegies' dog only barks to strangers that pointed Monk to the widow: If Alan Carnegie was shot dead by a stranger, why didn't the dog bark madly at the shooter? The answer can be that Rhonda, who is not a stranger to the dog, shot him. After Disher arrests Rhonda Carnegie for the murders, Stottlemeyer thanks Monk for just happening to show up, since otherwise he would have exhausted himself for weeks trying to track down every connection to Lucarelli. Unfortunately, they can't rehire Monk as a consultant. As soon as Stottlemeyer finishes thanking Monk, Carol Atwater calls the captain to say that Bill Peschel is dead. She had left her father to drop off her son at school and drop off her daughter at a pediatrician's appointment. Peschel apparently had jumped into the pool and banged his head badly. But Monk starts to think otherwise at the crime scene. Natalie ditches Monk at Dr. Bell's office. That night, Monk calls Julie to deliver some files to his apartment. Natalie convinces her not to. When the papers the next morning show the article about Rhonda Carnegie's arrest, Natalie finds it too painful to read all the way through, although she is pleased at the way Slade has twisted the article to improve Intertect's reputation. Walking in the door, she finds Monk reviewing more case files. Monk just says that he thought Natalie went on vacation, a not-so-smart remark considering how everywhere Natalie goes, Monk goes, and murder follows them (as the novels Mr. Monk Goes to Hawaii, Mr. Monk Goes to Germany and Mr. Monk is Miserable demonstrate). When the phone rings, Natalie half expects it to be Slade calling with another case. Rather, it is Carol Atwater. At the crime scene, Monk and Natalie encounter Carol, Stottlemeyer, Slade and Paul Braddock, the moderator from the conference. Natalie finds it odd that Carol married someone with a name similar to her father (Bill being short for William, and Phil being short for Phillip) and asks Monk about it. Carol comes over, explaining that Braddock and Slade happened to know her father in the 1990s. Stottlemeyer and Braddock's conversation, pleasant to start off, transitions into a brawl when Braddock attacks the captain. Slade prevents Stottlemeyer from taking the fight too far. Afterwards, Monk observes grass stains on the captain's pants. He remembers how Peschel's socks were clean and white, meaning he couldn't have walked across the grass. Monk has Natalie stand on the plastic chair that Peschel allegedly stood on. When she does, the legs of the chair sink into the grass under her weight. The chair Peschel stood on didn't sink its legs into the ground, even when he was twice Natalie's weight. Slade uses this claim to snag himself another client. They suspect that someone Peschel sent to prison with his tips got released and exacted revenge. Meanwhile, Stottlemeyer figures that his career is at risk, since Braddock will probably go back to the convention and he will have to explain his injuries, and he might also twist the story to make Stottlemeyer look like a raging psychopath. Monk calls up Danielle to ask her to do some research into Peschel's career. She says that he was an early investor into InTouchSpace, the social networking site. Natalie explains to Monk that InTouchSpace works like Facebook and MySpace in that you can communicate with other people without leaving the comfort of your house, and that she, Julie, and Adrian's agoraphobic brother Ambrose use it. Since Danielle doesn't call back, they take the afternoon off. Natalie drops Monk off at Dr. Bell's place and runs several errands while Monk squeezes in his sessions. Of course, Dr. Bell isn't entirely happy about Monk trying to squeeze in five-minute sessions between his other patients, and suggests to Natalie that she get Danielle to find more open cases for Monk to work on. The next morning, Dr. Bell's hunch comes true when Natalie finds Monk with a cartload of cases that an Intertect employee gave to him. Infuriated, she confronts Danielle, but Danielle claims innocence and says that only one person has the authority to send these files over. Natalie confronts Slade that what he is doing to Monk is much like killing the goose that laid the golden egg – giving him too much work. Returning to Danielle (whom Natalie claims is working not for her but for Slade), Danielle states that Mill Valley's police have confirmed Monk's finds. From when Danielle tells Natalie that the death of Bill Peschel has been confirmed by police as a homicide up until Stottlemeyer is arrested, the novel continues to follow Natalie and Monk with Natalie narrating, but also follows a third-person narrated subplot that pursues Lieutenant Disher. Randy has given himself the nickname Bullitt, after the film starring Steve McQueen. He has started calling Jack Lansdale, a new transfer into the homicide division, \"Jackal\". Stottlemeyer calls to Randy from his office. The captain's mood has been getting much worse since the reduced operating budget and the conference. Now, Slade has grabbed all of the glory for Rhonda Carnagie's arrest and humiliated the department, and Randy has heard about how Stottlemeyer attacked Braddock. The captain tells Randy that he has a new homicide to investigate that will test his ability to lead: it's Braddock himself. He was found dead in his hotel room this morning. As Disher and Lansdale drive towards the crime scene, Disher reviews the instances of abuse and statements from Braddock's victims. Reading the files causes Disher's nausea to reach a point that he vomits into the street in front of a Japanese tour group. Examining the crime scene, the medical examiner tells Disher that Braddock died of strangulation. Lansdale is a little curious when Disher tells Dr. Hetzer to look for traces of the comforter. Disher explains that things look as though Braddock was being strangled but fought back. The killer then pushed Braddock onto the bed and suffocated him. At the hotel where Braddock was murdered, Disher has found no surveillance footage of the killer. He stops by Stottlemeyer's office to ask him exactly why the file says he was at the Dorchester Hotel the night before. Stottlemeyer explains that he was there at 9:30 PM because a cop said that Braddock was taking bribes from gang members running meth labs from their mobile homes in the desert. The cop never showed up. Disher explains that Braddock died around 10:00 PM, and whoever did it also turned up the air conditioning to prevent anyone from knowing the exact time of death. In the meanwhile, Monk has been going through the new case files when Danielle shows up with background information about Bill Peschel. Monk was right in that Carol and Phil Atwater aren't a prosperous upper-middle-class family. Phil apparently lost his job months ago - he leaves the house each morning with a jacket and a tie but sits in a chair at a Barnes & Noble doing crossword puzzles. It seems possible that Carol and her husband planned the murder of her father. By posing as an obituary writer, Danielle has gotten more information from Carol about her father's early life. He took over the tavern in 1970, and became respected within the police department when he gave them tips to track the people who killed his friend. Natalie picks Monk up as they head to the Barnes & Noble where Phil Atwater is sitting during the day. Phil is just about to leave when Natalie informs him that they know he was fired months ago. It is possible that he murdered his father-in-law for the money, but he quickly is proven to have not been involved. However, he is guilty of shoplifting. Monk has observed Phil removing many of the anti-theft devices on a Murder, She Wrote novel. Phil may not be the killer, but he does provide a rather important tip: ten years ago, Peschel made a lot of money through investment in InTouchSpace. Disher finds a file from Forensics on his desk that morning. Polyester found on Braddock's neck has been traced back to the Continental, a type of tie sold at Walmart stores. Disher remembers seeing that tie before somewhere. Feeling nauseous, Disher tells Lansdale to round up several officers and head to Stottlemeyer's apartment to wait for Disher to bring a search warrant. As Lansdale and his team search Stottlemeyer's apartment, Disher sits wracked with the guilt of betraying his friend and mentor. A detective from Wichita staying in the room next to Braddock's recalls hearing someone enter the room and break a glass. The tie found in the trash at the captain's apartment matches the fibers at the crime scene. Stottlemeyer still states that he never killed Braddock even with a motive. However, it's the captain's fingerprints that are on the glass, and so Disher arrests Stottlemeyer. Meanwhile, Monk and Natalie are pursuing the mystery of Steve Wurzel. He was motorcycling from San Francisco to Mendocino in the fog, but he never arrived in Mendocino. He went missing on the coastal road. Natalie finds several strange clues like Wurzel buying Peschel's business and both investing in InTouchSpace. It's clear that Monk is suffering from case overload. As they drive along, Natalie calls Danielle asking to arrange an appointment with Linda Wurzel. Back at the apartment, Monk finishes his Intertect cases while Natalie hones her detective skills by reading Murder, She Wrote. The captain calls asking them to come to the jail. At first, they think that Lucarelli asked for them, so they are shocked to see Stottlemeyer in a jumpsuit. Stottlemeyer explains his situation, asking for Monk to clear his name. At police headquarters, Randy has been promoted to Acting Captain and has moved into Stottlemeyer's office. Natalie is tempted to slap him, although Disher says he was following the evidence and hopes to clear the captain's name. He tells them that they are not allowed to look at the Braddock file, but Monk and Natalie immediately head to the scene of the crime. At the hotel, Monk immediately proves that Stottlemeyer is innocent. There are four identical drinking glasses in the room, but in the crime scene photos, there are five. The fifth glass, the one Stottlemeyer's fingerprints were on, was obviously planted there later. As they leave the hotel, they run into Slade in the lobby. Slade says they need to talk about how with the way Monk is working, he is eventually going to destroy himself. Back at the jail, Stottlemeyer suggests that they look at Braddock's arrest records. He tells Monk and Natalie that a closer look at some of these arrests will bring up note that they came with the help of a confidential informant. Natalie calls Danielle and has her meet them at Monk's apartment. When Danielle enters (and Monk spends 30 minutes washing his hands), Natalie tells Danielle that she has realized how Slade has been using the GPS systems to track her and Monk around on their cases. But Danielle also has the information they need on Linda Wurzel and Dalberg Enterprises. Linda Wurzel is Dalberg Enterprises - Dalberg being her maiden name. She has an office downtown and an estate in Sea Cliff, and three days a week has a standing appointment at JoAnne's beauty salon. They meet Wurzel, but after Monk freaks out about the skin cell eating fish, he and Natalie explain how Braddock's murder and Peschel's murder might be connected. The use of these creatures to eat dead skin cells is too much for Monk, who borrows Natalie's cell phone and places a call. Soon, the Department of Homeland Security arrives, and Monk solves the case. However, in a most unusual way, it turns out that Natalie has also solved the case - all she has been in need of is for Monk to tighten all the loose ends. Peschel sold his business ten years ago, around the same time that Steve Wurzel vanished on the road. Linda Wurzel was their connection. At that same time, Slade quit the SFPD, and started Intertect by using the money of his InTouchSpace investment. Monk also remembers that on the day that he and Natalie first became private eyes at Intertect, Danielle told them how Slade used his investment money to start the company. It is here that Monk is on the same page as Natalie: Slade killed Steve Wurzel, Bill Peschel, and Paul Braddock. Monk remembers how Peschel told them, and infers that he probably also told Braddock. It proves that Slade killed both of them and framed Stottlemeyer for Braddock's murder. As they already know, Peschel worked a tavern in the Tenderloin for several years. He was a confidential informant who sold tips to Paul Braddock (who was working with the SFPD then), Nicholas Slade and Leland Stottlemeyer. Ten years ago, he sold his place to Linda Wurzel and retired with an InTouchSpace stock investment. Natalie remembers how when she, Stottlemeyer and Monk went to see Peschel, he was living in his daughter's house and diagnosed with dementia. He thought he was still running his tavern, and that Stottlemeyer and Monk were cops who had come to him seeking information. She also remembers Peschel mentioning something about a smash-and-grab and about a rich woman who came in to hire a hit man to kill her husband and make it look like an accident, and she realizes who exactly he was talking about: he was talking about Linda Wurzel. In 1998, Linda Wurzel went to Bill's Tavern, seeking a hit man to kill her husband. She probably figured that she would increase her odds of getting someone at the tavern. Peschel gave the tip to Slade. Slade, who was still a detective with the police department, posed as a hit man and met her. But instead of arresting her, he realized that this was too good a tip to pass up. He ran Steve Wurzel off the road somewhere between San Francisco and Mendocino. His body drifted out to sea and was never found. Whether or not Peschel helped him, they both got paid. Linda Wurzel bought Peschel's bar and gave both of them InTouchSpace stock. Slade used the investment to start Intertect. Everyone was happy, that is until Peschel became senile and started calling his police friends with ten year old tips. Slade could not take the risk that Stottlemeyer or Braddock would piece together what Peschel was telling them. He realized that they had seen too much, so he had to silence them by any means possible. Taking care of Peschel was the easiest part, but then Slade had to get Stottlemeyer and Braddock out of the way. He was incredibly worried, until he saw Braddock humiliate the captain at the conference. He stole Stottlemeyer's glass, being careful not to put his own fingerprints on the glass. Slade's luck improved when Monk got fired and Braddock attacked Stottlemeyer at Peschel's wake. Knowing how well Monk could break cases without even looking at them, Slade hired him and Natalie and set them to work. He was trying to keep them busy and prevent them from knowing what was going on. Just before meeting Monk, Natalie and Stottlemeyer at the Alan Carnegie murder scene, Slade killed Peschel. He killed him in the house, and threw his body in the pool, and staged the scene to make it look like an accident. Braddock was the next on Slade's list of people to be eliminated. The night after Stottlemeyer attacked Braddock at the wake, Slade dressed himself in a beefeater suit, and took the elevator up to the seventh floor. Intertect was the company responsible for security, so people naturally thought that he could have been there for some other matter. He brought with him the glass carrying Stottlemeyer's fingerprints, and a tie of the same type and color as the captain's. He entered Braddock's room, talked with Braddock for a few minutes, and then strangled him with the Continental tie. Braddock, however, fought back, and Slade suffocated him on the bed. The sounds that the Wichita detective was hearing from his room were the sounds of the struggle behind the wall. Slade planted the glass at the crime scene to frame Stottlemeyer. He knew very well that the Captain had thrown out his previous tie earlier that afternoon after Braddock had attacked him - he knew that the blood on the tie would match 100% and that the fibers would match as well. He knew very well that Stottlemeyer would have an obvious motive, and even lured him to the hotel by faking the phone call, that way, the Captain would have an alibi for the time of the murder. No one in the department, not even Disher, would suspect Slade as being involved. Monk realizes however that they cannot prove any of this. Natalie realizes that either Linda Wurzel will talk to Slade and say they met her, or that Slade is tracking them. Natalie explains how she discovered the tracking devices in the GPS and the keylogger programs of their computers, and the possibility that the phones have wiretaps placed on them. Not wanting Slade to know where they have been, Monk tells Natalie to call Julie and have her meet them at his apartment. He instructs Julie to drive the Lexus across town so that Slade will be distracted. In the meanwhile, Monk and Natalie will switch out the Lexus for Natalie's own car. He also has Danielle meet them in her own car. Monk, Natalie and Danielle make their way to Linda Wurzel's street for what will be Danielle's first stakeout. Shortly after they park, Wurzel arrives. During the stakeout, Natalie turns her attention to the Braddock case. It's clear that Slade was the guy in the beefeater suit on the elevator tape, but it doesn't prove he was at the hotel at the same time that Stottlemeyer was. After all, Slade could have created a false pretense as to why he was at the hotel that night, since Intertect is responsible for the hotel's security, and he could have erased himself from the tapes. When Wurzel pulls out heading towards Danielle's car, Natalie gives her a call. They follow Wurzel across town to Mission Bay and an abandoned warehouse. Parking a short distance away, Monk and Natalie sneak into the warehouse, Natalie muting her cell phone and setting it on speed dial so that they won't be seen. They observe Wurzel talking to Slade. When Slade pulls a gun with a silencer, Monk steps out to confront him. Slade asks them who is driving his Lexus all over Berkeley, which causes Natalie to forget about the case and ask herself what Julie is doing that far away in the middle of the night. Monk explains to Slade that killing Steve Wurzel was his undoing. He was the only person who attended the conference who knew Peschel, Braddock and Stottlemeyer. Slade turns his gun at them and is about to shoot when Danielle leaps from a pile of bricks and knocks the gun out of his hand. Natalie snatches up the gun, aiming it at Slade, who now threatens to break Danielle's neck. Slade taunts Natalie, saying that she can't shoot a gun, although Natalie has been trained in firearms and met Monk after she killed an intruder in her house. Slade releases Danielle just as Disher and the police arrive to arrest him and Wurzel for their crimes. Disher congratulates Monk for his work and clearing Stottlemeyer's name. The open 9-1-1 call is as good as any confession. Monk disinfects the Captain's office before it is put to use. Stottlemeyer is exonerated and goes back at work. He is constantly repeating some of the things Natalie said on the open 9-1-1 call, and says that she'll be soon called \"Dirty Natalie\". He accepts Disher's apologies, but tells him that he was just doing his job. Later, Stottlemeyer shows up later at Monk's apartment to officially say that Monk is back on their payroll as a consultant. He got the chief to reconsider by using political blackmail, threatening to explain his story to the TV stations if Monk wasn't rehired and the old budget brought back. With regards to the trial, Slade happened to be wearing a wire when he met Linda, and he has kept a recording of their conversation ever since for insurance. Monk prepares to return to being a consultant to the San Francisco Police Department, the position he really belongs in."
}