{
    "book_id": "12664525",
    "mid": "/m/02w_lbn",
    "title": "My Boring Ass Life: The Uncomfortably Candid Diary of Kevin Smith",
    "author": "Kevin Smith",
    "publication_date": "2007-09-25",
    "genres": [
        "Comic novel",
        "Personal journal"
    ],
    "text": " The title is a reference to Smith's blog My Boring Ass Life. The book's content is from entries Smith has written about on said blog, from mundane daily activities to a series of writings detailing his friend and frequent featured actor Jason Mewes' heroin addiction. Smith also chronicles the making of and release of his seventh film Clerks II and describes the filming of his acting roles in Catch and Release and Live Free or Die Hard. Smith talks about his several encounters with many Hollywood stars, both old and upcoming. Once, during his daughter Harley's elementary school Fairy Tale Breakfast party, he ran into Johnny Depp, still wearing part of his Jack Sparrow makeup, who was in-between filming the Pirates of the Caribbean sequels. He also recollects on the time in which he met Burt Reynolds after \"stealing\" his donuts. An unlikely meeting with Bruce Willis resulted in Smith getting a major supporting part in Willis' film Live Free or Die Hard. In addition, he mentions a humorous encounter Mewes had at a club during the shoot of Jay and Silent Bob Strike Back with Leonardo DiCaprio and Tobey Maguire, who had recently been cast as Spider-Man. After realizing it has been seven years to the day they \"did it\", Smith recounts how he first met his wife, Jennifer Schwalbach Smith. During the promotional tour for his 1999 film Dogma, he was interviewed by Schwalbach (\"Jen\"), then a reporter for USA Today at the Independent Spirit Awards. Having half a day to kill before he had to go home, they dined on pizza breadsticks before he left for his flight back to New Jersey. A few months later, he met her again, had a few drinks, and they went back to her apartment where they made love for the first time. At this point, Smith stops and writes, \"The rest can be seen in An Evening With Kevin Smith,\" in which he recounts how he was injured in the act of love-making. Lasting about nine pages, Smith talks about how he intended to have a much more elaborate opening prologue/credits scene for his sophomore film Mallrats. In this, Jeremy London's character, T.S Quint, goes on a game show and loses after flubbing an answer and inadvertently giving the other team the answer. An altercation with the team ensues, and he accidentally punches the show's host after the team captain ducks his head. According to Smith, the studio felt it was too long, ordered it to be cut, and replaced it with a smaller scene taking place at a party instead. However, that scene was later scrapped during post-production. Due to this setback, as well as some other scenes, including a Silent Bob masturbation joke, he was forced to excise from the script, he feels this hurt the movie's chances for a bigger box office reception. As in Evening With Kevin Smith, he revealed that while he removed the masturbation scene, a similar scene took place in a film released four years later: There's Something About Mary. Of all the entries in the book, this section is the longest and probably most serious subject that Smith deals with: his friendship of Jason Mewes and the latter's massive drug addiction. It starts off with detailing Mewes' troubled childhood and upbringing. His mother was a drug addict, and he never learned the identity of his father, who took off shortly after his birth. Whenever selling drugs to support him and his sister, his mother would send an oblivious nine-year old Jason on his bicycle to deliver the goods to customers with strict instructions not to look in the bag. As a high school freshman, he met the nearly-four years older Smith, who was working at RST Video and the Quick Stop. Despite hearing the many rumors about the supposedly bad-boy Mewes, which were mostly fictional, he inadvertently became Mewes' surrogate older brother. Although unsure about letting the younger Mewes hang out with him and Walt Flanagan, Smith was won over by the kid's love of comics and his offbeat, crazy sense of humor. During his recount of making Clerks, it is revealed that he had to talk the reluctant Jason, working in construction at that time, into playing Jay. Smith says that he only drank during this time period. When they were given the go-ahead to make Mallrats, Mewes had to re-audition for the part against favorites Breckin Meyer and Seth Green to convince studio executives he was right for it, because they were concerned over his new heroin addiction. Eventually, they caved in and allowed Mewes to reprise the role, but Smith was forced to fly him out to the location at his own expense with the threat that Green would replace him should anything bad occur. During Chasing Amy, Dogma, and Jay and Silent Bob Strike Back, Mewes goes from drug-addicted to sober for varying lengths of time. Being oblivious to the symptoms of drug use, Smith noticed his drowsy, narcoleptic-like behaviour during the recording of the DVD commentary for Chasing Amy. After much denial, Mewes admitted he used heroin and marijuana during the Mallrats shoot and cocaine during his diner scene. Realizing he needed help, Smith moved him out of his mother's house and into his apartment with the promise of another Jay and Silent Bob film and to get him clean. For nearly two years, he helped Mewes take his mind off drugs while preparing for Dogma. While shooting the film, Smith was amazed when Jason claimed to have memorized the script and was at the top of his game, especially during scenes with Alan Rickman, but he was oblivious that Mewes had begun using Oxycotin with his new girlfriend, Stephanie. With Mewes earning the money, she would be getting him the drugs he needed. It was also during this time that Mewes' mother developed AIDS. Following Smith's marriage, he moved in with them prior to their daughter Harley's birth, because Kevin felt that his mother was the worst influence. Tensions erupted between them after he discovered a drug dealer was wanting Mewes to pay up on a sale, and it did not help matters when he found out his friend caused a car crash involving a police officer. While the officer accepted payment for the damage done, Smith and Mewes were forced to abandon their car to the car market. As for the dealer, Mewes agreed to be involved as a witness in a sting operation to arrest the dealer, but his relationship with Stephanie failed as a result. Another woman named Jamie, whom he was briefly engaged to, soon left him after getting fed up with his drug habits. After another period of rehab, Smith finally learned that Mewes was using again after his friend stole his credit card in an attempt to buy drugs. Then, he caused a panic on an airplane just before landing. The last straw came when he kept disappearing to shoot up while playing with Harley. His wife ordered him to make Mewes leave the house, to which he reluctantly did. After a brief stint in rehab, funded by Ben Affleck, he was almost forced to leave after raising hell. After a tense phone conversation with Smith, Mewes escaped from the clinic before being caught again. Showing the tough love technique, Smith made it clear that he could not come near him or his family anymore until he got clean. As a result, he started living with his girlfriend in Los Angeles. By this point, his mother had also died, and he could not come back to New Jersey due to the bench warrant for possessing heroin and syringes in his girlfriend's car during a routine police search. He had to appear in court as part of the sentencing, but he strangely failed to show up. Originally, Smith had written the Jason Biggs role in Jersey Girl for Mewes, but he could not accept it. Upon getting a scare after a rumor spread about his death, he finally went back to Jersey and surrendered to the police. Given the choice of six months of rehab or jail, Mewes chose to go to rehab, and he has been clean of drugs ever since. Hence the plot point of Jay and Silent Bob's rehabilitation in Clerks II. As in the documentary found on the Clerks II DVD, Smith recounts the process of the film (his \"first\" true sequel) being made. Several facts are included: the original 1999 script had Dante and Randal working at a Boardwalk Waterfront Pier, how Matt Damon was supposed to appear in Jason Lee's cameo, and convincing original Clerks stars Brian O'Halloran and Jeff Anderson to come back. While O'Halloran was eager to reprise Dante ten years down the road, Anderson was the most difficult to convince to return, but he finally agreed to appear in the film. In addition, Smith details Mewes' embarrassment and reluctance to do a parody of the infamous Buffalo Bill nude-dance scene. Smith writes about the reaction Clerks II got from critics, particularly Joel Siegel. About forty minutes into the film, specifically the scene where Randal orders a donkey show as a going-away present for Dante's bachelor party, Siegel exited the theater rather loudly, allegedly shouting \"Time to go! This is the first movie I've walked out on in thirty fucking years!\" Despite this incident, Smith felt that \"if you can send Joel Siegel screaming from your movie, you've got something good on your hands,\" because getting a bad review from Siegel (according to Smith, after the review called it \"Jerks II\") is like \"a badge of honor.\" However, he admits that he was not hurt by the critic's trashing of the film, but rather the manner in which he left it. He states that had Siegel not left the film, the actual donkey show would have been revealed and been funnier. After mentioning his confrontation with the so-called \"cum catcher\" (in reference to his prominent mustache) on The Opie and Anthony Show, he says he has no animosity towards the critic, but that one should never walk out on a film and ruin it for others. For the next few entries of his diary, he reveals that Clerks II made over thirty million dollars at the domestic box office."
}