{
    "book_id": "18692875",
    "mid": "/m/04gh7ct",
    "title": "My Grandfather's Son: A Memoir",
    "author": "Clarence Thomas",
    "publication_date": "2007-10-01",
    "genres": [
        "Memoir"
    ],
    "text": " Thomas describes his life chronologically in My Grandfather's Son. The early parts of the book are dominated by the impact his grandfather had on him, while sections describing his adulthood up to his Supreme Court appointment focus on overcoming personal demons without describing too much about his career. Following his confirmation to the Court, Thomas centers his writing on professional, ideological and judicial issues. The themes of race and self reliance run throughout, and many issues are framed through one or both of those lenses. My Grandfather's Son begins with Thomas's birth, in rural Georgia in 1948, to Leola Anderson, a maid who earned $10 a week. Thomas's father abandoned the family when Thomas was a toddler. In first grade his mother sent him and his brother to live with his maternal grandfather, Myers Anderson, and his wife in Savannah. He attended all black schools until the 10th grade, when Anderson paid for Thomas to attend a Catholic boarding school. Thomas, who had been an altar boy throughout his childhood, wanted to be a priest and was one of only two black students at the school. Upon graduating, he began studying to be a priest, but gave up at the age of 19 because he was disappointed with the church's stance on racism. As a result of Thomas dropping out of school, his grandfather kicked him from the house. Thomas moved to Massachusetts to attend The College of the Holy Cross. One of his reasons for moving was the racism he had encountered as a child, and his belief that in the North he would be freed from that. Once there, he found Massachusetts to be plagued with latent racism and far from the utopia he had anticipated. Thomas excelled academically and socially at Holy Cross, graduating with honors and marrying his long term girlfriend Kathy Ambush shortly after. He also began drinking steadily, a problem that would haunt him in later years. Thomas attended Yale Law School, graduating in 1974. After Yale, Thomas took a job as an assistant district attorney under John Danforth, then Missouri's Attorney General. My Grandfather's Son continues to follow Thomas's career, including a stint at the legal department of Monsanto Company and his 1979 move to Washington, D.C. to work for then-Senator Danforth. Throughout this period Thomas made an intellectual journey from libertarian to conservative, culminating in changing his party registration to Republican in 1980. In 1981 he joined the Reagan Administration's Department of Education as its Assistant Secretary of Education for the Office of Civil Rights, and in 1982 he was promoted to head of the Equal Employment Opportunity Commission. The main focus, however, is on Thomas's financial and emotional struggles. Although he says he was never an alcoholic, Thomas says that in the late 1970s and early 1980s his drinking became worse, and that he often drank while home alone. These confessions were the first time there had been any public suggestion that Thomas was a heavy drinker. Burdened by student loans and subsisting on low government salaries, Thomas had a difficult time financially, almost getting evicted from his apartment several times. In one incident, a car rental agent cut up Thomas's credit card in front of him. After falling out of love with his first wife, Thomas worried about the morality of leaving her and his child. Throughout most of this period Thomas was still estranged from his grandfather, and describes being haunted by the memory of Anderson kicking him out of the house. The two reunited briefly in 1983 when his step-grandmother was in the hospital, having a meaningful conversation and embracing at the end. The new found closeness was short-lived, and Anderson died the next month of a stroke before Thomas had another chance to see him. Around this point, Thomas describes himself regaining control of his life. In 1983 he quit drinking cold-turkey. Approximately a third of My Grandfather's Son is spent discussing Thomas's nomination and confirmation to the Supreme Court. My Grandfather's Son goes through the hearings day by day, with Thomas defending himself against his accusers and criticizing their motives. Thomas says he learned of the accusations of sexual harassment by Hill over the weekend after the first five days of the hearings when a pair of FBI agents visited his home."
}