{
    "book_id": "1529691",
    "mid": "/m/058ckf",
    "title": "My Inventions: The Autobiography of Nikola Tesla",
    "author": "Ben Johnston",
    "publication_date": "1919",
    "genres": [
        "Autobiography"
    ],
    "text": " Tesla's personal account is divided into six chapters covering different periods of his life. \"The progressive development of man is vitally dependent on invention. It is the most important product of his creative brain. Its ultimate purpose is the complete mastery of mind over the material world, the harnessing of the forces of nature to human needs. This is the difficult task of the inventor who is often misunderstood and unrewarded. But he finds ample compensation in the pleasing exercises of his powers and in the knowledge of being one of that exceptionally privileged class without whom the race would have long ago perished in the bitter struggle against pitiless elements. . . .\" From childhood I was compelled to concentrate attention upon myself. This caused me much suffering but, to my present view, it was a blessing in disguise for it has taught me to appreciate the inestimable value of introspection in the preservation of life, as well as a means of achievement. The pressure of occupation and the incessant stream of impressions pouring into our consciousness thru all the gateways of knowledge make modern existence hazardous in many ways. Most persons are so absorbed in the contemplation of the outside world that they are wholly oblivious to what is passing on within themselves. In attacking the problem again I almost regretted that the struggle was soon to end. I had so much energy to spare. When I undertook the task it was not with a resolve such as men often make. With me it was a sacred vow, a question of life and death. I knew that I would perish if I failed. Now I felt that the battle was won. Back in the deep recesses of the brain was the solution, but I could not yet give it outward expression. One afternoon, which is ever present in my recollection, I was enjoying a walk with my friend in the City Park and reciting poetry. At that age I knew entire books by heart, word for word. One of these was Goethe's \"Faust.\" The sun was just setting and reminded me of the glorious passage: \"Sie rückt und weicht, der Tag ist überlebt, Dort eilt sie hin und fordert neues Leben. Oh, dass kein Flügel mich vom Boden hebt Ihr nach und immer nach zu streben! Ein schöner Traum indessen sie entweicht, Ach, zu des Geistes Flügeln wird so leicht Kein körperlicher Flügel sich gesellen!\" \"She moves and yields, the day of toil now done, there she hurries and explores new fields of life. Ah, that no wing can lift me from the ground to closely follow her and soar! A beautiful dream! Though now the glories fade. Alas, the wings which lift the mind so lightly can find no bodily counterpart!\" As I uttered these inspiring words the idea came like a flash of lightning and in an instant the truth was revealed. I drew with a stick on the sand the diagrams shown six years later in my address before the American Institute of Electrical Engineers, and my companion understood them perfectly. The images I saw were wonderfully sharp and clear and had the solidity of metal and stone, so much so that I told him: \"See my motor here; watch me reverse it.\" I cannot begin to describe my emotions. Pygmalion seeing his statue come to life could not have been more deeply moved. A thousand secrets of nature which I might have stumbled upon accidentally I would have given for that one which I had wrested from her against all odds and at the peril of my existence. At the close of 1889, however, my services in Pittsburg being no longer essential, I returned to New York and resumed experimental work in a laboratory on Grand Street, where I began immediately the design of high frequency machines. The problems of construction in this unexplored field were novel and quite peculiar and I encountered many difficulties. I rejected the inductor type, fearing that it might not yield perfect sine waves which were so important to resonant action. Had it not been for this I could have saved myself a great deal of labor. Another discouraging feature of the high frequency alternator seemed to be the inconstancy of speed which threatened to impose serious limitations to its use. I had already noted in my demonstrations before the American Institution of Electrical Engineers that several times the tune was lost, necessitating readjustment, and did not yet foresee, what I discovered long afterwards, a means of operating a machine of this kind at a speed constant to such a degree as not to vary more than a small fraction of one revolution between the extremes of load. From many other considerations it appeared desirable to invent a simpler device for the production of electric oscillations. In 1856 Lord Kelvin had exposed the theory of the condenser discharge, but no practical application of that important knowledge was made. I saw the possibilities and undertook the development of induction apparatus on this principle. My progress was so rapid as to enable me to exhibit at my lecture in 1891 a coil giving sparks of five inches. On that occasion I frankly told the engineers of a defect involved in the transformation by the new method, namely, the loss in the spark gap. Subsequent investigation showed that no matter what medium is employed, be it air, hydrogen, mercury vapor, oil or a stream of electrons, the efficiency is the same. It is a law very much like that governing the conversion of mechanical energy. We may drop a weight from a certain height vertically down or carry it to the lower level along any devious path, it is immaterial insofar as the amount of work is concerned. Fortunately however, this drawback is not fatal as by proper proportioning of the resonant circuits an efficiency of 85 per cent is attainable. Since my early announcement of the invention it has come into universal use and wrought a revolution in many departments. But a still greater future awaits it. When in 1900 I obtained powerful discharges of 100 feet and flashed a current around the globe, I was reminded of the first tiny spark I observed in my Grand Street laboratory and was thrilled by sensations akin to those I felt when I discovered the rotating magnetic field. \"I have been asked by the ELECTRICAL EXPERIMENTER to be quite explicit on this subject so that my young friends among the readers of the magazine will clearly understand the construction and operation of my \"Magnifying Transmitter\" and the purposes for which it is intended. Well, then, in the first place, it is a resonant transformer with a secondary in which the parts, charged to a high potential, are of considerable area and arranged in space along ideal enveloping surfaces of very large radii of curvature, and at proper distances from one another thereby insuring a small electric surface density everywhere so that no leak can occur even if the conductor is bare. It is suitable for any frequency, from a few to many thousands of cycles per second, and can be used in the production of currents of tremendous volume and moderate pressure, or of smaller amperage and immense electromotive force. The maximum electric tension is merely dependent on the curvature of the surfaces on which the charged elements are situated and the area of the latter. \"Judging from my past experience, as much as 100,000,000 volts are perfectly practicable. On the other hand currents of many thousands of amperes may be obtained in the antenna. A plant of but very moderate dimensions is required for such performances. Theoretically, a terminal of less than 90 feet in diameter is sufficient to develop an electromotive force of that magnitude while for antenna currents of from 2,000-4,000 amperes at the usual frequencies it need not be larger than 30 feet in diameter. \"In a more restricted meaning this wireless transmitter is one in which the Hertz-wave radiation is an entirely negligible quantity as compared with the whole energy, under which condition the damping factor is extremely small and an enormous charge is stored in the elevated capacity. Such a circuit may then be excited with impulses of any kind, even of low frequency and it will yield sinusoidal and continuous oscillations like those of an alternator. \"Taken in the narrowest significance of the term, however, it is a resonant transformer which, besides possessing these qualities, is accurately proportioned to fit the globe and its electrical constants and properties, by virtue of which design it becomes highly efficient and effective in the wireless transmission of energy. Distance is then absolutely eliminated, there being no diminution in the intensity of the transmitted impulses. It is even possible to make the actions increase with the distance from the plant according to an exact mathematical law. This invention was one of a number comprised in my \"World-System\" of wireless transmission which I undertook to commercialize on my return to New York in 1900. As to the immediate purposes of my enterprise, they were clearly outlined in a technical statement of that period from which I quote: \"\"The 'World-System' has resulted from a combination of several original discoveries made by the inventor in the course of long continued research and experimentation. It makes possible not only the instantaneous and precise wireless transmission of any kind of signals, messages or characters, to all parts of the world, but also the inter-connection of the existing telegraph, telephone, and other signal stations without any change in their present equipment. By its means, for instance, a telephone subscriber here may call up and talk to any other subscriber on the Globe. An inexpensive receiver, not bigger than a watch, will enable him to listen anywhere, on land or sea, to a speech delivered or music played in some other place, however distant. These examples are cited merely to give an idea of the possibilities of this great scientific advance, which annihilates distance and makes that perfect natural conductor, the Earth, available for all the innumerable purposes which human ingenuity has found for a line-wire. One far-reaching result of this is that any device capable of being operated thru one or more wires (at a distance obviously restricted) can likewise be actuated, without artificial conductors and with the same facility and accuracy, at distances to which there are no limits other than those imposed by the physical dimensions of the Globe. Thus, not only will entirely new fields for commercial exploitation be opened up by this ideal method of transmission but the old ones vastly extended. . . .\"\" \"My belief is firm in a law of compensation. The true rewards are ever in proportion to the labor and sacrifices made. This is one of the reasons why I feel certain that of all my inventions, the Magnifying Transmitter will prove most important and valuable to future generations. I am prompted to this prediction not so much by thoughts of the commercial and industrial revolution which it will surely bring about, but of the humanitarian consequences of the many achievements it makes possible. Considerations of mere utility weigh little in the balance against the higher benefits of civilization. We are confronted with portentous problems which can not be solved just by providing for our material existence, however abundantly. On the contrary, progress in this direction is fraught with hazards and perils not less menacing than those born from want and suffering. If we were to release the energy of atoms or discover some other way of developing cheap and unlimited power at any point of the globe this accomplishment, instead of being a blessing, might bring disaster to mankind in giving rise to dissension and anarchy which would ultimately result in the enthronement of the hated regime of force. The greatest good will comes from technical improvements tending to unification and harmony, and my wireless transmitter is preeminently such. By its means the human voice and likeness will be reproduced everywhere and factories driven thousands of miles from waterfalls furnishing the power; aerial machines will be propelled around the earth without a stop and the sun's energy controlled to create lakes and rivers for motive purposes and transformation of arid deserts into fertile land. Its introduction for telegraphic, telephonic and similar uses will automatically cut out the statics and all other interferences which at present impose narrow limits to the application of the wireless. . . .\" These automata, controlled within the range of vision of the operator, were, however, the first and rather crude steps in the evolution of the Art of Telautomatics as I had conceived it. The next logical improvement was its application to automatic mechanisms beyond the limits of vision and at great distance from the center of control, and I have ever since advocated their employment as instruments of warfare in preference to guns. The importance of this now seems to be recognized, if I am to judge from casual announcements thru the press of achievements which are said to be extraordinary but contain no merit of novelty, whatever. In an imperfect manner it is practicable, with the existing wireless plants, to launch an aeroplane, have it follow a certain approximate course, and perform some operation at a distance of many hundreds of miles. A machine of this kind can also be mechanically controlled in several ways and I have no doubt that it may prove of some usefulness in war. But there are, to my best knowledge, no instrumentalities in existence today with which such an object could be accomplished in a precise manner. I have devoted years of study to this matter and have evolved means, making such and greater wonders easily realizable. As stated on a previous occasion, when I was a student at college I conceived a flying machine quite unlike the present ones. The underlying principle was sound but could not be carried into practice for want of a prime-mover of sufficiently great activity. In recent years I have successfully solved this problem and am now planning aerial machines devoid of sustaining planes, ailerons, propellers and other external attachments, which will be capable of immense speeds and are very likely to furnish powerful arguments for peace in the near future. Such a machine, sustained and propelled entirely by reaction, is shown on page 108 and is supposed to be controlled either mechanically or by wireless energy. By installing proper plants it will be practicable to project a missile of this kind into the air and drop it almost on the very spot designated, which may be thousands of miles away. But we are not going to stop at this. Telautomata will be ultimately produced, capable of acting as if possest of their own intelligence, and their advent will create a revolution. As early as 1898 I proposed to representatives of a large manufacturing concern the construction and public exhibition of an automobile carriage which, left to itself, would perform a great variety of operations involving something akin to judgment. But my proposal was deemed chimerical at that time and nothing came from it. At present many of the ablest minds are trying to devise expedients for preventing a repetition of the awful conflict which is only theoretically ended and the duration and main issues of which I have correctly predicted in an article printed in the Sun of December 20, 1914. The proposed League is not a remedy but on the contrary, in the opinion of a number of competent men, may bring about results just the opposite. It is particularly regrettable that a punitive policy was adopted in framing the terms of peace, because a few years hence it will be possible for nations to fight without armies, ships or guns, by weapons far more terrible, to the destructive action and range of which there is virtually no limit. A city, at any distance whatsoever from the enemy, can be destroyed by him and no power on earth can stop him from doing so. If we want to avert an impending calamity and a state of things which may transform this globe into an inferno, we should push the development of flying machines and wireless transmission of energy without an instant's delay and with all the power and resources of the nation."
}