{
    "book_id": "1546341",
    "mid": "/m/059b5q",
    "title": "Naomi",
    "author": "",
    "publication_date": "1947-11",
    "genres": [
        "Novel"
    ],
    "text": " Naomis story is focused around a man's obsession for a modan garu or modern girl. The main character, Jōji, is a well-educated Japanese man who is an electrical engineer in the city, and comes from a wealthy landlord family. Jōji wishes to break away from his traditional Japanese culture, and becomes immersed in the strange new Westernized culture which was beginning to form in Japan. The physical representation of everything Western is embodied in a young girl named Naomi. Jōji sees Naomi for the first time in a café and instantly falls for her exotic \"Eurasian\" looks, Western-sounding name, and sophisticated mannerisms. Like the story of the prepubescent Murasaki in the classic novel The Tale of Genji, Jōji decides he will raise Naomi, a fifteen-year-old bar hostess, to be his perfect woman: in this case he will forge her into a glamorous Western girl like Mary Pickford, a famous Canadian actress of the silent film era. Jōji moves Naomi into his home and begins his efforts to make her a perfect Western wife. She turns out to be a very willing pupil. He pays for her English education, and though she has little grammar skills in it, she possesses beautiful pronunciation. He funds her Western activities, including her love of the theatre, dancing and magazines. During the early part of the novel Jōji makes no sexual advances on Naomi, preferring instead to groom her according to his desires and observe her from a distance. However, his plan to foster Western ideals such as independence in her backfires dramatically as she gets older. Jōji begins the novel being the dominator. However, as time progresses and his obsession takes hold, Naomi's manipulation puts her in a position of power over him. Slowly Jōji turns power over to Naomi, conceding to everything she desires. He buys a new house for them, and though they are married, Jōji sleeps in a separate bedroom, while Naomi entertains Western visitors in another room. The book ends with Naomi having complete control of Jōji's life, though he claims he is satisfied as long as his obsession with her is satiated."
}