{
    "book_id": "14764033",
    "mid": "/m/03gx67z",
    "title": "Necropolis: City of the Dead",
    "author": "Anthony Horowitz",
    "publication_date": "2008-10-30",
    "genres": [
        "Thriller",
        "Fantasy",
        "Adventure novel"
    ],
    "text": " Scarlett Adams' school tutor group is taken on a trip to St Meredith's Church where she sees a vision of Matthew Freeman, who leads her to the door with the pentagram etched into it. There, she is transported to the Ukraine, inside a monastery where she is captured by monks who worship the Old Ones. She is taken to the leader of the monastery, Father Gregory, who tells Scarlett of the Gatekeepers and the Old Ones. He and his followers built the monastery around the door in order to catch any of the Five for the Old Ones should they come through. Scarlett is taken to a cell, and that night she has a dream about a dragon and a strange neon sign that says \"SIGNAL ONE\". Later, she escapes by attacking the monks and returning through the door. She returns to St Meredith's, but her eighteen-hour long disappearance has sparked a media storm. In Peru, at Professor Chambers' hacienda, Matt finds out who Scarlett is through the media storm and decides that he should go back to London with the rest of the Five and his friend Richard Cole. However, later that night, a man named Ramon brings the diary belonging to St Joseph of Cordoba, claiming that he feels remorse for helping Diego Salamanda decode the diary. The diary contains the locations of twenty-five doors around the world that serve as portals to other doors. After studying the diary using his skills of reading old maps he learnt at university, Richard says that there are doors in Tuscany, Lake Tahoe, Cuzco, London, Ukraine, Cairo, Istanbul, Delhi, Mecca, Buenos Aires, the Australian outback, Antarctica and Hong Kong. Scott Tyler confirms Ramon's truthfulness by reading his mind, but the hacienda is then attacked and set on fire by strange zombies who kill Ramon with a fence post. Although their Inca allies arrive and finish off the zombies, Professor Chambers is mortally wounded and dies. Matt decides that the Five should split up so that the Old Ones cannot capture them all in one shot, and he, Jamie and Richard go to find Scarlett while Pedro and Scott go to the hidden Inca city of Vilcabamba to stay. In London, Scarlett is trying to get back to her normal life, but can't when she notices strange men following her. She receives a strange phone call from her friend Aidan, who persuades her to go to Happy Garden, a Chinese restaurant, for a Chinese man wants to see her. However, the restaurant is destroyed by a bomb. She unwillingly goes to Hong Kong for her father, who works for Nightrise. Matt, Richard and Jamie arrive in London and nearly cross paths with Scarlett, but are held up by an accident orchestrated by the shape changers working for the Old Ones. They go to the Nexus headquarters where Matt realises Ramon's arrival at the hacienda was a trap laid by the Old Ones to stop them from getting to England before Scarlett left for China. Matt theorises that Ramon was hypnotized to give the diary back to the group to create the idea of using one of the doors to get to Hong Kong. There would be agents waiting to immediately capture them once they emerged through the Hong Kong door, so they decide to fly to Macau to seek help from one of the Nexus' contacts before taking a boat into Hong Kong. Meanwhile, Scarlett arrives in Hong Kong, being looked after by a Mrs Cheng, who claims her father is away on urgent business. Scarlett meets the sinister Chairman of Nightrise at The Nail, Nightrise's Hong Kong headquarters, who gives her an ornate jade necklace, which is in fact a tracking device. Whilst in Hong Kong, strange and ominous things start happening around her. A person trying to give her a letter disappears in a swarming crowd, and the people that she meets stare at her intently. Mrs Cheng and Karl, the chauffeur, seem robotic and lifeless, and the smog surrounding Hong Kong is thickening. Scarlett follows a trail of clues telling her to go to The Peak and over there, two agents kill Mrs Cheng, who is revealed to be a shape-changer who is one of the Old Ones in human form. Scarlett is then taken to Lohan Shang-tung, whose agents have just helped her escape the Old Ones, and when the building is attacked by Old Ones and Police, they help her to escape again. She is then disguised as a boy, and pretends to be the son of a couple who are boarding a ship departing Hong Kong to Macau, where she will meet with the other Gatekeepers. However, her father, Paul Adams, stationed at the jetty, finds her and hands her over to the chairman, who recaptures her believing that it will help her, and keeps her at Victoria Prison. A dream call by Scarlett wakes a dragon (a metaphor for a typhoon), which starts to move towards Hong Kong. Matt, Jamie and Richard had arrive in Macau where they meet Han Shang-tung, who reveals himself as \"The Master of the Mountain\", the leader of the White Lotus Society, a Triad based in Macau and Hong Kong. Shang-tung explains that Scarlett has been taken prisoner by the Old Ones who plan to turn Hong Kong into a necropolis, a city of the dead, by using poisonous gases mixed with the pollution from mainland China that will suffocate and kill the residents there. Shang-Tung believes Scarlett is a reincarnate of a goddess and has had his people watch over her all her life. He agrees to help them after affirming that Matt and Jamie are indeed part of the Five with a test: climbing a sword ladder. Later that night Richard, Matt and Jamie travel by boat to Hong Kong and come under attack by the Hong Kong police (under the control of the Old Ones) after they are betrayed by the captain. In the struggle, Matt loses Richard and Jamie, arriving in Hong Kong alone. He sees people dying in the street because of the pollution, and recognizes several of the Old Ones' servants. Matt makes his way to Wisdom Court, where Scarlett's father now resides. Once there Matt lets himself be captured by the Chairman after being betrayed by a despondent Paul Adams, attempting to barter him for Scarlett. However, Adams is killed and Matt is taken to the same cell as Scarlett in Victoria Prison where they share their experiences. Matt reveals that his being captured was in fact a plan he had made with her father. He knew that the only way to get near her was to be caught, so he had contacted Lohan and his men earlier, telling them of his plan, and then Scarlett's father had agreed to call Nightrise in order to turn in Matt, even at expense of his own life. Matt also explained that he knew the Old Ones would think it was amusing to see two of the Five briefly imprisoned in the same room, before they were imprisoned in different rooms in different sides of the world. Because their powers are strengthened when together they begin to think of escaping. The meaning of \"Signal One\" is then explained. It is part of the Hong Kong Observatory warning system on the intensity of typhoons. To the Chinese, typhoons are also known as the dragon's breath, explaining the dragon Scarlett had been dreaming of in the Gatekeeper's dream world. She has the ability not just to predict, but to control weather conditions. It is also revealed that Scarlett knew of the typhoon and the power it would bring. Richard and Jamie find Lohan and he bands together his men to rescue Scarlett and Matt under cover of the rising storm Scarlett has made and take the prison, where he followed Matt to when he was being captured. The impending storm is creeping higher up the scale. Jamie knows that Scott will be able to feel the danger Jamie is in, and that he will try and use the door that leads to the Tai Shan Temple, which will undoubtedly be guarded. The group, along with Scarlett, who diverts the storm from them while it destroys everything around them, run to the temple to kill the guards protecting it before Scott arrives, which would result in his death or capture. At The Nightrise headquarters, a wooden sampan picked up by the typhoon smashes into the Chairman's office and ironically kills him; he despises naval craft. Meanwhile, Lohan's men kill all but one of the Old Ones' agents, who is wounded but hides. Scott and Pedro travel through the door and the last Old One agent aims at Jamie, but Scott pushes him out of the way and the bullet hits Scarlett in the head, rendering her unconscious. Without Scarlett to hold the typhoon back, it unleashes its full strength on them and disintegrates the temple. Jamie and Scott, Richard and Scarlett, Pedro, and Matt and Lohan dash through the door moments before the temple is destroyed, escaping the typhoon. Then the storm finally abates, revealing Hong Kong completely destroyed (although all the pollution was swept away). All of the Five are separated all over the world with their partners, due to having no preassumed destination decided between all of them, also it is said that since the door collapsed as they were going through it, one final trick was played on them. Meanwhile, Chaos, the King of the Old Ones, prepares to commence the war to conquer the planet and wipe out humanity. *Necropolis signifies a change in the structure of the narrative of The Power of Five series, with two character's tales being told side by side. It also sees the Gatekeepers actively seeking each other for the first time. *All five children have turned fifteen between Nightrise and Necropolis but, although Matt mentions his own birthday occurred while he was in Nazca, it is not explicitly mentioned if the Five were born on the same day. *This is also the first novel in the series which prominently features a somewhat divine opposition against the Old Ones, with the introduction of the Librarian. The Librarian's role is brief and never elaborated upon, but it is made clear the Librarian has vast power. It is obvious he is there to combat the Old Ones. This makes a significant change because in the first three novels the Old Ones had seemingly invincible power and the Five had to face them themselves with no help. *The final chapter of Nightrise, which introduced modern day Scarlett, is significantly revised in this novel. Scarlett's disappearance having occurred beforehand. *Pedro, who could not speak a word of English previously in the series, has apparently learned a sufficient amount of the language for communication purposes in the four months since the events of Evil Star. Again, this is not explicitly referred to in the narrative. *In Raven's Gate, Matt claimed he never smoked when Claire Deverill came over for dinner. However, in Necropolis, when he introduces himself in his diary, he claims that he had smoked with Kelvin Johnson but withdrew after his arrest. Of course, Matt hated and feared Deverill, and so may simply have lied to her. It is unlikely he would have felt any compunction about doing so."
}