{
    "book_id": "2300302",
    "mid": "/m/0721l6",
    "title": "Nemesis",
    "author": "Agatha Christie",
    "publication_date": "",
    "genres": [
        "Crime Fiction",
        "Mystery",
        "Children's literature",
        "Fiction",
        "Suspense"
    ],
    "text": " Miss Marple receives a post card from the recently deceased Mr Jason Rafiel, a millionaire whom she had met during a holiday on which she had encountered a murder, which asks her to look into an unspecified crime; if she succeeds in solving the crime, she will inherit £20,000. Rafiel, however, has left her few clues, not even when or where the crime was committed and who was involved. Miss Marple's first clue is a tour of famous houses and gardens of Great Britain, arranged for her by Mr. Rafiel prior to his death. She is accompanied on the trip by fourteen other people, at least one of whom she suspects to be related to her enquiries. She learns that one of her companions, Elizabeth Temple, is the retired headmistress of the school which a girl who was engaged to Rafiel's ne'er-do-well son, Michael, attended. Another member of the tour group, Miss Cooke, is a woman she had previously met and discussed gardening with. Her next clue comes in the form of a woman named Lavinia Glynne; Rafiel had written to Mrs. Glynne and her two sisters before his death, suggesting that Miss Marple spend the most physically challenging few days of the tour with them. Miss Marple accepts Lavinia's invitation, assuming it to be the next part of Mr Rafiel's instructions. She then meets Lavinia's sisters, Clotilde and Anthea Bradbury-Scott and immediately feels there is something odd about Anthea. On talking to the servant, Miss Marple learns that the girl engaged to Michael Rafiel had been adopted by Clotilde after the death of her parents. On the morning of her return to her party, Miss Marple is told by another member of the tour group that Miss Temple had been knocked unconscious by a rockslide during their hike of the previous day, and was lying in a coma in hospital. The group stays over an extra night to wait for news from the tour guide about Miss Temple's health. It turns out that Professor Wanstead, a pathologist and psychologist interested in the different types of criminal brains, had been instructed by Mr Rafiel to go on the tour. He had examined Michael Rafiel at the request of the head of the prison where Michael was incarcerated; he came to the same conclusion as his friend: Michael was not capable of murder. He also tells her how uninterested Michael's father seemed. Professor Wanstead then takes Miss Marple to see Miss Temple; in a moment of consciousness, Miss Temple had asked for Miss Marple. Miss Temple wakes only long enough to tell Miss Marple \"search for Verity Hunt\", and dies that night without reviving again. The three sisters extend their invitation to Miss Marple when she returns to the tour, and she promptly accepts. That night, she discovers that Verity was the girl Clotilde had adopted. After the inquiry into Miss Temple's death, Miss Marple is visited by Archdeacon Brabazon, who was a friend of Miss Temple's. He then tells Miss Marple that he was going to marry Verity Hunt and Michael Rafiel, but had been sworn to secrecy by Verity. While he disapproved of the secrecy and of Verity marrying Michael, he agreed to marry them because he could see that they were in love. He was most surprised when neither turned up for the wedding. Miss Marple decides to stay another few nights with the three sisters when the tour moves on. Professor Wanstead travels to London by train on an errand for Miss Marple. Miss Barrow and Miss Cooke decide they would like to visit a nearby church. Later that evening, Miss Marple talks with the sisters about what she thinks may have happened and, while they are doing so, Miss Barrow and Miss Cooke appear, to talk to Miss Marple. They stay for a time and are then invited back for coffee that evening. As they talk about Miss Temple, Miss Marple suggests that Joanna Crawford and Emlyn Price pushed the boulder, and their alibis are mere fabrication. As they get ready to leave, Miss Cooke suggests that the coffee wouldn't suit Miss Marple, as it will keep her up all night and Miss Marple instead asks for some warm milk. The two ladies soon depart, though each forgets an item and has to return for it. At three o'clock the next morning, Clotilde enters Miss Marple's room. Miss Marple reveals that she knows that Clotilde murdered Verity and hid her in the now-destroyed greenhouse, because she could not stand to see Verity love someone else. She also reveals that she knows that Clotilde killed another girl, Nora Broad, merely in order to (mis)identify the body as Verity's and thus throw suspicion on Michael Rafiel. Just as Clotilde advances toward her, Miss Marple blows on a whistle, which brings Miss Cooke and Miss Barrow—they are bodyguards employed by Mr. Rafiel to protect Miss Marple. Michael Rafiel is set free. Miss Marple collects her 'fee'."
}