{
    "book_id": "2346676",
    "mid": "/m/075ht4",
    "title": "Noon: 22nd Century",
    "author": "Boris Strugatsky",
    "publication_date": "",
    "genres": [
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " The book is a collection of short stories describing various aspects of human life on Earth in the 22nd century. The plots of the stories are not closely connected, but they feature a shared set of characters. The most commonly recurring characters are Evgeny Slavin and Sergei Kondratev, who, as a result of a lengthy journey through interstellar space at near the speed of light, are thrown over a century into the future and must re-integrate into the society of their great-grandchildren. The book includes the following stories: #Night on Mars - Two doctors walk on foot on Mars after their vehicle was lost in quicksand. They must avoid an encounter with a local wild beast, while hurrying to assist in the delivery of Evgeny Slavin, the first human born on Mars. (This apparently takes place in the late 20th century.) #Almost the Same - Sergei Kondratev as a young man in flight school. #Old-timer - The photon engine-driven spaceship \"Taimyr\" mysteriously returns to Earth after having disappeared a century earlier. Kondratev and Slavin are the only survivors. #The Conspirators - Schoolchildren Pol Gnedykh, Aleksandr \"Lin\" Kostylin, Mikhail Sidorov, and Gennady Komov plan and dream about their futures. #Chronicle - A scientific report giving an analysis of the disappearance and reappearance of the Taimyr. #Two from the Taimyr - Kondratev and Slavin recuperate from their wounds after the crash of the Taimyr, and begin to investigate the Earth of the future to which they have returned. #The Moving Roads - Kondratev explores Earth on a global system of moving roadways. #Cornucopia - Slavin attempts to adjust to the domestic technology of the future. #Homecoming - Kondratev encounters Leonid Gorbovsky, and decides to take a job in oceanography. #Langour of the Spirit - Gnedykh and Kostylin reconnect after many years apart. #The Assaultmen - Gorbovsky tours the artificial satellites of Vladislava, and journeys to the surface with Sidorov and Ryu Waseda. #Deep Search - Kondratev and oceanographer Akiko Okada hunt giant squid on a deep sea expedition. #The Mystery of the Hind Leg - Slavin encounters the Collector of Dispersed Data project. #Candles Before the Control Board - Okada (now married to Kondratev) tries to visit her dying father, the subject of the Great Encoding #Natural Science in the Spirit World - Espers assist the Institute of Space Physics in an effort to explain the Taimyr disappearance and reappearance. #Pilgrims and Wayfarers - Gorbovsky discusses the \"Voice of the Void\" and other mysteries, and the philosophy of space exploration. #The Planet with all the Conveniences - Komov, Waseda, and others explore the planet Leonida and make brief contact with the Leoniders. #Defeat - Sidorov tests prototype colonization devices in a remote area on Earth. #The Meeting - Gnedykh and Kostylin again meet after a long separation, and Gnedykh regrets his accidental killing of an alien creature who may have been sentient. #What You Will Be Like - Kondratev, Slavin, and Gorbovsky explore Tagora. Kondratev and Slavin discuss the progress and stagnation of humanity over their long lifespan, and Gorbovsky tells a fantastic story about his encounter with a visitor from the future."
}