{
    "book_id": "413120",
    "mid": "/m/025c53",
    "title": "Oahspe: A New Bible",
    "author": "",
    "publication_date": "1882",
    "genres": [
        "Religion"
    ],
    "text": " Oahspe includes doctrinal books, and precepts for behavior can be found throughout its many books. Freedom and responsibility are two themes reiterated throughout the text of Oahspe. Some core doctrines include an herbivorous diet (vegan, vegetable food only), peaceful living (no warring or violence; pacifism), living a life of virtue, and service to others. Oahspe exhibits great interest in understanding and applying general ethical principles. The suffix ISM in Faith-ism is defined meaning adherence or following an ideology. The Book of Inspiration in the Oahspe states \"I will have no sect. I will have no creed\". Oahspe speaks of the need for all religions to help the various nations and peoples to rise upward. It also speaks of what it calls \"the religion of Gods themselves,\" in which its adherents have no need for intermediaries such as are Saviors and Idols, but who commune directly with the Creator of all. Oahspe purports to describe events in the spirit realms and their corresponding influence on events in the physical world starting from approximately 72,000 years ago and its believers think that its revelations also provide missing details of ancient historical accounts regarding the origins of earth's major religions. ===== Geology and Archeology ===== Oahspe gives many details regarding an alleged large continent called Pan or Whaga that once filled much of the Pacific Ocean. It also puts forward views on the causes of rapid loss or gain of fertility upon the earth. The largest of the Books are Book of Eskra, the recent history according to the Oahspe, and the Book of God's Word which teaches the record of Zarathustra. ===== Language and linguistics ===== Oahspe presents many illustrations of symbols said to be of ancient languages and of rites and ceremonies. It states the concept that there was an original language called Pan or the Panic Language, meaning \"Earth Language,\" which originated from the ability of humans to mimic sounds. Its Book of Saphah has details on the claimed meanings and roots of many of the ancient words, symbols and ceremonies. ===== Evolution or progress ===== Oahspe contains chronologically-ordered accounts that are cosmological revelations concerning the evolution of humanity from approximately 78,000 years ago. This includes a narrative of the genesis of life on earth, from its start as a planet being formed from its beginnings as a comet, to its first life-forms and finally to the appearance of the human race and its progression from beast to spiritual maturity. ===== Cosmogony ===== Oahspe explains physical science as having its basis in subtler realms (which include spiritual forces), and then how to predict from them. Oahspe devotes an entire interior book to the subject, called the Book of Cosmogony and Prophecy, but a general overview can be read in the Book of Jehovih. Also, many examples and edifications are sprinkled throughout Oahspe. Other related subjects include physics and an integrating treatment of gravity, light, electricity, magnetism, and heat. ===== Cycles ===== The text describes cyclical events that occur within a range of greater and smaller cycles. For instance, according to Oahspe, the earth is traveling with the sun and its planets through regions of space in a large circuit of 4,700,000 years, which is divided into sections of 3,000 years average, which also occur within larger cycles of 24,000 years and 72,000 years, and so on. Each of these regions has variations in density and other qualities, and so, engender varying conditions that the Earth encounters. Also, explanation is given as to the rise and fall of civilizations. ===== Administration ===== The various regions mentioned in the previous Cycles section, are under the administration of spiritual or \"etherean\" beings with titles such as \"God\" and \"Chief\" and whose ranks and ages vary in ascending grade, from tens of thousands of years to hundreds of thousands of years old and older. Their dominions cover vast distances and include many spiritual and corporeal worlds of various grades and densities. These chief officers are designated \"Sons and Daughters of Jehovih,\" and in accordance, the text of Oahspe contains separate sections or \"books\" such as the Book of Cpenta-Armij, Daughter of Jehovih, and also includes familiar names from non-Abrahamic religions, as in the Book of Apollo and Book of Thor, named as Sons of Jehovih. Each of these Chiefs, Chieftainesses, Gods and Goddesses are only advanced angels according to Oahspe. And every angel, regardless of rank or office, was once a mortal, either from this planet earth or from some other planet in the universe."
}