{
    "book_id": "5533292",
    "mid": "/m/0dr8dd",
    "title": "Ode to Gallantry",
    "author": "Louis Cha",
    "publication_date": "1965",
    "genres": [
        "Wuxia"
    ],
    "text": " The plot centers on a case of mistaken identity between a pair of identical twins, which in his afterword Jin Yong acknowledges resemble some works of William Shakespeare (cf. Twelfth Night and The Comedy of Errors). The protagonist, who refers to himself as \"Gouzazhong\" (狗雜種; literally means \"the mongrel dog\", a colloquialism for \"bastard\"), first appears as a young beggar living on the streets of Kaifeng, searching for his lost mother. He witnesses a fight between several wulin pugilists and meets the Shi couple and members of the Snowy Mountain Sect (雪山派). An accident causes him to be taken away from Kaifeng by a martial artist called Xie Yanke, to Xie's secluded home on Motian Cliff. Xie Yanke, who is frequently bothered by Gouzazhong, decides to teach him martial arts. Gouzazhong learns qi cultivation techniques under Xie Yanke's tutelage for six years. Gouzazhong is unaware that Xie Yanke actually harbours ill intentions towards him and has been teaching him the wrong methods, in hope that Gouzazhong will sustain internal wounds and die eventually. At the same time, the leader of the Changle Sect, Shi Potian (whose real name is Shi Zhongyu), mysteriously disappears. The greater part of the novel deals with the complications that arise as Gouzhazhong is mistaken to be Shi Zhongyu, not only by members of the sect (for ulterior motives), by also by Shi Zhongyu's parents, the Shi couple, Shi Zhongyu's lover Ding Dang, and members of the Snowy Mountain Sect. Although the two bear a splitting resemblance, their characters cannot be more different: Gouzhazhong is simple, honest and clever, while Shi Zhongyu, the son of the Shi couple, has a bad reputation as a lewd and sly womaniser. In the process Gouzhazhong acquires consummate martial arts skills. Gouzazhong is hounded by members of the Snowy Mountain Sect who mistake him for Shi Zhongyu, who had molested A'xiu, the granddaughter of the Snowy Mountain Sect's leader. He acquires A'xiu as his girlfriend after various episodes, during which the misunderstandings are resolved. The novel culminates in an episode when the leaders of various sects are coerced into going to a secluded island by a pair of mysterious, highly skilled messengers to celebrate the Laba Festival by eating Laba congee. The story then leads to a surprising conclusion: revelations on the island and more revelations concerning Gouzhazhong's true parentage."
}