{
    "book_id": "759873",
    "mid": "/m/0390v7",
    "title": "Once Were Warriors",
    "author": "Alan Duff",
    "publication_date": "1990",
    "genres": [
        "Fiction"
    ],
    "text": " Beth Heke left her small town and, despite her parents' disapproval, married Jake \"the Muss\" Heke. After 18 years, they live in a slum and have six children. Their interpretations of life and being Māori are tested. Since Beth is from a more traditional background, she relates to the old ways, while Jake is an interpretation of what some Māori have become. Beth sometimes tries to reform herself and her family - for example, by giving up drinking and saving the money which she would have spent on alcohol. However, she finds it easy to lapse back into a pattern of drinking and irresponsibility. The family are also shown disconnected from Western culture and ways of learning. Beth reflects that neither she nor anyone else she knows has any books in their home, and her daughter, Grace, is the only character with a real interest in school and learning. (This disconnection from books and education is a major concern of Duff's, for which reason he founded the charity Duffy Books in Homes, which gives free books to children from poor backgrounds and generally encourages reading). Jake is unemployed and spends most of the day getting drunk at the local pub with his friends. There he is in his element, buying drinks, singing songs and savagely beating any other patron whom he considers to have stepped out of line (hence his nickname of 'The Muss'). He often invites huge crowds of friends back to his home for wild parties. While Jake portrays himself as an easygoing man out for a good time, he has a vicious temper when drinking. This is highlighted when his wife dares to 'get lippy' at one of his parties and he savagely attacks her in front of their friends. Nig, the Hekes' eldest son, moves out to join a street gang. He cares about his siblings, but despises his father for his thoughtless brutality, a feeling returned by the elder Heke. Nig attempts to find a substitute family in the form of the gang, but this is unsuccessful as the gang members are either too brutal or, in the case of Nig's gang girlfriend, too beaten down to provide him with the love and support he craves. The second son, Mark 'Boogie' Heke, has a history of minor criminal offences, and is taken from his family and placed in a borstal. Despite his initial anger Mark finds a new niche for himself, as the borstal manager instructs him in his Māori heritage. Grace, the Hekes' 13-year-old daughter, loves writing stories as an escape from the brutality of her life. She also spends time spying on a wealthy Pākehā family who live nearby. She is amazed at the contrast between their lives and hers - not simply the material wealth, but also the lack of conflict in their lives. Grace's best friend is a drug-addicted boy named Toot who has been cast out by his parents and lives in a wrecked car. He is the one who really cares for her. Grace is raped in her bed one night, and she subsequently hangs herself. In her diary, later found by her family, Grace says she thinks it was her father who raped her (while in the movie she clearly identifies by name one of Jake's friends, who was at the house during a party, as the rapist); Jake, who had been too drunk to remember what happened that night, has no answer. (In the movie Grace's mother finds and reads the diary which reveals the dads friend who raped her. Jake and that friend are at a bar when the mother brings the diary to Jake, shows him the passage about who raped her. Jake flies into a rage savagely beats the rapist, including smashing the rapist's head into the glass front of the music jukebox.) He leaves his family and starts living in a park, where he reflects on his life and befriends a homeless young man. Meanwhile, Beth starts a Māori culture group and generally attempts to revive the community. A sequel to the book was published in 1996, What Becomes of The Broken Hearted?, which was made into a film in 1999. Both the book and film sequel were well received, though not as celebrated as the original. The third book in the trilogy, Jake's Long Shadow, was published in 2002, but has not been made into a movie. Once Were Warriors, and Duff's fiction in general, is strongly influenced by his childhood experiences. In his 1999 autobiography, Out of the Mist and Steam, he describes his Māori mother (and most of her relatives) as alcoholic, irresponsible and physically and emotionally abusive. His Pākehā father and his relatives, by contrast, were highly educated and sophisticated - one uncle, Roger Duff, was a well-known anthropologist; his paternal grandfather was liberal magazine editor and literary patron Oliver Duff. As a teenager, Duff himself spent some time in borstal, and he drew on this when writing about Boogie. The book's setting of Two Lakes is based on his hometown of Rotorua (which means 'two lakes' in the Māori language; roto lake, rua two), and on the Ford Block of state housing in the town."
}