{
    "book_id": "917616",
    "mid": "/m/03prtc",
    "title": "Orlando: A Biography",
    "author": "Virginia Woolf",
    "publication_date": "1928-10-11",
    "genres": [
        "Speculative fiction"
    ],
    "text": " Orlando tells the story of a young man named Orlando, born in England during the reign of Elizabeth I, who decides not to grow old. He is briefly a lover to the elderly queen, but after her death has a brief, intense love affair with Sasha, a princess in the entourage of the Russian embassy. This episode, of love and excitement against the background of the Great Frost, is one of the best known, and is said to represent Vita Sackville-West's affair with Violet Trefusis. Following Sasha's sudden, unwarned departure and return to Russia, the desolate, heartbroken Orlando returns to writing The Oak Tree, a poem started and abandoned in his youth. He meets with a famous poet, Nicholas Greene, with whom he joyfully entertains, but who criticises Orlando's writing, later making Orlando feel betrayed when he finds himself made the foolishly-depicted subject of one of Greene's subsequent works. This period of contemplating love and life leads Orlando to appreciate the value of his ancestral stately home, which he proceeds to furnish lavishly and then plays host to the populace. Ennui sets in and the harassment of a persistent suitor, the Archduchess Harriet, leads to Orlando's fleeing the country when appointed by King Charles II as British ambassador to Constantinople. Orlando performs his duties well, until a night of civil unrest and murderous riots. He falls asleep for a lengthy period of days while in Turkey, resistant to all efforts to rouse him. Upon awakening he finds, unsurprised, that he has metamorphosed into a woman—the same person, with the same personality and intellect, but in a woman's body. The now Lady Orlando covertly escapes Constantinople in the company of a Gypsy clan, adopting their way of life until its essential conflict with her upbringing leads her to head home. Only on the ship back to England, with her constraining female clothes and an incident in which a flash of her ankle nearly results in a sailor's falling to his death, does she realise the magnitude of becoming a woman; yet she concludes the overall advantages, declaring 'Praise God I'm a woman!' Back in England, Orlando is hounded once again by the archduchess, who now reveals herself in fact to be a man, the Archduke Harry. Orlando evades his marriage proposals, instead living a life switching between gender roles, dressing as both man and woman. Orlando soon becomes caught up in the life of the eighteenth and nineteenth centuries, holding court with the great poets (notably Alexander Pope), including Nick Greene who appears to be as timeless as she, now promoting her writing and promising to help her publish The Oak Tree. Orlando wins a lawsuit over her property and marries a sea captain, Marmaduke Bonthrop Shelmerdine. In 1928, she publishes The Oak Tree centuries after starting it, winning a prize. As her husband's ship returns, in the aftermath of her success, she rushes to greet him."
}