{
    "book_id": "15275289",
    "mid": "/m/03hntx3",
    "title": "Owen Glendower",
    "author": "",
    "publication_date": "",
    "genres": [
        "Historical novel"
    ],
    "text": " Rhisiart arrives at Dinas Bran, in the company of fellow-travellers including Brut and a group of monks led by the Abbot of Caerleon, to find himself embroiled in a struggle between the local authorities, who are about to burn \"Mad Huw\", a local friar who preaches that King Richard II of England is still alive, and those trying to prevent the burning. Mad Huw’s chief protector is a teenage girl, Tegolin, known as the \"Maid of Edeyrnion\", and Rhisiart immediately becomes infatuated with her. Having succeeded in preventing the burning, Rhisiart is approached by Meredith, the son of Owen Glendower, who invites him and his fellow-travellers to Owen’s stronghold at Glyndyfrdwy. They arrive there, in the company of Father Rheinalt (Tegolin’s natural father) and Father Pascentius from the nearby abbey of Valle Crucis, in time to save the life of Gruffydd Young, who has been captured and mistaken for a spy by Owen’s men. At Glyndyfrdwy they meet Owen’s wife (the “Arglwyddes”) and his eldest son, Griffith (Gruffudd ab Owain Glyndŵr), but Rhisiart is particularly taken with Owen’s young daughter, Catharine. After feasting and entertainment, they witness the death of the bard Iolo Goch. With his last breath, the bard predicts Owen’s rebellion. The monks, Rhisiart, Brut, Mad Huw, Master Young and a few other chosen individuals are summoned by Owen to give their opinions on the best course of action. During the meeting, a messenger arrives from the Pope in Rome. The following day, Rhisiart learns that the papal messenger has taken word of the proposed rebellion to Owen’s enemies, and Owen must act quickly. He has agreed to the Church’s demand that he give up Tegolin, Mad Huw, and a young woman named Alice, a former servant at Ruthin who has been captured by Owen’s men. Owen has refused to give up Walter Brut, but Brut insists on accompanying the others to Valle Crucis, and Rhisiart goes with them, gradually finding himself strangely attracted to Alice. The abbot of Valle Crucis, though sympathetic to their plight, allows the hostages to be taken into custody at Rhisiart’s ancestral castle of Dinas Bran, now the home of Tegolin’s mother, Lowri, and grandmother, the Lady Ffraid. On arrival at the semi-ruined castle of Dinas Bran, Rhisiart is taken into the custody of Adda, the elderly seneschal, who shows him a famous relic, the so-called “sword of Eliseg”. He is introduced to more of the castle’s female residents, including the mysterious Luned, her friend Efa (a teenage girl who has volunteered to be sacrificed as the “bride of Derfel”), and the dwarf Sibli. All three wait on Lowri’s mother, Ffraid ferch Gloyw, in her tower room. Rhisiart comes close to being seduced by Lowri, but she departs shortly after his arrival, with her lover Denis Burnell, the constable of the castle. Rhisiart and Brut are held hostage in the castle for three months, until Lowri and Denis return. Rhisiart makes an assignation with Lowri, but after he and Sibli eavesdrop on her and her ex-husband, Simon (now a prisoner at the castle), he realises that Lowri feels nothing for him and is making use of him in a perverted game she is playing with Simon. Soon afterwards the castle receives an unexpected visit from a party including Harry Hotspur and the young Prince of Wales, Henry of Monmouth (the future King Henry V of England). With them are monks from Valle Crucis, one of whom turns out to be Owen Glendower in disguise. Owen reclaims the hostages and takes them to Glyndyfrdwy, where he is proclaimed Prince of Wales by his followers. Chief among these is Crach Ffinnant, “the Scab”, a self-proclaimed prophet who follows the rule of St Derfel. Owen is expected to take Efa as his ceremonial “bride”, but instead he takes her to the home of his friend, the miller, Broch o’Meifod. Rhisiart, newly appointed Owen’s secretary, accompanies them. The miller’s wife, upset by her husband’s decision to join Owen’s rebellion, puts a curse on him, saying that he will only be successful as long as he destroys and kills, but will fail when he tries to rebuild. Almost two years pass, and Rhisiart continues to serve Owen as secretary, whilst beginning a romance with Owen's daughter Catharine. Owen, though aware of their relationship, has other plans for his daughter, as a potential pawn in the political game. After Adda is brutally murdered with the sword of Eliseg by the son of Lord Grey of Ruthin, attitudes towards the English harden. At the Battle of Pilleth, Owen is wounded but the Welsh are victorious against an army led by Edmund Mortimer. Rhisiart is horrified by the desecration of dead English bodies by a group of women led by Lowri. Mortimer, left unransomed by the English king, agrees to a marriage with Catharine that will give Owen the assistance of both the Mortimer and Percy dynasties. Rhisiart makes plans to elope with Catharine, but she refuses, choosing to obey her father's wishes. A further two years go by, and the narrative passes over the Battle of Shrewsbury and the death of Hotspur. Brut has married Alice, and the marriage of Catharine and Mortimer appears successful. Owen is tempted by prophecies he has heard about the crowning of a great king by a girl in armour, and toys with the idea of using Tegolin for this purpose. He continues to negotiate the Tripartite Indenture with Hotspur's father, the Earl of Northumberland, and receives ambassadors from King Charles VI of France. One of these, Gilles de Pirogue, is interrupted by Rhisiart and Father Pascentius in the process of torturing a dog and an elderly Jew, with the encouragement of Lowri and Sibli. Rhisiart's intervention causes a diplomatic incident. Owen signs the Tripartite Indenture, despite the news of a defeat for his forces in the north and the fatal injuries to his trusted \"captain\", Rhys Gethin (Lowri's current lover). He is obliged to punish Rhisiart for his offence to the French ambassador, and is about to banish him from the court at Harlech Castle when the other ambassador intervenes, ensuring that Rhisiart can remain in service when Owen's parliament meets. Rhisiart, Brut, Mad Huw and Father Rheinalt are scandalized when Owen forces Tegolin to appear before the assembled troops wearing golden armour, and they prepare to oppose the prince's scheme to take her into battle with him. Through their intervention, and that of his own son Meredith, Owen is persuaded to alter his plans, and gives Tegolin to Rhisiart in marriage. Following the ceremony, Rhisiart foils an assassination attempt by Dafydd Gam at the chapel door. Rhisiart and Tegolin are sent with an army to relieve the prince’s forces on the Usk, and the focus of the action shifts to Owen himself. He banishes the interfering Father Pascentius from the castle, but decides to release Dafydd Gam, who in his superstition has concluded that Owen is protected by powerful spirits and now wishes to serve him. Owen’s other followers, initially suspicious of Gam, are horrified when, during a pilgrimage to the shrine of Derfel, Crach Ffinnant is apparently killed by Gam in a mysterious “accident” arranged with Efa’s collusion. On top of the news of Crach Ffinnant’s death comes word that Owen’s armies on the Usk have been defeated. Owen’s own brother has been killed, as has his loyal supporter, the Abbot of Caerleon. Rhisiart and Tegolin have been taken prisoner, along with Owen’s eldest son Griffith. The Arglwyddes rebukes her husband in front of his remaining followers. With Rhys Gethin on his deathbed, Lowri, driven mad by the turn of events, murders her ex-husband Simon. As Harlech Castle fills with confusion and discontent, Denis Burnell and Sir John Oldcastle arrive to visit Owen. As they stand on the shore conversing with Broch, they witness the approach of two ships: one from France and another from Anglesey, the latter carrying Efa’s fiancé, a member of the Tudor family with whom Owen is allied. An English pirate ship attacks the French vessel, and Owen and Broch plunge into the sea to rescue what they take to be a Frenchman. It turns out to be a chimpanzee, sent as a gift for Owen by the French king. While they are recovering from their ordeal, a messenger arrives to tell them that a French army has landed safely in Milford Haven. Broch makes the decision to leave Owen and return to his family. A few months later, Rhisiart and Brut are prisoners in the city of Worcester when Owen arrives at the head of a large army, having recovered many of his losses with the aid of the French. Lacking reliable military advisors, he delays the decision to storm the city until it is too late, and is forced to retreat. This part of the narrative is seen partly through the eyes of the young herald, Elphin. Owen has been allowed a visit from Tegolin, who tells him that, by sleeping with the custodian, she has been able to obtain a guarantee that Rhisiart's life will be spared. She gives Richard a phial containing a colourless liquid which she claims is \"certain death\". The two prisoners are interviewed by King Henry and the Archbishop of Canterbury. Rhisiart is condemned to the Tower of London and Brut to be burned at the stake. Rhisiart, in order to prevent his friend's suffering, tricks him into drinking the contents of the phial, and Brut dies instantly. The action moves forward to 1416. Owen's rebellion is over, and Catharine's son Rhisiart Mortimer is being cared for by Elphin, now known as \"Father Sulien\". Henry V is now on the throne, young Rhisiart's parents are both dead, and his godfather Rhisiart is at liberty. The boy tells Elphin/Sulien of a hermit who lives on a nearby mountain, and the two go to the hermit's cave to find that it is Broch. With him is Owen, now an old and sick man, and the prince is reunited with his grandson. Rhisiart ab Owen arrives in the company of Lord Talbot, sent by the new king to offer a pardon to Owen. Owen, using what seems to be magic, appears in a vision to both Rhisiart ab Owen and young Rhisiart Mortimer. By the time they reach his mountain retreat, he is dying, and passes away just at the moment the pardon is about to be bestowed, causing Rhisiart ab Owen to cast the document into the fire. The insult to the king's message prompts a formal but non-fatal duel between Rhisiart and Talbot, which Rhisiart wins. The book ends with Owen's son, Meredith, returning from his father's cremation. There is an atmosphere of optimism about the future of Wales. The fates of the remaining major characters are made known in the course of the epilogue: Dafydd Gam is \"ransomed\" but remains Owen's servant; the ransom money is used to help construct Owen's last remaining hiding places, and Gam is later killed in the king's French wars. Mortimer dies before Harlech is taken, his wife Catharine is taken prisoner and dies of plague while in captivity, along with her daughters. Sibli leaps to her death from the battlements of the castle when it is taken by the English. Meredith is pardoned by the king and goes to live quietly with his wife, though they have no children. Elliw's father, Rhys Ddu, is killed during the taking of Aberystwyth Castle, an event for which Elliw blames Owen. Lowri has returned to live with Denis Burnell at Dinas Bran. Mad Huw died at about the same time as Master Shore, the man with whom Tegolin was living. Tegolin and Rhisiart have a daughter, Catharine, and are due to be reunited at last, just as the book ends."
}