{
    "book_id": "17914626",
    "mid": "/m/047nvk1",
    "title": "Passage",
    "author": "Lois McMaster Bujold",
    "publication_date": "2008-04",
    "genres": [
        "Speculative fiction",
        "Fantasy"
    ],
    "text": " Passage is the immediate sequel to Legacy in The Sharing Knife series. It takes farmer's daughter Fawn and Lakewalker maverick Dag back to her home farm as a first step on their 'honeymoon trip' to the Southern Sea, which is analogous to the Gulf of Mexico in The Sharing Knife series' alternate-world setting. At the farm they add the first of a considerable list of fellow-travelers: Fawn's older brother Whit. Once on their way again another odd companion is added by accident, quite literally, as Hod the charity-case helper of the teamster taking them to find flatboat passage on the Grace River (the Ohio River) gets his kneecap shattered by Dag's ill-tempered horse. This begins a series of events in each of which Dag's ground-working abilities are stretched past old limits, ground being the series setting's term for what might well be read as chi. Hod happens to owe much of his sloth and sly theft of edibles to a well-grown tapeworm, not suspected by his employer and only noticed in passing by Dag. But by his good curing works Dag has, as he feared, left himself open to an avalanche of farmer folk with ailments. He has, also, unwittingly beguiled Hod—Hod follows him, and wants more of Dag's ministrations. So there are dangers to the farmers he tries to cure, too. Much of the novel follows out his attempts to present what Lakewalkers do, how, and with what limitations, in ways that farmers should understand. This action violates long-standing Lakewalker secrecy about just these matters. Dag, in his effort to reduce a culture gap that has already led to violent misunderstandings, sees no choice but to risk apostasy. After he, with help from two other Lakewalkers, and many of the so-called farmers (in this book, the non-Lakewalkers mostly work with boats, not farms) defeats a renegade Lakewalker, who has been leading a group of murderers and robbers, Dag even demonstrates, for a group of farmers, the ceremony that turns a knife made from a bone from a deceased Lakewalker into a sharing knife. He also discovers how to remove a beguilement. The core of the novel is set on a flatboat, patterned on craft used in the middle 19th century to move goods downstream on America's navigable rivers, and large enough to need a crew of around eight (and with space for cargo, chickens, a goat, and Dag's horse). For the details of this pre-steamboat era Ms. Bujold has drawn from a number of histories and biographies, listed and annotated in an Author's Note page at the very end of the text. Like the rest of the series this is a romance, but one that rides on deeper questions of personal and social relationship, including those of leadership, honesty, caste relations and power. It also presents some clear moral choices, for those who were recruited to join the renegade Lakewalker. It ends with the motley crew, Lakewalkers and farmers, that has made its way to the mouth of the Gray River (the Mississippi River) having a picnic on the sands of the River's delta and considering the whens and hows of their return journey up-river. A fourth volume, The Sharing Knife: Horizon, published in January, 2009, completes the tetralogy."
}