{
    "book_id": "2683082",
    "mid": "/m/07xqxg",
    "title": "Passage",
    "author": "Connie Willis",
    "publication_date": "2001",
    "genres": [
        "Science Fiction",
        "Speculative fiction",
        "Fiction"
    ],
    "text": " Joanna Lander, a clinical psychologist, interviews patients who have had near-death experiences; she aspires to understand what occurs between the times when a person dies and then is revived. She becomes frustrated when many of her patients cannot or will not give accurate information about their experiences. She realizes that the scientific evidence is contaminated by the influence of Dr. Maurice Mandrake, a persistent charlatan \"researcher\" who publishes books about near-death experiences and convinces patients that their experiences happened exactly the way his books describe NDEs, such as learning cosmic secrets from angels. Dr. Richard Wright, who has discovered a way to induce artificial NDEs in patients and monitor their brain activity throughout, contacts Joanna and asks if she will join his research study and interview his patients after he induces NDEs. She agrees. They are intellectually compatible and have a budding, mutual romantic interest. Mandrake considers them competitors, and he sabotages their efforts by approaching revived patients before they can. Mandrake's method is to ask mellifluous leading questions of the patients and thereby taint their self-reported NDEs; this causes Joanna and Richard hardship in finding volunteers for the study. Lacking enough volunteers for proper methodology, Joanna elects to undergo the process. She gets the help of Tish, a good nurse, to help with the prep; Tish is happy to, because she thinks Richard Wright is \"cute\" and can flirt with him while Joanna is \"under\". Joanna finds herself in a dark passage that, through further NDEs, she realizes is part of a dream-like version of the RMS Titanic, on which she encounters passengers of the real Titanic as well as someone symbolically near death, a high school teacher of hers, Mr. Briarley. Between NDE sessions, Joanna struggles to figure out why she sees the Titanic, and she eventually tracks down Pat Briarley, her English teacher from high school, who spoke often of the Titanic in class. Joanna discovers that Mr. Briarley, once a highly animated and keen teacher, now suffers from Alzheimer's disease. This is crushing to Joanna, who was certain that Mr. Briarley could give her \"the key\" to clarify why she sees the Titanic. However, Mr. Briarley's niece, Kit, promises to help. Joanna also consults with Maisie Nellis, a girl who suffers from a heart defect, \"V-fib\", because Maisie, a born rationalist, gives only accurate information about her NDEs. Maisie also gives Joanna important information about the Titanic. Through talking with her patients and undergoing more NDEs, Lander realizes that the near-death experience is a mechanism that the brain uses to create a scenario symbolic of what the brain attempts to do when it is dying: find a suitable neural pathway by which to send a message that can \"jump start\" the rest of the body back into life. If the person having a real near-death experience can metaphorically send a message to someone appearing in the NDE, she learns (specifically, from a revived coma patient), the person will awaken and survive. Before she can tell Richard Wright about her discovery, she goes to visit Nurse Vielle in the Emergency Room and is stabbed by a man deranged by a drug called \"rogue\". Before losing consciousness, she manages to say a few words to Vielle, trying to communicate her discovery about NDEs. She finds herself in the Titanic again and races against dream-like obstacles to escape and awaken. Richard Wright, on hearing that Joanna is dying or dead, enters an artificial NDE, thinking that he will find himself in the Titanic and be able to rescue Lander. He instead finds himself at the offices of the White Star Line, where the names of the victims of the Titanic disaster are being read to the public - he is too late to \"save\" Joanna. He awakens many hours later, and Tish, crying, tells him that Joanna has died. As Richard and Joanna's friends struggle with her death, Joanna herself remains in the Titanic until it sinks, and her memories of life fade away. Richard realizes that Joanna was trying to tell him something before she died (they had discussed the importance of last words), and he tracks down all the people she spoke to before she was stabbed. He learns what Joanna discovered. Before she could reach him, Joanna had told, of all people, Mandrake, \"The NDE is a message. It's an SOS. It's a call for help.\" Grasping her dying message, Richard develops a chemical treatment that he believes can revive a patient. Maisie suffers V-fib and dies, but Richard successfully uses his experimental treatment on her, and she later receives a heart transplant; she will live. Within her final NDE, on an imaginary ship, Joanna finds herself adrift on the water, with some memories still intact and accompanied by a child and a dog which Maisie has told her about from other disasters. As the novel ends, they watch the approach of a ship repeatedly mentioned by Ed Wojakowski."
}