{
    "book_id": "1990831",
    "mid": "/m/03bx5wg",
    "title": "Pastwatch: The Redemption of Christopher Columbus",
    "author": "Orson Scott Card",
    "publication_date": "1996",
    "genres": [
        "Alternate history",
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " It is written in the form of two parallel lines, with alternating chapters in some ways reflecting each other, and which would converge only late in the course of the book. In the late 15th century Christopher Columbus is working slowly towards the trip across the ocean which would make him famous, and the story follows the many ups and downs of his career and especially his complicated relations with the women in his life. The early chapters, before travelers from the future impinge on his life, can in fact be read as a straightforward historical novel. In a parallel development, in a doomed future where humanity had used up the Earth’s resources and civilization is on the verge of collapse, a team of researchers has developed a machine called the “TruSite II” to view and record the events of the past. (The Concept of a \"Time viewer\" is discussed further on that page). The TruSite II had higher resolution, both visually and temporally, than an earlier competing machine known as the “TempoView,” and an even earlier machine, the “TrueSite I.” Though trying to restore the ravaged earth and preserve personal freedom, the PastWatchers discover that the society in which they live is doomed. The human race is reduced to a population of less than a billion after a century of war, plague, drought, flood and famine. There have been extinctions and the land is poisoned. Ecological damage from misuse of technology cannot be repaired quickly enough to save humanity from even more drastic population reductions, dooming their descendants to primitive, horrific lives for the remainder of the existence of life on Earth. They are endeavoring to record history for future generations, when it is revealed things are far worse than supposed. Upon discovering that the TrueSite II machines (unlike their predecessors) can send information into the past, the scientists set upon a mission to rewrite history and give humanity a second chance for survival. Their efforts are focused on Columbus, a pivotal figure whose religious zealotry and irrational fixation on the New World led to centuries of mass genocide and ecological devastation. When time travel technology is developed, three agents are sent back to the 15th century to alter Columbus’s actions for the better. It’s a one-way trip though, since their timeline along with everyone they know and love will be nullified in the process – an outcome only acceptable since that world is doomed to a fate far worse than extinction anyway. Another sub-story is the discussion about just why Columbus was so obsessed with his westward expedition. A study of his life reveals that the Pastwatch scientists were not the first to realize Columbus’s importance, and that people in a previous incarnation of the timeline had used Columbus’ westward ambition to alter history once before, an action which resulted in our own history. In this “original” history, Columbus never sailed the Atlantic and instead led a last European Crusade to capture Constantinople, taken by the Turks several decades previously. Meanwhile, the Aztec Empire fell and was replaced by an iron-wielding Tlaxcalan empire that was capable of recognizing technological advantages. The Tlaxcala were able to establish a more modern, centralized state and pushed their influence far beyond the old Aztec borders, though still confined to the Americas. This changed, however, when Portuguese sailors in the early 16th century began to be captured by the Tlaxcala and forced to teach them about firearms and large ship construction. This early contact also inflicted the European plagues on the New World empires, which suffered considerable loss of life – but the survivors acquired an immunity. The plagues and arrival of foreigners were taken as a sign that their god, Camaxtli, who demanded human sacrifice, wanted the Tlaxcala to embark on more wars of conquest. Europe of the 16th century was highly politically fragmented to begin with and further weakened by the crusade led by Columbus, and proved to be no match for the invading Tlaxcala armies. Moreover, while the Tlaxcala were already immune to European diseases, the Europeans were vulnerable to such American diseases as syphilis, which accompanied the conquering armies. Later on, the Tlaxcala discovered steam, developed a 19th century type industrial technology while keeping their bloodthirsty, human-sacrificing religion, conquered and enslaved the entire world and destroyed all cultures except for theirs. This history, while dire, eventually developed its own PastWatch which viewed the Tlaxcalan conquest of Europe as the single most tragic event in history. Thus they decided to redirect Columbus’s drive and ambition towards eliminating the fledgling Tlaxcalan empire when it was still vulnerable to European conquest. This action, while technically successful, failed in that they did not go far enough, only trading one flawed timeline for another. The three agents going back in time seek to achieve a balance, and create a timeline where neither Europeans nor Native Americans would cross the ocean on a wave of oppressive conquest. Enormous hard work and endless sacrifice are needed of the three. One of them must deliberately sacrifice his life in destroying Columbus’ ships and stranding him and his crews in the Caribbean. The other man, himself a Central American Indian, works among his own remote ancestors to create a less-aggressive alternative to both the Aztecs and the Tlaxcala. The woman is in the Caribbean, waiting to meet Columbus and his men after they are stranded, to reconcile them with the indigenous tribes and persuade them to share their technology; she eventually becomes Columbus’ lifelong wife and devoted companion. Meanwhile, an artificial germ developed by the genetic engineering of the world they came from is spread through the Americas, designed to give its population immunity to European diseases and thus preventing the decimation they suffered in our timeline upon contact with Europeans. Finally, after decades of hard work, the purpose is achieved: two federations of tribes, one in Central America and the other in the Caribbean, are amalgamated. The structure is held together by the various tribes’ respect for each other, and cemented by the European technology of the Spanish sailors with some additions from the later future, and by a form of tolerant and enlightened Christianity very different from that practiced in contemporary Europe, and especially the Inquisition-ridden Spain. Finally, Columbus returns to Spain more than twenty years after he had set out, at the head of fleet of warships crewed by his new countrymen – making clear that the people of the continent across the ocean can very well defend themselves against the Europeans, but that they come to Europe only for peaceful trade and cultural exchanges – thus averting the evils of both of the previous timelines. Late in his life, Columbus’ future-born wife tells him the truth and reveals the horrific deeds he might have perpetrated and instigated had she not intervened, and he weeps for days. The “redemption” of the title has been achieved. At the end a glimpse is given of this timeline’s Twentieth Century – a harmonious, peaceful and technologically-advanced utopia. Though not explicitly stated, it is implied that this timeline would also avoid the ecological devastation which destroyed its predecessor. Archaeologists in year 1951 (447 of the Humanist Era) disinter an abnormally heavy skull, discover the four indestructible sheets of metal surgically embedded into it by a science clearly more advanced than their own, and follow the indications to recover the three time travelers’ time capsule which will forewarn them of the possible futures."
}