{
    "book_id": "1713869",
    "mid": "/m/05qhvf",
    "title": "Possession: A Romance",
    "author": "A. S. Byatt",
    "publication_date": "1990",
    "genres": [
        "Speculative fiction",
        "Novel"
    ],
    "text": " Obscure scholar Roland Michell, researching in the London Library, discovers handwritten drafts of a letter by the prestigious (fictional) Victorian poet Randolph Henry Ash, which leads him to suspect that the married Ash had a hitherto unknown romance. He feels compelled to take away the documents secretly - an unprofessional act - and begins to investigate. The trail leads him to Christabel LaMotte, a minor poet and contemporary of Ash, and to Dr. Maud Bailey, a modern LaMotte scholar and distant relative of LaMotte's family, who is drawn into helping Roland with the unfolding mystery. They become obsessed with uncovering the truth and unearth more letters and evidence of an affair between the poets, and their own personal romantic lives - neither of which are happy or even satisfactory - develop and become entwined in an echo of Ash and LaMotte, whose story is told in parallel to theirs. The news of this affair will make headlines and reputations in academia, and colleagues of Roland and Maud become competitors in the race to discover the truth, for all manner of motives. And the truth is this: Ash's marriage was barren and unconsummated, although he loved and remained devoted to his wife. He and LaMotte had a short, passionate affair resulting in the suicide of LaMotte's companion (and possibly lover) and the secret birth of an illegitimate child, whose existence LaMotte sought to conceal from Ash, but whom he did once meet, unknown to her. As the Great Storm of 1987 strikes England, all the interested parties come together in a dramatic scene at Ash's grave, where documents buried with Ash by his wife are believed to hold the final key to the mystery. Reading them, Maud learns that rather than being related to LaMotte's sister, as she has always believed, she is in fact directly descended from LaMotte and Ash's illegitimate daughter, who was raised by LaMotte's sister and passed off as her own child, and she is therefore heir to their correspondence. Roland, freed from obscurity and a dead-end relationship, manages to live down the potential professional suicide of the theft of the original documents, and sees an academic career open up before him. Maud, who has spent her adult life confused and emotionally untouchable, finds her human side and sees possible future happiness with Roland. And the sad story of Ash and LaMotte, separated by the mores of the day and condemned to secrecy and separation, is resolved at last through Roland and Maud."
}