{
    "book_id": "4040714",
    "mid": "/m/0bf07d",
    "title": "Providence: The Story of a 50 Year Vision Quest",
    "author": "Daniel Quinn",
    "publication_date": "2000",
    "genres": [
        "Non-fiction"
    ],
    "text": " Quinn begins by describing the earliest incarnation of a book like Ishmael back in 1977, which Quinn at the time called Man and Alien. This manuscript was revised over the next several years, resulting in five more incarnations (The Genesis Transcript, The Book of Nahash, The Book of the Damned, and two entitled Another Story to Be In), none of which Quinn could successfully get published. At last, though, Quinn heard of the Turner Tomorrow Fellowship Award, which called for creative solutions to global problems. To win the award, though, Quinn was required to translate his long-brewing thoughts for the first time into a work of fiction: a novel. Quinn won the award with Ishmael but was left unsure, until now, about what he should write as a follow-up. Quinn details basic memories of his Depression-era childhood in Omaha, Nebraska: specifically, the occurrence a dream in 1941 that he feels has influenced the rest of his life. In the dream, a tree is blocking the middle of a road he is traversing. A beetle crawls down the trunk to greet him and tells him that itself and other animals deliberately downed the tree to get Quinn’s attention in order to talk with him. Quinn is dumbfounded as the beetle says that the animals need to tell him the secret of their lives. Quinn is then expected to follow a deer into the forest, because he is for some reason needed by the animals, but before he can venture on, he awakes. Quinn recounts the gambling habits of his father (who he feels may have been friends with Meyer Lansky) and the sudden appearance of severe obsessive-compulsive tendencies in his mother. Quinn’s parents habitually fought, each unable to understand the other’s behaviors. Quinn feels his reaction to this was to try to perfect in himself what was unachievable with his parents in their relationship. Quinn’s desire for perfection led him to an interest in the arts and a belief in Catholicism. Quinn received a full scholarship to St. Louis University because of his writing, though left after two years to devote his life to his religion, by becoming a Trappist monk at age nineteen. Greatly influenced by Thomas Merton’s The Seven Storey Mountain, Quinn went to the Abbey of Gethsemani in Kentucky. At Gethsemani, Merton in fact became Quinn’s personal spiritual director. As a postulant at the monastery, Quinn decided after a troublesome moment at the monastery, involving a miscommunication with a novice, that he had to either completely submit his will to that of God or else he had to leave the monastery. Summoning his strength, Quinn made the choice of submission to the complete guidance of God. The next time he stepped outside (having been indoors for three entire weeks), Quinn experienced an unexpected moment of explosive, positive emotion, which he interpreted as infused contemplation, meaning utter centeredness on God: a feeling he describes as a \"rage of joy.\" Quinn convinced himself at the time that this awe-striking moment of beauty with the world was evidence of God's approval of his decision to submit. Quinn told an incredulous Merton of this amazing experience, but was soon discharged from the monastery by Merton, who attributed the reason for Quinn’s dismissal to the recent results of a Rorschach test. Quinn was crushed by his expulsion and began to see a psychoanalyst, as recommended by Merton. Quinn continued with his lifelong inability to understand his own sexuality, largely since his father always assumed him to be homosexual and because his current therapist thought him unready to be in any serious relationships. Quinn, however, soon married a woman who later left him for another man. During this whole time, Quinn continued to struggle with his self-destructive need to be perfect. When Quinn talked to a priest who claimed to worry more about people than rules, Quinn’s religious worldview began to crumble and he became an atheist. Quinn then got a job in educational publishing, which instigated his questioning of the educational system of the United States; this came with the rise of the Flower Children of the 1960s. Quinn briefly mentions the failure of his second marriage and his own willing movement toward going back to psychotherapy. Quinn began to realize in therapy that his entire technique with social situations was to merely trick others into thinking he was worth knowing, while he actually believed himself valueless. One day, however, he was idly making a list of all his valuable attributes when he suddenly realized that he did not need to try to fake his personality in front of people; he did not need to be perfect&mdash;merely human. Quinn explains that this newfound insight gave him the courage to ask out his future (and current) wife, Rennie, on their first date. Quinn then delivers his most recent understanding of learning and education, notably including the idea that formal education is an unnecessary social institution, since children learn automatically by following the behaviors of fellow members of their culture and by pursuing their own innate interests (which rigidly-structured public schools largely stop from happening). He also refers to his discontents with how history is studied in its disregard for tribal societies, reiterating many of the themes from Ishmael. Finally, he examines religion, including his own more recent advocacy of animism, which he considers the one-time world religion with its refreshing lack of any sacred text, institutions, or dogma. He revisits the memory of his “rage of joy” moment, now understating it in animist terms. He concludes with the thought that many needy people (like himself prior to his epiphany) are just those who do not feel needed. He asserts that the reader should feel needed because he or she is needed: needed desperately by the community of life to understand humanity's forgotten interdependence with the rest of that community."
}