{
    "book_id": "424680",
    "mid": "/m/026wy0",
    "title": "Quarantine",
    "author": "Greg Egan",
    "publication_date": "1992",
    "genres": [
        "Hard science fiction",
        "Science Fiction",
        "Speculative fiction",
        "Fantasy",
        "Fiction"
    ],
    "text": " The novel is set in the near future (2034–2080), after the solar system has been surrounded by an impenetrable shield (constructed by either aliens or extra-solar humans) known as the Bubble. The Bubble permits no light to enter the solar system, and as a consequence the stars can no longer be seen. This seems to be mere background at first, but in fact it is central to the plot. In the novel a physical process in the human brain is responsible for collapsing quantum wavefunctions representing systems into particular eigenstates. Human observations of the universe were reducing its diversity and potentiality (for instance, by rendering it uninhabitable to beings that relied on stars being something other than the enormous nuclear fusion-powered furnaces human astronomers have observed them to be). Hence it is suggested that the Bubble was constructed to prevent humanity from wreaking massive destruction on the rest of the universe through the process of mere observation. In the course of the novel, the situation is further complicated when human researchers discover a way of modifying the brain to provide conscious control over the process, allowing people to suspend wavefunction collapse at will, and to choose which state the wavefunction will collapse to. This allows a person to choose how any nondeterministic event (such as flipping a coin) will turn out, provided that he is not being observed by anyone who is still involuntarily collapsing wavefunctions. This is used to perform a variety of low-probability tricks, such as tunneling through locked doors or getting past guards who happen to all be looking the other way as the person passes. The novel contains ideas not related to quantum mechanics. Of particular note is the fact that people habitually download software to run in their brains. Such \"neural mods\" (whose titles are always given in boldface, such as Sentinel or P3) are installed by insufflating several drops of fluid carrying genetically modified microorganisms, which in turn carry nanomachines capable of rewiring nerve cells. The story's narrator accepts a case to investigate the disappearance of a woman from a psychiatric Institute, which leads him to the Ensemble. This is an organization that is developing a wavefunction collapse inhibitor neural mod, the \"eigenstate mod\". This mod allows the user to stop being an observer in the sense of quantum mechanics and consequently to \"smear\", i.e. to exist in a superposition of different states at the same time and to pick eigenstates of personal preference from the range of possible states, when the personal wavefunction is collapsed. He is put under the control of the Ensemble by the forced installation of a \"loyalty mod\" in his brain which makes loyal support for the organization his highest goal. The narrator meets a group of other Ensemble loyalists (the Canon) who have discovered that their keepers have failed to specify exactly what they are to be loyal to (except by its name) and consequently, being its most loyal members, start to define what the Ensemble is themselves. The narrator, working with the Canon, then proceeds to steal the eigenstate mod. A rogue member of the Canon infects all of humanity with the software. (Normally, neither the microorganisms nor the nanomachines involved in installing neural mods can survive long outside the human body, but in this case the rogue scientist uses the eigenstate-control mod to modify their properties.) As a result, causality is weakened all over the globe, and the untrained humans, not knowing what to do with their newfound freedom, break down the fabric of reality as the stars suddenly reappear in the sky then turn into an almost blinding flash as the heavens fill with lights and possibilities undreamed of... Then things suddenly are back to normal (less the loyalty mod) and two main characters debrief each other on a park bench, trying to understand how the \"smeared\" humanity was able to control events BEFORE people were all infected with the eigen-mod and WHY the \"smeared\" humanity chose to return the world to normal (one theory put forward is that they reached the edge of the bubble, had a nice chat with the aliens and decided to go home and enjoy life as it was)."
}