{
    "book_id": "7824051",
    "mid": "/m/026fbhh",
    "title": "Rescuing Da Vinci: Hitler and the Nazis Stole Europe's Great Art - America and Her Allies Recovered It",
    "author": "Robert M. Edsel",
    "publication_date": "2006",
    "genres": [
        "History",
        "Non-fiction",
        "Photography"
    ],
    "text": " This book focuses on an aspect of World War II that is largely ignored in many history books – the Nazi looting of Europe and Russia and the Allied recovery and repatriation of stolen art. Little known to the general public, Hitler diverted his attention from the prosecution of the war to the systematic theft of Europe’s great art. His dream was to build the world’s greatest collection – The Führermuseum – in his hometown of Linz, Austria. European museum officials took extraordinary measures to protect art from Hitler and the ensuing war. When U.S. forces prepared to enter Europe, they assembled a special force of largely American and British museum directors, curators, and art historians known as the Monuments, Fine Arts, and Archives program (MFAA) section, attached to the Allied armies. These “Monuments Men” attempted to minimize damage to European monuments and architecture, then track down stolen works of art. Their effort would become one of the greatest “treasure hunts” in history. In the end, Allied forces located more than 1,000 repositories in mines and castles across Europe, many of which were filled with art, sculpture, furniture, archives, and other cultural property stolen by the Nazis. Edsel points out that thousands of pieces are still missing, such as Raphael’s Portrait of a Young Man from the Czartoryski Museum in Kraków, Poland. Rescuing Da Vinci tells this story through brief text and more than 460 photographs, 60 of which are in color. This group of photographs has never been published in a single book, and many have not been seen in decades. Images such as Michelangelo’s David entombed in brick for protection or a Rembrandt Self Portrait sitting atop crates in a salt mine, capture the story better than words could describe."
}