{
    "book_id": "2444502",
    "mid": "/m/07dhjv",
    "title": "Resident Evil: Underworld",
    "author": "S. D. Perry",
    "publication_date": "",
    "genres": [
        "Speculative fiction",
        "Horror"
    ],
    "text": " Leon S. Kennedy, Claire Redfield, Rebecca Chambers, and the survivors of the Caliban Cove incident, John Andrews and David Trapp, are en route to Europe to rendezvous with the other surviving STARS members for further operations against the evil Umbrella Corporation. While in the air, their plane is redirected by the mysterious Trent, an enigmatic figure who has been guiding and manipulating events throughout the entire series of novels. Trent informs the group of an Umbrella facility in Utah, used to test and train the company's experimental biological weapons. The facility's overseer, a man named Reston, is one of three people in the world in possession of a codebook which would allow access to all of Umbrella's most secret documents. Trent wants the group to infiltrate the facility, steal the codebook, and take down Umbrella once and for all. The group reluctantly agree to Trent's plan and make their way into the Umbrella facility, but soon after arriving, Leon and John are separated from the others and find themselves trapped within the facility's testing area. The two of them are forced to trek across four massive, artificial environments while evading Umbrella's deadliest new monsters. All the while, David, Claire, and Rebecca fight to avoid detection and possible capture by armed Umbrella guards. Leon and John are helped by Henry Cole, an innocent electrician drawn into the fight against his will. The heroes must deal with Jay Reston, the head of this Umbrella facility, which is called the Planet. In the end, most of the B.O.W.'s (bio-organic weapons) are destroyed and Reston is killed after Leon and John release a monstrous B.O.W. called \"Fossil\", shortly before the facility is destroyed. Unbeknown to the group as they fly away to safety, Rebecca successfully managed to steal Reston's codebook from him, giving them access to Umbrella's security systems. In addition Trent's motivations are finally revealed to be revenge on Umbrella for the murder of his father and mother, who were the original creators of the T-Virus which was developed to cure cancer and other diseases before being stolen by Umbrella to be used as a weapon."
}