{
    "book_id": "6530724",
    "mid": "/m/0g93k9",
    "title": "Rules of Engagement",
    "author": "Elizabeth Moon",
    "publication_date": "",
    "genres": [
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " At the end of Once a Hero, Esmay decided to pursue higher rank and command. Pursuant to this, she has transferred to a Fleet training base on the Fleet-owned planet Copper Mountain. Coincidentally, this is the same base that Brun is training at in various useful skills like escape and evasion. Simultaneously with their training, the podunk colony planet of \"Our Texas\" is up to its old piracy tricks using its share of the \"New Texas Godfearing Militia\"; it is using certain converts in the Familias to steal Fleet nuclear warheads and intercept them. Brun intends to befriend Esmay but is rejected; Esmay finds Brun to be shallow and is far too preoccupied with her staggering course load to be constantly hanging out with Brun. The final break occurs when Brun is forbidden by the base commandant and her father to participate in the field exercise which is the culmination of the Escape & Evasion course because of the scope it offers would-be assassins - already two attempts had taken place, one of which put Brun in the base hospital for a month. Brun storms down to Esmay's quarters to harangue her, accusing Esmay of not wanting to do the field exercise with her and getting her forbidden; Esmay is more than willing to reciprocate as she has learned of Brun's attempts to woo Barin away from Esmay. Brun is cut to the quick by some of the truths Esmay speaks and by her complete rejection (Brun having looked up to Esmay as a hero or almost a big sister), and leaves the base. She occupies herself travelling and inspecting various investments. Esmay is severely reprimanded for having spoken to the Speaker's daughter in such a fashion, and is assigned far away to a Search-and-Rescue (SAR) space vessel as its executive officer. After Brun leaves, the New Texas Godfearing Militia strikes, stealing the commercial hauler which is unknowingly carrying their stolen weapon; they space all the adults aboard (mutilating the women whom they describe as \"abominations\") and kidnapping the children and a teenaged girl named \"Hazel\". Brun happens to stumble on the scene (having discovered the commercial hauler's secret short cut) while the Militia was still practicing with the hauler. Against her bodyguard's better judgement, she sneaks in closer in her small yacht to see what was happening. Inevitably, the Militia notices and their warships begin maneuvering to capture the witness. Brun had not expected this, but began the complex and advanced maneuvers that would get her safely away - to discover that her chartered yacht had various safety interlocks in its computer navigation systems to prevent its users from doing anything possibly unsafe. Brun is captured by the Our Texans. As per their religious beliefs, her bodyguard is slaughtered to the man, and the Rangers decide to make Brun herself into their conception of a proper wife by having her surgically muted. She is then repeatedly gang-raped until she becomes pregnant with twins. She is transported to Our Texas and imprisoned in a maternity home while she gives birth; like all women so abducted, the plan is that she will give birth three times; if she is not dead of childbirth or executed for disobedience, she will then be auctioned off to the highest bidder to serve as perhaps the man's third or fourth wife. Records of all the proceedings are sent back to the Familias; the Ranger in charge is not completely suicidal, but believes that the threat of blowing up one of the thousands of Familias space-stations will deter any military response. Back in the Familias, suspicion and rumor (aided by less talented and jealous former classmates) and Lord Thornbuckle fasten on to Esmay as the culpable agent to blame. Somewhat fortunately for Esmay, at this unpromising juncture her great-grandmother dies. Esmay is the designated next female in the succession of the Landbride, so she inherits the title and the assets like the land. The Fleet gladly grants her leave, and her stay on Altiplano lasts just long enough for her cousin Luci to knock some sense into Esmay's head and convince her to return to Fleet and try to reconcile with Barin. She succeeds and planning for the rescue of Brun slowly proceeds; it will be timed for when Brun's twins are almost finished nursing and the time for Brun to be impregnated draws near. Presumably she will be at her best in this period. A Guerini agent will take her from the maternity facility and drive her to the spaceport. His shuttle will boost off the planet and be picked up by a Familias SAR spaceship, backed up by a decent sized task force in case the four Our Texan warships attempt to interfere. In the mean time, Brun has been preparing on her own for an escape: physically conditioning her body, brewing alcohol (to knock out her babies so their crying does not reveal her escape), and acquiring kitchen knives as weapons. The agent approaches Brun during her first practice escape, and also picks up the teenager from the merchant vessel at Brun's vigorous urging. The flight up is uneventful until the agent is offered more money by the Our Texans and changes his course to one of their warships while Hazel and Brun slept. When Brun wakes up and realizes his treachery, she kills him and seizes control of the shuttle. But the shuttle has already approached too close to the planet to escape, and she is forced to dock at an abandoned space station under heavy missile fire. The shuttle is sent on a suicide plunge into the atmosphere as a decoy, but this does not fool the Rangers, who dispatch several shuttles to destroy the station once and for all. The expert system aboard decides to help Brun and Hazel. Brun has it send a message to the Fleet SAR that she is aboard the station and not dead, and squads of neuro-enhanced space marines arrive on the station just after the three Texan shuttles unload. Another faction of Texans seize the opportunity to attempt to eliminate the first faction's troops. In the confusion, Hazel is evacuated but Esmay and Brun are blown into space by some bombs. Esmay suffers from hypoxia before the two are rescued by a space sled. By this point, the rest of the Fleet units have jumped in and easily blown the four warships guarding Our Texas. With Our Texas supine before the task force, Brun tasks Admiral Serrano with retrieving the four children captured by the Texans with Hazel. The retrieval initially goes well, as the Ranger's household, led by his first wife, cooperates, and attaches itself to Barin as their \"protector\". The other Rangers's successors (the Rangers themselves either dead or captured) do not intend to allow the heathens to take back children now being raised as God wants, and plan to use their stolen nuclear bombs to kill them all. With some effective help from the marines and theft of the arming keys, the threat is defused and many civilian lives saved. Esmay, Barin, and Brun are all reconciled, with the sole remaining threat being the enthusiastic media coverage."
}