{
    "book_id": "9648490",
    "mid": "/m/02pn1rp",
    "title": "Running Blind",
    "author": "Lee Child",
    "publication_date": "2000-07-13",
    "genres": [
        "Thriller",
        "Mystery",
        "Novel",
        "Fiction",
        "Suspense"
    ],
    "text": " The prologue opens with a mystery person's point of view on knowledge, power and killing, \"People say that knowledge is power. The more knowledge, the more power. Suppose you knew the winning numbers for the lottery? You would run to the store. And you would win. Same for the stock market. You're not talking about a trend or a percentage game or a whisper or a tip. You're talking about knowledge. Real, hard knowledge. You would buy. Then later you'd sell, and you'd be rich. Any kind of sports at all, if you could predict the future, you'd be home and dry. Same for anything. Same for killing people.\" The story begins in New York City, with Reacher confronting and beating up two thugs sent to collect protection racket money from the new restaurant he was eating in, during which he deliberately implies that he is a member of a rival crime organization. Reacher is picked up by the FBI and questioned on who he is working for, but explains he is a loner and has been since he mustered out of the army. He is then questioned about two women whose cases of sexual harassment he dealt with when he was an MP and it is revealed they have both been killed in the last few months and a criminal profiling team have come to the conclusion that the person responsible was someone exactly like Reacher. Reacher's girlfriend arrives, Jodie Garber-Jacob, and after further questioning, Reacher is let go. Jodie returns to work, and Reacher drives to his house in upstate New York that he inherited from Leon Garber. He is soon called upon by two members of the FBI team that previously questioned him. They reveal a third women has been killed, also an ex-soldier who filed for sexual harassment—albeit in a different timeframe than the first two. The FBI asks him to help out the investigation, and Reacher refuses—up until they blackmail him, saying that the thugs Reacher beat up at the start of the story may gain access to Jodie's address if he doesn't cooperate. Reacher and Special Agent Lamarr, the lead profiler on the team, drive from New York to the FBI Academy in Quantico, Virginia, while discussing information on the case, which reveals that Lamarr's stepsister is a woman with the same particulars as the three already killed. Lamarr also reveals the killer's M.O., which is killing the victims in an unknown way, with no bruises or injuries, leaving them naked in their bathtub, filled with army-issue camouflage paint. The team hold several meetings at Quantico, and Reacher meets Lisa Harper, the woman who has to accompany Reacher wherever he goes. Reacher suggests contacting Colonel John Trent, who owes Reacher a big favour, at Fort Dix to try and get a trace on the paint. Reacher and Harper head up to New Jersey, but while Harper remains outside the colonel's office due to security clearance reasons, the colonel helps Reacher sneak out the window and arranges a four hour trip to New York. Back in NYC he targets a random pair of criminals collecting protection money in an ethnic area, beating them up and telling them he's from Petrosian's gang, from which he beat up two members at the beginning of the story. Reacher completes his objective in time, removing the leverage that the FBI is threatening him and Jodi with, effectively turning the two crime mobs on each other. He then returns with Harper oblivious to this. The team continue their search, and the next victim is Agent Lamarr's stepsister. Local policemen are then put on duty of the remaining women on the list. Eventually Reacher and Harper catch the killer: Lamarr. She is in the process of killing her fifth victim when the two interrupt her and Reacher punches her, breaking her neck and killing her. Reacher and Harper come to the conclusion that Lamarr was utilising her hypnotising techniques in order to make the victims comply with her orders, before making them stick their tongue down their own throat to suffocate themselves. Her motive was to get the inheritance from her stepsister, the other victims were only a smoke screen. The FBI is unhappy that Reacher has killed one of their agents and threatens to prosecute him, but an agreement is made. Reacher then meets up with Jodie, and she reveals she is leaving for London in a month's time. Reacher knows he will not want to go with her, and the two agree to spend one last month together."
}