{
    "book_id": "1037400",
    "mid": "/m/040f_6",
    "title": "Sanctuary",
    "author": "William Faulkner",
    "publication_date": "1931",
    "genres": [
        "Fiction"
    ],
    "text": " In May 1929, a lawyer named Horace Benbow, frustrated with his life, his spouse, and his stepdaughter, suddenly leaves his home in (fictional) Kinston, Mississippi, and sets out to hitchhike his way back to Jefferson, his hometown in Yoknapatawpha County, where his widowed sister Narcissa Sartoris lives with her son and her late husband's great-aunt (Miss Jenny). On the way to Jefferson, he stops for a drink of water near the \"Old Frenchman\" homestead, which is occupied by the bootlegger Lee Goodwin. Benbow encounters a sinister man called Popeye, an associate of Goodwin's, who brings him back to the Goodwin place, where he meets Goodwin, his common-law wife Ruby, and some other members of Goodwin's bootlegging operation. Later that night, Benbow catches a ride from Goodwin's place into Jefferson. He explains to his sister and Miss Jenny that he has left his wife, and then he moves back into his parents' house, which has been sitting vacant for years. Gowan Stevens, a young graduate of the University of Virginia, who proposed marriage to Narcissa (and was turned down), has a date with Temple Drake, a student at Ole Miss. Temple is something of a \"fast girl\" with a reputation among the town boys in Oxford; her name has been scrawled in the men's rooms at Ole Miss with allusions to her easy virtue. Her father is a well-known and powerful judge, so she comes from a world of money and high society. She is pretty, but shallow; simultaneously fascinated and repelled by sex and by basic human urges. After escorting Temple to a Friday-night dance in Oxford, Gowan plans to meet her the next morning at the train station, where she is supposed to join her classmates on a chaperoned excursion to a baseball game in Starkville; she is supposed to get off the train, escaping her chaperones, and ride to the game with Gowan instead. After he has dropped Temple off after the dance, Gowan, an alcoholic who claims he \"learned to drink like a gentleman\" in Virginia, offers some local town boys a ride into town. He gets them to help him obtain a quart of moonshine, which he magnanimously shares with them, apparently so that he can impress them with his capacity for liquor consumption. He gets extremely drunk and passes out by his car at the train station. The next morning, Gowan awakens with a massive hangover, to discover that he's just missed the Starkville train. He finishes off his jar of moonshine and speeds off to intercept the train, picking up Temple in the town of Taylor. On the way to Starkville, he decides to stop off at the Goodwin place for some more booze. Drunk already, he crashes his car into a tree which Popeye, apparently worried about a police raid, has felled across the road. Popeye and Tommy, who happen to be nearby when the accident happens, take Temple and Gowan, who are banged up but not seriously injured, back to the Goodwin place. Temple is terrified, both by Gowan's recklessness and drunkenness, and by the strange, menacing, lower-class milieu into which he has brought her. Immediately upon arriving at the Goodwin place, she meets Ruby, who warns her that it would be a good idea to leave the Goodwin place before nightfall. Gowan is given more liquor to drink by Tommy, a good-natured apparent \"halfwit\" who works for Goodwin and lives at the house. Night falls. Gowan is, yet again, crudely drunk, and Temple has not taken Ruby's advice and made herself scarce. Goodwin returns home and is less than happy to find Gowan and Temple there. He has brought Van, another member of his bootlegging crew, with him. All the men continue to drink; Van and Gowan argue and provoke each other, nearly coming to blows several times over the course of the evening. Van makes crude advances toward Temple, rousing in the drunken Gowan a sense that he, a would-be Virginia gentleman, needs to protect Temple's honor. Temple, out of her mind with apprehension, constantly runs in and out of the room where the men are drinking, despite Ruby's advice that she stay away from them, and despite Van's leering unwelcome advances. Temple ensconces herself in a bedroom. Van and Gowan come to blows; Van quickly knocks out the drunken Gowan. The men carry him into the room where Temple is cowering and throw him on the bed. They come in and out of the room several times and harass her. Finally, the men leave on a whisky run in the middle of the night. The next morning, Gowan awakens and slinks silently away from the house, abandoning Temple. Temple is still terrified the next morning, even though most of the men don't seem to be around. The good-natured Tommy hides her in a corn crib in the barn; Popeye soon discovers them there. He murders Tommy with a gunshot to the back of the head and then proceeds to rape Temple with a corncob. After he has raped her, he puts her in his car and drives to Memphis, where he has connections in the criminal underworld. Goodwin discovers the dead Tommy, and Ruby calls the police from a neighbor's house. The police arrest Goodwin, believing that it is he who has murdered Tommy. Goodwin is terrified of Popeye, so he tells the police nothing beyond a flat denial of guilt. Goodwin is brought to the jail in Jefferson. Benbow finds out about the matter and immediately takes on the task of Goodwin's legal defense, even though he knows that Goodwin cannot pay him. Benbow tries to let Ruby and her sickly infant child stay with him in his house in Jefferson, but his sister Narcissa, who is half-owner of the house with him, refuses to allow her to stay there, with or without Benbow. Ruby is known in town as a fallen woman with an illegitimate child, who \"lives in sin\" with whiskey-running Lee Goodwin; Narcissa finds the idea of her family name being gossiped about town in connection with a woman like Ruby completely unacceptable. In order to satisfy his sister's wishes and the prevailing societal mores in Jefferson, Benbow has no choice but to put Ruby and her son in a room at the hotel. Benbow, an idealist and strong believer in truth and justice, tries unsuccessfully to get Goodwin to tell the court about Popeye. Goodwin feels that Popeye is capable of killing him, even in jail; he also has faith in his innocence, so he refuses. Benbow soon finds out about Temple and her presence at Goodwin's place when Tommy was murdered (a fact which the Goodwins had originally been reluctant to share with Benbow). Benbow heads to Ole Miss to look for Temple. He discovers that she has left the school. On the train back to Jefferson, he runs into an unctuous state senator named Clarence Snopes, who tells him that he read in the newspaper that \"Judge Drake's gal\" Temple has been \"sent up north\" by her father. In reality, Temple is living in a room in a Memphis bawdy house owned by Miss Reba, an asthmatic widowed madam, who thinks highly of Popeye and is happy that he's finally chosen a paramour. Popeye keeps Temple there for him to come and visit whenever he feels like it. However, as he is impotent, he brings Red along and forces him and Temple to have sex while he watches. When Benbow returns from his trip to Oxford, he finds out that the owner of the hotel has buckled under the weight of steadily growing public disapproval and has kicked out Ruby and her child. Benbow tries again to convince Narcissa to let Ruby stay in the house they own, and again she refuses. He finds a place for Ruby to stay, outside of town, in a shack with a crazy lady who ekes out a wretched living as a fortuneteller. Clarence Snopes visits Miss Reba's brothel in Memphis and discovers that Temple is living there. He realizes that this information might be valuable to Benbow (who, Snopes remembers, was looking for Temple at her school) and also to Judge Drake (Temple's father). He offers to sell Benbow the information, hinting that he might sell it to \"another party\" if Benbow says no. After Benbow agrees to pay Snopes for the information, Snopes tells Benbow that he's seen Temple at Miss Reba's house in Memphis. Benbow immediately heads to Memphis and convinces Miss Reba to let him talk to Temple. Miss Reba imagines Ruby and the child left to fend for themselves if Goodwin is wrongly convicted, and is sympathetic to the Goodwins' plight, although she still admires and respects Popeye. Temple tells Benbow the story of her rape at Popeye's hands. Benbow, shaken, returns to Jefferson. Temple has become thoroughly corrupted by now. She bribes Minnie, Miss Reba's servant, to let her sneak out of the house for fifteen minutes. She makes a phone call from a nearby drugstore. She leaves the house again in the evening, only to find Popeye, who has had the house under surveillance, waiting outside in his car. He takes her to a roadhouse called The Grotto. Temple had arranged to meet Red, a popular young gangster, at this club. It becomes apparent that Temple has been having sex with Red, and that Popeye has been watching them. This evening, Popeye has planned a confrontation with Red to settle once and for all with whom Temple will remain. At the club, Temple drinks heavily and tries to have furtive sex with Red in a back room, but he spurns her advances for the moment. Two of Popeye's gangster friends frog-march her out of the club and drive her back to Miss Reba. Popeye kills Red. This turns Miss Reba against him. She tells some of her friends what has happened, hoping he will be captured and executed for Red's murder. Benbow writes to his wife, asking for a divorce. His sister Narcissa visits the District Attorney and tells him she wants Benbow to lose the case as soon as possible, so that he will cease his involvement in such a sordid affair. Once the DA assures her that Benbow's client will be convicted, she writes to Benbow's wife to tell her that he will soon be returning home. Senator Snopes arrives in town with a black eye, complaining that he was hit by a \"Memphis jew [sic] lawyer\" who wouldn't pay him a reasonable amount for the information he was offering. Benbow tries to get back in touch with Temple via Miss Reba, who tells him that Popeye and Temple are gone. The trial begins on the 20th of June. It goes badly for Goodwin, who continues to believe that Popeye will show up in Jefferson, at any moment, and kill him. On the second day of the trial, a Memphis lawyer shows up with Temple Drake in tow. She takes the stand and stuns the courtroom with shocking (and false) testimony that Goodwin (not Popeye) shot Tommy and then raped her. Even more shocking is the DA's revelation of a key piece of evidence: a bloodstained corn cob. It was with that corncob that Temple was raped (by Popeye, of course, who is impotent). After perjuring herself, Temple is led out of the courtroom by her father, Judge Drake. The jury finds Goodwin guilty after only eight minutes of deliberation. Benbow, devastated, is taken back to his sister's house. He wanders out of the house, distraught, in the evening, and goes back into town, where he sees Goodwin's dead body burning in a gasoline bonfire; he has been dragged out of jail, tortured and lynched by an angry mob. Benbow is recognized in the crowd, which speaks of lynching him, too. The next day, Benbow returns, defeated, to his wife. Popeye, ironically, is arrested and hanged for a crime he never committed, while he's on his way to Pensacola, Florida to visit his mother. Temple and her father make a final appearance in the Jardin du Luxembourg, having found sanctuary in Paris. See also Requiem for a Nun (1951), a play/novel sequel to Sanctuary."
}