{
    "book_id": "7663148",
    "mid": "/m/02686l6",
    "title": "Saturnalia",
    "author": "Grant Callin",
    "publication_date": "",
    "genres": [
        "Science Fiction"
    ],
    "text": " In the late twenty-first century, a system of space colonies, known collectively as SpaceHome, is slowly winning economic independence from Earth. SpaceHome's president, George Ogumi, is singleminded in this pursuit. Things are shaken up when SpaceHome discovers an alien object on a moon of Saturn. SpaceHome University's sole archeologist, Dr. Kurious Whitedimple (who constantly reminds amused inquisitors his name is pronounced \"KOOR-ee-us\"), is called in for his opinion by Ogumi. Whitedimple (called Whitey) is able to interpret the message—for so it is. The message is: there are three other identical messages on other moons, a fifth hidden somewhere in the rings of Saturn which will give directions to a sixth artifact, of immense importance. Dazzled by Ogumi, Whitey loses sight of odd things going on around him, and is swiftly shipped off to Saturn to recover the rings artifact, despite an \"accident\" that nearly kills him. On arrival, Whitey is introduced to Junior Badille, his pilot. Born in high-radiation outer space, Junior is a mutant supergenius, whom Whitey affectionately refers to as \"the runt\" and \"the gnome\". Earth has not been quiet, and sends off its own expedition. The Earthers open fire, but Whitey and Badille are able to outmanoeuver them and recover the artifact. The message on the artifact is that the sixth artifact is located on Saturn's liquid surface. (At this point, the short story ends.) Both Earth and SpaceHome gear up for massive efforts. Junior and Whitey, who have formed a strong bond, part, and Whitey returns to teaching classes at the university, first having strong words with Ogumi over what Whitey deems to be deceit. However, SpaceHome has become too small for Whitey now. He enrolls in space pilot training and becomes a brilliant student. As Whitey qualifies, Junior, now the brains behind SpaceHome's Mimas-based efforts to recover the last artifact, stages a strike—Whitey must return or Junior will be so \"depressed\" he cannot work. Ogumi has little choice but to send Whitey back to Saturn as a pilot. Whitey becomes the lead pilot for the recovery effort. However, an Earth expedition stages a simultaneous attempt, and at first seems to have everything going for it, until it suffers massive malfunctions. Whitey sacrifices the mission to dive deep into Saturn's atmosphere and rescue the Earth pilot and his vessel. While he is still recovering, SpaceHome's backup mission recovers the artifact. The artifact proves to be a much more complex message—there is a starship at a specified location in the outer solar system. When activated, it is assumed that the ship will take anyone aboard to the aliens' star system. As the story ends, Earth and SpaceHome work together to mount a joint expedition."
}