{
    "book_id": "493408",
    "mid": "/m/02h1xm",
    "title": "Scaramouche: A Romance of the French Revolution",
    "author": "Rafael Sabatini",
    "publication_date": "1921",
    "genres": [
        "Historical novel"
    ],
    "text": " Andre-Louis Moreau, educated as a lawyer, lives in Brittany with his godfather, M. de Kercadiou, who refuses to disclose Moreau's parentage. Moreau considers Aline, Kercadiou's niece, as his cousin. Because he loves her as a cousin he warns her against marrying the Marquis de la Tour d'Azyr; however, she is ambitious and wishes to marry high, so she ignores him. A peasant, Mabey, is shot by the gamekeeper of the Marquis de la Tour d'Azyr, on the Marquis's instructions, for poaching. Moreau's closest friend, the idealistic Philippe de Vilmorin, denounces the act as murder. He is provoked to a duel with the Marquis and killed for his \"gift of eloquence\" which the Marquis fears would set the Third Estate against the privileged estates. Moreau then vows to avenge the death, and sets off from his hometown of Gavrillac for Rennes to the King's lieutenant in Brittany, to see justice done. After being brushed off by the arrogant official, who refuses to act against a man of the Marquis' status, Moreau discovers a large political gathering. Much to the surprise of his peers, he delivers convincing rhetoric, using Vilmorin's arguments. Moreau goes on to Nantes and whips up the crowds there. These events set the stage for the French Revolution, and make Moreau a wanted man. To hide from the law, Moreau joins a troupe of travelling Commedia dell'Arte actors under M. Binet. He takes on the role of Scaramouche, the scheming rogue. He discovers an aptitude for acting and writing, which propels the troupe from near-poverty to success which takes them to the Feydau theatre in Nantes. Binet, who plays Pantaloon, grows ever more resentful of Moreau and his influence in the troupe. Moreau becomes engaged to Binet's daughter, but she, disappointed to find out that Moreau is of no account, accepts a proposal from the Marquis to become his mistress. The Marquis, now notorious for brutally quelling an uprising in Rennes, is lying low in Nantes. When the Marquis attends a performance, Moreau reveals the latter's presence to the audience and sparks a riot. When Binet, furious for being ruined, attacks him, Moreau shoots in self-defence. Binet is wounded, Moreau escapes. Moreau is now forced to go into hiding. He finds a fencing academy seeking \"a young man of good address with some knowledge of swordsmanship\". Moreau bluffs his way into apprenticeship with M. des Amis, the Maître en fait d'Armes (Master at Arms). Over time, he develops his own style of fencing, based on calculations of different moves. With the outbreak of the French Revolution, M. des Amis is killed, and Moreau inherits the school. When he is established at the school, he attempts a reconciliation with his godfather. The reconciliation, however, is brief. Moreau's friends convince him to take a seat in the new congress when they find out about his swordsmanship. They face the scourge of spadassinicides, aristocratic senators who have been provoking the inexperienced republicans to duel and wounding or killing them, just as the Marquis did to Vilmorin. Andre-Louis turns the tables and succeeds in killing or disarming all who challenge him. Finally, Moreau manages to goad the Marquis to challenge him to a duel. At last he can confront the murderer of his childhood friend, Philippe de Vilmorin. Having heard of this, Mme. de Plougastel, a relative whom he has seen only twice in his life, goes with Aline to stop the duel. They do not arrive in time, finding the Marquis wounded, though not fatally. The Marquis becomes a counter-revolutionary. In 1792, Paris is up in arms and the Tuilleries are stormed by a mob. Plougastel and Aline are in grave danger. The former's husband is a counter-revolutionary. Moreau, returning from an errand in Brittany, goes to visit his Godfather. Kercadiou tells him of the plight of Aline and Plougastel in Paris. Moreau agrees to rescue Aline, but does not agree to help Plougastel, until Kercadiou reveals to Andre-Louis that Mme. de Plougastel is his mother. Moreau secures and brings travel permits to the women to leave Paris. La Tour d'Azyr, on the run, seeks shelter in the same apartment. He and Andre-Louis draw pistols on each other. Mme. de Plougastel is forced to reveal that the Marquis is Moreau's father. Because of his recent actions, Moreau knows that he can't remain in Paris, so crosses the border with the women. Once relatively safe, Andre-Louis and Aline unravel the misconceptions about their feelings for each other and declare their love."
}