{
    "book_id": "10222898",
    "mid": "/m/02q5qng",
    "title": "Seeker",
    "author": "William Nicholson",
    "publication_date": "2005",
    "genres": [
        "Fantasy"
    ],
    "text": " The main characters in the book are Seeker, Morning Star and The Wildman. Seeker and Morning Star are devout believers in the All and Only, however it is not obvious as to how far the Wildman worships the God. The Wildman used to be a ruthless pirate that killed without mercy. He was called the Wildman because his mood was often unpredictable. The Wildman wishes to join the Nom because he desires power, but moreover he wants inner peace. Morning Star wants to find her mother, whom she believes entered the Nom many years ago, but also wishes to serve her God. She also has an ability to tell peoples' feelings merely by looking at the colour of their aura, which she can see. Seeker wants above everything else to serve his God, and to prove himself worthy, as he has always felt that he lived in the shadow of his older brother, Blaze of Justice, who himself is a Noble Warrior. Seeker's father is the headmaster of the school on Anacrea, and wants Seeker to follow in his footsteps, forbidding him from applying to the Nom. However, when praying Seeker hears a voice telling him the 'door is always open' and that he would be the one to save the Lost Child. This confirms Seeker's belief that he will join the Nom. However, Seeker ventures a little further into the monastery and sees Blaze seemingly being cast out of the Nomana, undergoing a process of his memories being cleansed. He speaks to several monks, and they inform him that Blaze is a traitor! Seeker cannot accept this, and feels that this is why he is later rejected by the Nom. Seeker, Morning Star, and the Wildman all make their way to the Nom to apply to join, and inevitably all three are turned away. But not relenting, Seeker decides to find another way to enter the Nom; he will perform an act of notable good, and hopefully be invited to join. The trio go to the City of Radiance, where a weapon is being constructed, with the purpose of destroying the Nom. Seeker has the intention of destroying the weapon by pretending to want to be its bearer. The nature of the weapon is explosive. Basically, the power of the Sun is stored in water, leading to the name Charged water. The energy in the water is released when it comes into contact with air. It is planned that the bearer will have the normal water in his blood replaced with charged water, and will sacrifice himself to destroy the Nom. However, Soren Similin, who is in charge of building the weapon (but none of the scientists working on the project realise this), and who is also the secretary of the leader of Radiance, has found another candidate to be the weapon bearer; Seeker's brother Blaze. Along the way Similin encounters Morning Star's mother, (who was in fact rejected by the Nomana, and fled in disgrace) and she tags along with him and Blaze on their way back to the City of Radiance. Both Blaze and Seeker come to the place where the weapon is, and both help to destroy it; Blaze having not really been cleansed. Morning star is re-united with her mother, and the trio are accepted into the Nom."
}