{
    "book_id": "10904999",
    "mid": "/m/02qtmf2",
    "title": "Shadowland",
    "author": "Meg Cabot",
    "publication_date": "2000-10",
    "genres": [
        "Fantasy",
        "Children's literature",
        "Young adult literature",
        "Speculative fiction",
        "Fiction"
    ],
    "text": " Susannah 'Suze' Simon is a mediator, which means she can see and talk to ghosts and, when necessary, kick some ghost butt. Suze spends a lot of time directing the usually unhappy dead to the afterlife. However, her job is not easy, as not all ghosts want to be guided. Every day, she is haunted by the fact that they will not leave her alone until she helps them resolve their unfinished business with the living. At the beginning of the story Suze moves from New York to Carmel, California, because her mom remarries to Andy Ackerman after Suze's father dies ten years prior. She gets three stepbrothers in the deal, whom she nicknames Sleepy (a senior), Dopey (a sophomore like Suze), and Doc (12, and, according to Suze, going on 40, as he knows more than an encyclopedia), but to the rest of the world they're Jake, Brad, and David. When Suze gets to California and tries to get settled into her new room, she finds Jesse de Silva sitting on her window seat. She describes him as an exceedingly hot ghost who happens to be already living in their house, and he doesn't seem to need her help. Suze at first is annoyed with the living arrangements and tells Jesse to move on or find some other house to haunt, because now she is living there. Suze feels that now that she is in California and she can start fresh, with trips to the mall instead of the cemetery and surfing instead of tending to lost souls. But she has hardly settled in when her skills are put to the test. There is a ghost with revenge on her mind in Suze's new school (the Junipero Serra Mission Academy) and Suze plans to stop her. The ghost, Heather, died because she shot herself over Bryce Martinson when he broke up with her due to a scare of possible marriage. When Bryce and Heather's old friends begin to show interest in Suze, Heather claims Susannah is taking over the life she had. Father Dominic (the Priest of the church and principal of the school, who happens to be another mediator) tries helping Suze with Heather. Father Dominic insists that Susannah should try a more friendly way to deal with the ghosts she meets. She argues with him, saying she has done this job all her life and is not going to change. He often calls her into his office to talk about how to get rid of Heather, and many other ghost related things throughout the series. One night, after Heather had put Bryce Martinson in the hospital, Suze decides to go down to the Mission and put an end to it all. The idea was to talk Heather into moving on, but Suze slips up in her wording and Heather misconstrues her meaning, giving Heather the false hope that she might get her life back. Suze tries to carefully explain this isn't so, but Heather throws a fit, going into such a rage that she attempts to kill Susannah. She uses her abilities to boil water and to snap off of and levitate the bronze head of a statue of Junipero Serra, the man of whom the mission was named after. Just as the statue's head is about to collide with Suze, Jesse appears and knocks her aside. Having followed her from the house to watch over her, he helps her flee the building, the head pursuing them the whole way. Once outside he says that they are safe, not because Heather can't reach them there, but because she is too young a ghost to know she can. The next day, Father Dominic is very unhappy with Susannah. She tries to explain that it was going to work - she just didn't expect Heather's strength. Days later, Heather puts Bryce in hospital again in her attempts to kill him. By now Susannah is furious and despite Father Dominic telling Susannah not to handle it alone, she does a special Voodoo exorcism. It works and Heather is sent on to the afterlife. Father Dominic is pretty mad but very pleased that Heather is gone and that all the suffering will go away. Unfortunately for Susannah, Bryce got sent to another school since Father Dominic thought this would be best for him, therefore deleting their very small love life that didn't even consist of one date due to Heather and her envy."
}