{
    "book_id": "16888830",
    "mid": "/m/041160d",
    "title": "Sister of My Heart: A Novel",
    "author": "Chitra Banerjee Divakaruni",
    "publication_date": "1999",
    "genres": [
        "Novel"
    ],
    "text": " The Princess in the Palace of Snakes follows two cousins from birth until their wedding day. The sudden death of their fathers on a reckless hunt for rubies sends Anju and Sudha’s mothers into premature labor, and the two girls are born twelve hours apart. From a young age the girls become best friends, sisters, and each other’s constant companion. Anju and Sudha grow up in a household run by their three mothers: Pishi, Gouri, and Nalini. Even though Anju and Sudha call each other sisters, they are technically cousins. Pishi is the girls’ aunt. Pishi’s youngest brother, Bijoy Chatterjee, married Gouri. Anju is their daughter. So in addition to Pishi and Gouri, there is Nalini, Sudha’s mother. The family relationships may seem complicated, but they play an important role in the novel. Anju and Sudha are inseparable, but different. Beautiful and calm, Sudha is a storyteller and dreams of designing clothes and having a family. Anju has a fierce spirit and longs to study Literature in college. The girls get caught skipping school and this event, along with a health scare in the family, suddenly changes plans for college to plans of marriage. Book one ends with Anju and Sudha getting married on the same day. Sudha will move in with her husband and in-laws who live in another part of India. Anju’s husband works in the United States, and she plans to join him after getting a visa. More than marriage has driven Anju and Sudha apart. Sudha has learned a dark secret about their family’s past. Shame and guilt over keeping this secret causes Sudha to pull away from Anju. But her love for her sister does not falter, and she even refuses to elope for fear it would damage Anju’s reputation. On the night of their double wedding, Anju becomes aware of her husband’s attraction to Sudha. Anju does not blame Sudha, but it is with some relief the two young women begin to live separate lives. In The Queen of Swords Sudha quickly learns the ways of her demanding and controlling mother-in-law. After five long years, Sudha is elated to learn she is pregnant. Meanwhile, Anju’s life in the United States has not entirely turned out as she expected. Anju and Sudha exchange regular letters and short phone calls, but their old intimacy is missing. The friends discover they are pregnant at the same time and both seem finally happy. Sudha’s mother-in-law finds out that Sudha’s child is a girl. She demands Sudha abort the baby, believing the first child should be a son. Sudha has nowhere to turn, leaving her husband would be grounds to talk to each other again as true sisters. Refusing to tie her life to another man and realizing Anju needs her, Sudha and her daughter decide to go to the United States. After many years, the sisters are reunited, but future obstacles still loom."
}