{
    "book_id": "16529964",
    "mid": "/m/03y9b19",
    "title": "Skulduggery Pleasant 2: Playing With Fire",
    "author": "Derek Landy",
    "publication_date": "2008-04-01",
    "genres": [
        "Speculative fiction",
        "Fantasy",
        "Children's literature"
    ],
    "text": " A year after the events of the first novel, Stephanie Edgeley (now known as Valkyrie Cain) continues to work with Skulduggery Pleasant, an undead skeleton detective, capturing villains for The Sanctuary. The Sanctuary is now ruled by Thurid Guild in a new location after the massacre in the previous Sanctuary. Soon Baron Vengeous (one of the original three generals of Mevolent) escapes his prison and begins searching for the armor of Lord Vile, another one of Mevolent's Generals with which he will be able to resurrect The Grotesquery, a hybrid monster made from a Faceless One's remains with the power bring back the Faceless Ones. Arriving in Ireland, he meets an accomplice vampire named Dusk. He orders Dusk to kidnap Valkyrie Cain. Dusk bites and enslaves two humans to help him. After losing to Skulduggery Pleasant, Baron Vengeous goes after China Sorrows who was once part of a cult that worshiped the Faceless Ones and also included Serpine and Vengous himself. The Baron confronts China Sorrows in her apartment whilst Valkyrie is visiting. Valkyrie hides whilst China and Vengous talk. Vengeous reveals that he was released from prison by an assassin named Billy-Ray Sanguine who promptly arrives along with Dusk. A battle ensues during which Valkyrie reveals herself and defends China. Valkyrie Cain is soon chased by Billy-Ray Sanguine who can travel through earth and buildings. After being in a struggle, Valkyrie is saved by Tanith Low. In the progress Valkyrie steals Billy-Ray Sanguine's razor, his primary weapon, leaving the psychopathic assassin with a grudge against her. Valkyrie and Skulduggery along with a convict called Vaurien Scapegrace went to the Magician's village of Roarhaven to find a mysterious man called the Torment who has information they need. After a battle in a seedy pub with some thugs (including a giant) and an unpleasant incident with some massive spiders, they find the Torment and ask for his help. The Torment only says he will help them find Vile's armour if Skulduggery kills Valkyrie, who is descended from the Ancients whom the Torment despises, as he thinks any power will corrupt civilization. Skulduggery takes Valkyrie around a corner and they summon her Reflection, a living mirror image of Valkyrie who she uses as a decoy, enabling her to live a double life. Skulduggery takes Valkyrie's reflection before the Torment and shoots it. The Torment is satisfied and tells Skulduggery the whereabouts of the Grotesquery. He and Valkyrie return Scapegrace to prison and go to find the Grotesquery, unfortunately Vengeous's minions have already obtained it. Soon after, Skullduggery and Valkyrie take the reflection back to Valkyries's house. Valkyrie touches the mirror to absorb its memories and remembers what it is like to be shot. Valkyrie then notices that whenever she tries to look back in her memories one part always remains blank and she cannot pin it down. She realizes that her reflection hid something from her, and finds it disconcerting and dangerous. However, she goes on with Skulduggery without mentioning it to him. Valkyrie is kidnapped by Sanguine who takes her to an old abandoned church to the Faceless Ones where she is taken before the altar where Vengeous awaits her. The evil sorcerer cuts Valkyrie's finger and spills some of her blood onto the Grotesquery's body before using the Armour's shadow powers which mingle with the blood. Skulduggery subsequently arrives and rescues Valkyrie. After stealing the Grotesquery, Valkyrie is incapacitated and wakes up in hospital. While wearing a 'respectable' blue hospital gown, Skulduggery wears a pink one decorated with bunnies and elephants for the doctor's amusement. Skulduggery turns the lifeless Grotesquery over to the Sanctuary's top scientist to take apart, however, the Grotesquery has already absorbed a lot of power from Vile's armour and Valkyrie's blood, and so wakes up in the middle of the night whilst being operated on. He kills the scientist's assistants and goes after Valkyrie. Skulduggery and Tanith arrive and the three of them attack the Grotesquery before escaping. Meanwhile, members of Sanctuary's all across the world are being murdered by assassins to distract people from Vengeous's plan. Billy-Ray Sanguine has also released Springheeled Jack from prison and sends him after a Sanctuary official in London. After discovering that he is being manipulated by Vengous in a plan to bring back the Faceless Ones, Jack kills his victim. Skulduggery works out that Vengeous is actually a pawn in someone else's plan and accuses Thurid Guild of being in league with this mystery benefactor. In a rage, Guild fires Skulduggery who decides to go after Vengous anyway. Valkyrie begrudgingly goes to her family reunion as a distraction to Dusk. The Torment, meanwhile, has discovered that Valkyrie is alive and goes after her only to be confronted by Skulduggery and Tanith Low. The Torment transforms into a giant spider but Skulduggery and Tanith defeat him nevertheless. Valkyrie is subsequently attacked by vampires and forced to flee. Dusk corners her and vows that when he has transformed her into a vampire he's going to set her loose on her parents while in her bloodlust. Valkyrie stabs Dusk in the leg with the syringe he uses to curb his vampiric side whilst he is transforming, and as a result, he is caught between vampire and human and put in intense pain. Springheeled Jack comes and rescues her and defeats Dusk so as to frustrate Vengeous's plans because he doesn't want the Faceless Ones to return. Meanwhile China is attacked by Vengous in an underground carpark. The dark wizard brutally murders China's bodyguards and viciously beats her unconscious before taking her to Clearwater Hospital, his headquarters. Accompanied by Tanith Low, Mr Bliss and some Cleavers, Skulduggery and Valkyrie go to Clearwater Hospital and do battle with the Grotesquery which due to being part Faceless One is virtually invincible. Mr Bliss is incapacitated but the Cleavers mercilessly attack the Grotesquery and almost overpower it when Vengous arrives along with China whom he has taken captive and together with the Grotesquery he kills the Cleavers and beats Skulduggery and Valkyrie into submission. Valkyrie tricks Vengous into releasing her, saying that she will join him but she releases China who attacks Vengous and the Grotesquery, giving Valkyrie time to free Skulduggery who joins in the assault against Vengous, tearing off his helmet and his breastplate before shooting him in the stomach. In a swoon, Vengous crawls toward the Grotesquery but his god callously breaks the Baron's neck. The Torment subsequently arrives and attacks the Grotesquery but he is defeated and almost killed. In the ensuing battle Valkyrie stabs the Grotesquery through the heart, killing it but before it dies it utters a terrible scream. Sanguine is then seen meeting his mysterious master who reveals that he had never expected the Grotesquery to succeed but he knew that when it was vanquished, the beast's dying scream would alert the Faceless Ones spirits as to the whereabouts of the Earth meaning that all he has to do now is open the door. The mysterious man then pays Sanguine and takes his leave. Valkyrie is later seen talking to Skulduggery on a pier. They reason that they must find out who Vengous and Sanguine were really working for and if Thurid Guild is in league with him. Skulduggery ominously tells Valkyrie \"Bad things are coming.\" They are subsequently attacked by a vampire and the book ends with them going into battle once again. pt:Skulduggery Pleasant: Playing with Fire"
}