{
    "book_id": "13766203",
    "mid": "/m/03chmf7",
    "title": "South Park and Philosophy: You Know, I Learned Something Today",
    "author": "",
    "publication_date": "2006-12-01",
    "genres": [
        "Philosophy",
        "Non-fiction"
    ],
    "text": " The book includes contributions from twenty-two academics in the field of philosophy. Topics include issues of sexuality involved in depicting Saddam Hussein and Satan as gay lovers, existentialism as applied to the death of Kenny, and a debate about whether feminists can enjoy the show due to some of its misogynistic characters. The contributors to the work utilize philosophical concepts derived from Plato, Aristotle, Freud and Sartre and place them in a South Park context. The book's contributors all attempted to analyze the philosophical and cultural aspects of South Park in the work. One of the authors, David Koepsell, wrote about the controversial episode dealing with Scientology, entitled: \"Trapped in the Closet\". Koepsell cited the fact that the series won a Peabody Award due to its willingness to criticize intolerance in April 2006 as a \"special concern for criticizing and countering intolerance\", and the notion that \"the Church of Scientology suffers from the widely held perceptions that it seeks to silence former members and others who criticize its beliefs and practices\" as the motivation behind the episode. Koepsell analyzed Comedy Central's reaction to the episode itself, in a section of his book entitled \"2005-2006: Comedy Central Caves\". He mentions South Park's usage of the onscreen caption \"this is what Scientologists actually believe.\" in the episode, noting that the same device was used in the episode \"All About the Mormons?.\" In referencing this similar use of the onscreen caption device, Koepsell seemed to point to an inconsistency in the behavior of Comedy Central relative to the episode. He explained \"By a long shot, this show was more kind to Scientology than was \"All About the Mormons\" to Mormonism.\" He noted Comedy Central had suggested it would not rebroadcast the episode for the second time, though it later announced on July 12, 2006 that it would. The book can thus be summed up in the following sentence: \"Perhaps the truth is in the middle.\""
}