{
    "book_id": "9056092",
    "mid": "/m/027w17q",
    "title": "Special Assignments: The Further Adventures of Erast Fandorin",
    "author": "Boris Akunin",
    "publication_date": "1999",
    "genres": [
        "Crime Fiction",
        "Novella"
    ],
    "text": " Moscow, 1886. Four years after the events depicted in The Death of Achilles, Fandorin is still serving as the Deputy for Special Assignments to Moscow governor Prince Dolgurukoi. He is cohabitating with the Countess Addy, a married woman. After a gentleman con man named Momos, who goes by the alias \"The Jack of Spades\", dupes the Prince as part of a hundred-thousand ruble swindle, Fandorin is called in to apprehend him. Fandorin takes on as his investigative assistant a meek young policeman named Anisii Tulipov, and together Fandorin and Tulipov try to apprehend Momos and his beautiful lady accomplice, Mimi. Fandorin sniffs out and shuts down a fraudulent lottery being run by the Jack, but Momos and Mimi escape. Momos in turn tricks Fandorin's Japanese manservant, Masa, into letting him steal all of Countess Addy's baggage. An angry Fandorin vows revenge on Momos and sets up a sting where he poses as an Indian prince in possession of a large emerald. Momos and Mimi again escape, but not before Mimi and Tulipov have a romantic encounter. Momos sends back all of Addy's baggage in an effort to relieve the pressure from Fandorin. Fandorin subsequently sends Addy back to her husband. Momos decides to flee Moscow to avoid a determined Fandorin, but changes his mind after a chance encounter with Samson Eropkin, a thoroughly corrupt, criminal Moscow official. Momos decides to rob Eropkin, but the con goes horribly wrong. Momos and Mimi wind up captured by Eropkin, who is on the verge of murdering them both when Fandorin arrives and saves them. Eropkin is arrested for his crimes. Fandorin lets Momos go for lack of evidence and from a desire to save his boss, Prince Dolgurukoi, embarrassment. Mimi, on the other hand, faces trial for her involvement in the fraudulent lottery. She appears to be headed for prison and exile in Siberia—and Tulipov, who has fallen in love, dreams of marrying her after she is released from jail—when Momos, disguised as a lawyer, defends Mimi in court and blackmails the judge into dropping the charges. Tulipov watches Mimi and Momos leave the courthouse, not realising until it is too late that Momos is the lawyer, and he watches disconsolately as the Jack of Spades takes the woman of his dreams away. The tone of the novella is lightly comic, making a sharp contrast to the second novella, The Decorator. Moscow, 1889. Holy Week, before Easter. In Moscow, a prostitute is brutally murdered and mutilated. Fandorin believes the murderer is Jack the Ripper, the English murderer who killed a series of prostitutes in London the year before. Early in the novel, the point of view shifts to that of the murderer, who describes his crimes and calls himself The Decorator, believing he makes ugly women beautiful. The rest of the story is periodically interrupted with the thoughts of The Decorator. Court Counsellor Izhitsin, an investigative rival of Fandorin's, supervises the exhumation of corpses from the Bozhedomka graveyard, with Fandorin's assistant, Tulipov, accompanying. While at the cemetery, Tulipov befriends Pakhomenko, the genial Ukrainian cemetery watchman. The coroner, Dr. Zakharov, identifies four more bodies as being victims of the Moscow ripper. Tulipov reports these findings to Fandorin, whose new girlfriend, Angelina, a devout Russian Orthodox woman, lives with Fandorin regardless. Angelina's origins are described in the short story \"The Scarpea of the Baskakovs\" from the Jade Rosary Beads collection. Fandorin checks the records of people who have travelled from London to Moscow in recent months and have medical training, and comes up with two likely suspects: Nesvitskaya the midwife, and Stenich the male nurse, who were kicked out of medical school seven years ago. Shortly after this, Fandorin receives a gruesome package in the mail: a human ear. Tulipov surreptitiously interviews the two suspects. Fandorin travels back to the morgue and matches the severed ear with one of the dead prostitutes. Fandorin challenges Zakharov, who won't tell him anything but instead tells him the guilty party will be at a reunion party of former medical students he's going to that night. Fandorin learns that the party's host, a businessman named Burylin, was thrown out of medical school for being part of a group of pranksters that got into trouble at school seven years ago. Stenich was also part of this group, as was Zakharov, who was trained as a coroner instead of being expelled. Their leader, Sotsky, was sent to prison, and died. It is eventually revealed that Sotsky and the rest were disciplined for accidentally killing a prostitute. Fandorin arrests Burylin after he confesses to sending Fandorin the ear as a prank. Tulipov is assigned to work with Izhitsin, who believes the murderer must be a Tatar or Jewish butcher, and has rounded up a group of suspects he plans to torture. Tulipov tells him of the three suspects Fandorin has found, and Izhitsin has an idea for an experiment: shock the three suspects by taking them to the morgue and showing them the bodies and seeing who confesses. No one does. In the street, Tulipov accidentally runs into Fandorin, who is working undercover as a pimp. Fandorin learns of Izhitsin's stunt with the bodies and goes to confront him, only to find out that the Decorator has murdered him. Count Tolstoy, the Minister for Internal Affairs, arrives from St. Petersburg on Good Friday and threatens to fire Prince Dolgurukoi if the killer is not caught by Easter. Tulipov goes back to the graveyard to interview the people who attended Izhitsin's experiment, and, in a sudden fit of inspiration, believes he's figured out who the killer is. While Tulipov is pursuing his theory, the Decorator arrives at his apartment and kills his sister Sonya. Fandorin is informed of this, and is then given a deathbed report from Tulipov, who believed the killer was Zakharov and had gone to Zakharov's office at the graveyard to observe him—only to run into the Decorator, who attacked and mortally wounded him. Fandorin, enraged over the murder of his assistant, goes to the graveyard and finds Zakharov missing, but interviews the watchman Pakhomenko. He receives a phone call from Zakharov, who says he is innocent and will tell Fandorin everything if Fandorin and Masa meet him at a hotel. Meanwhile, the Decorator goes to Fandorin's house, intending to kill Angelina. He is surprised and subdued by Fandorin and Masa, who did not go to the hotel rendezvous. The killer is revealed to be Pakhomenko, the friendly graveyard watchman—whose true identity is Sotsky, the leader of the group of medical school pranksters seven years ago. Fandorin determines to kill Sotsky himself, right there in his house, but is interrupted by Angelina when she arrives home. Fandorin settles for an impromptu trial with Angelina as judge. Fandorin then reveals that Sotsky did not die in prison, but escaped and emigrated to London before returning to Moscow and getting a job at the cemetery from his old friend Zakharov. Sotsky then killed Zakharov and impersonated him in the phone call to lure Fandorin away and leave Angelina unprotected. Sotsky admits to his crimes and Angelina finds him guilty. Fandorin then takes him outside and shoots him in the yard. After he returns, Angelina tells him she is leaving him to become a nun, because she believes she inhibits Fandorin in his work. Fandorin is devastated, but she insists. As the Easter bells sound, she tells him \"It's all right. Do you hear? Christ is risen.\""
}