{
    "book_id": "16084780",
    "mid": "/m/03qnp8x",
    "title": "Stairway to Heaven: Led Zeppelin Uncensored",
    "author": "",
    "publication_date": "1992-08",
    "genres": [
        "Non-fiction"
    ],
    "text": " The beginning of the book describes Cole's background, and that of every member of the band. He also briefly describes the atmosphere of 1960s London. He claims that he always wanted to be in the music business, and that at one point he began to play the drums but did not pursue this path. He recounts his experience as tour manager for The Who and his venture into other aspects of the 1960s London scene, including the mod subculture. The book documents Cole's personal experiences as tour manager for one of the biggest bands of all time. It also shows how the constant pressure of touring and recording was beginning to take a toll on the band's members, even as early as 1969. Cole reveals that he developed close and personal friendships with each of the band members, and recounts the devastating impact that the death of John Bonham had on him. He also discusses the substance abuse problems which he developed in the 1970s, and which ultimately led to him being fired by Led Zeppelin's manager, Peter Grant, after the Knebworth Festival in 1979. The book also describes his life immediately after Led Zeppelin's downfall. At the time of their collapse he was trying to shed his heroin addiction in Italy when he was falsely accused of terrorism for involvement in the 1980 Bologna railway station bombing. Whilst imprisoned he underwent forced detox from heroin. Sleepless nights, constant sweat, diarrhea, and pain were some things he experienced while he was in the custody of the Italian police. When released, Cole was no longer addicted to heroin but he had no money as he had spent it all on drugs prior to his incarceration, and he could no longer rely on a steady income from an involvement with Led Zeppelin. He said that for the first time since before he became a tour manager he had to work on the scaffolds."
}