{
    "book_id": "2734854",
    "mid": "/m/07_v9y",
    "title": "Star Wars Republic Commando: Hard Contact",
    "author": "Karen Traviss",
    "publication_date": "",
    "genres": [
        "Science Fiction"
    ],
    "text": " The story begins during the Battle of Geonosis with Clone Commando Darman and his team assaulting a Separatist position. However, the entire squad is massacred in the attack, with Darman being the only survivor. After the battle, he is grouped with other clone commandos in incomplete squads and meets Niner, Fi, and Atin. All four commandos must learn how to work together as a team, as they had in their previous squads. It is not long before the newly formed squad is given another mission. This time, they are to be inserted onto the planet Qiilura, deep in Separatist territory in order to destroy a research facility developing a nanovirus that specifically targets clone troopers. They also must capture the lead scientist, Ovolot Qail Uthan. However, the facility is guarded by Ghez Hokan, a fearsome Mandalorian mercenary who shows little mercy to his enemies or friends, and commands a small army of militia, Trandoshan slavers, and droids. When the squad attempts to land on the planet, their ship suffers mechanical problems and is forced to crash land, resulting in Darman being separated from the others. Meanwhile, a young Jedi Padawan, Etain Tur-Mukan, is on the run after her master, Jedi Master Kast Fulier, is killed by Hokan. She goes into hiding and is sheltered with the help of a strange woman named Jinart. Meanwhile, Niner, Fi, and Atin run across and defeat several Separatist patrols in an attempt to find Darman and complete their objective. With Jinart's help, Darman and Etain link up but Etain lacks the self-confidence to lead and tells Darman to take charge. They then manage to reunite with the rest of the squad and make their plans to attack the research facility. Jinart reveals herself to be a Gurlanin, shapeshifting native animals of Qiilura, and gives them vital information on how to approach the facility. Etain and the commandos attack the facility and manage to destroy it and take Uthan prisoner, but Hokan does not give up without a fight, nor does his lieutenant, who wounds Atin and, through shrapnel, Uthan. He fights the Republic forces valiantly, but is eventually outsmarted and killed by Etain who decapitates Hokan with her lightsaber. After their victory, Etain gains a little more confidence in herself and her abilities. As the extraction dropship arrives, Etain desperately wants to leave with the commandos, but Jedi Master Arligan Zey has different ideas. He wants Etain to stay with him on Qiilura to organize an anti-Separatist resistance movement, and that she would be far more valuable to the Republic by staying behind. Etain reluctantly agrees and parts ways with Omega squad, and especially Darman, as they leave. S.S."
}