{
    "book_id": "12076330",
    "mid": "/m/02vp0sn",
    "title": "Star Wars: Darth Bane: Rule of Two",
    "author": "Drew Karpyshyn",
    "publication_date": "",
    "genres": [
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " Darth Bane, still on the planet Ruusan, finds his apprentice Zannah, a girl only 10-years-old. Together they decide to see the effects of the thought bomb and journey into the catacombs where it lies. Inside they find a boy, Tomcat, who is Zannah's cousin; she spares him by cutting his hand off. Then Darth Bane attacks the remnants of an old Sith camp, inhabited by former mercenaries. He slays the majority of them, allowing two to survive. At the camp, he finds a scroll telling him the location of the tomb of former Sith Lord, Freedon Nadd. Then he travels to a ship and leaves the planet, charting a course for Dxun, a moon of the planet Onderon, but makes Zannah stay to find her own way to the planet, and meet him on Onderon, saying it is a test and a lesson. Meanwhile, the surviving mercenaries are found by Jedi Johun Othone and his group of soldiers that travel back to Ruusan to find any survivors of the thought bomb. Johun takes the mercenaries back to the main ship to stand trial. The remaining soldiers happen to find Zannah. On the way back to the main ship, she kills the crew, and plots a course to Onderon. Bane then flies to Dxun and enters the tomb. Upon touching the Sith holocron, he is attacked by orbalisks who attach onto his body. He learns that the orbaliks cannot be removed, but will provide an almost impenetrable armor and give his body superhuman healing prowess. Then he controls the mind of a Drexl, a flying beast native to the planet, and flies to Onderon to meet Zannah, thereby rescuing Zannah from an indigenous clan of beast riders. Johun is appointed protector of Chancellor Valorum, a boring job he does not desire, but then his master, Valenthyne Farfalla, makes him a Knight, instead of the former Padawan he was. Ten years later, Zannah is a woman and now a powerful Sith. Strikingly attractive, she tricks a handsome Twilek Kel, into a plan to assassinate former chancellor Valorum, a plan which is doomed to fail. Kel and other members of the rebel group attack, two members flee upon seeing bodyguard Johun Othone, who is a Jedi. After a fearsome battle, the Jedi narrowly defeats the Twilek Kel, and kills the rest of the group. Meanwhile, at base camp, Bane has been trying to construct a Sith holocron; after three failed attempts, he fails on the fourth one and goes into a blinding fury and destroys the camp. Zannah plants the seeds in his head that the orbalisks caused the failure, because she knows that one day she must challenge him and she is afraid that she will be unable to beat him, because of the orbalisks. He starts to wonder whether the orbalisks are causing his mind to degrade, because of the repeated failures to construct the holocron. The two members who had fled find Zannah and accuse her of tricking them into an attack that was doomed to fail. Unable to attack in public, she follows them to their master Hetton. In him, Zannah senses the dark side of the Force. She kills the two members that fled in a dramatic flair of Sith power. Hetton, very impressed, asks Zannah to make him her apprentice. She accepts, knowing that he has a large collection of manuscripts valuable to her master. Together Zannah, Hetton and eight Sith assassins attack Darth Bane. Bane kills the assassins, as well as Hetton, and almost kills Zannah too, until she explains to him what happened. He again thinks that the orbalisks have caused him to miss the subtle plan that Zannah constructed, almost killing her - furthering the thought that the orbalisks are causing him to degrade mentally. Using Hetton's manuscripts, he finds the location of the tomb of Sith Lord Belia Darzu. Hoping that it will contain the secrets of holocron construction, he travels there. Darth Bane instructs Zannah to disguise herself and go to the Jedi archives, to see if she can find a way to remove the orbalisks. There she finds the cure, but meets her cousin Tomcat, now called Darovit, who was found on Ruusan by Johun Othone. Darovit tells the Jedi about Darth Bane. He now finds himself changing alliances and decides to come with Zannah, because of his brotherly love for her. Five Jedi journey to the tomb of Belia Darzu, arriving after Zannah and Darovit. Bane instructs Darovit to hide, and he and Zannah together duel with the five Jedi. After having slain four of them, he attempts to kill the last one with Sith lightning. One of the four supposedly slain Jedi is still alive and casts a Force orb around Bane as he releases the lightning. The lightning is reflected back on Bane, frying him inside the orb. Some of the orbalisks are destroyed by the tremendous force and thereby release a toxin that will kill Bane in days. Zannah takes the group to Ambria, to find healer Caleb, who once saved Bane's life before. Caleb refuses to heal him, no matter what, but then he makes a deal that he will heal Bane if Zannah informs the Jedi of their existence. She accepts, but after Bane is healed, Zannah kills Caleb and makes Darovit go mad. She tricks the Jedi that come. They think that Darovit was the Sith Lord. Meanwhile, Zannah and Bane are hiding in a secret cellar. Bane expected her to let him die, but after the Jedi leaves, she tells him that she saved him because she still has much to learn."
}