{
    "book_id": "12545424",
    "mid": "/m/02wcj3g",
    "title": "Sten Adventures Book 7: Vortex",
    "author": "Chris Bunch",
    "publication_date": "1992",
    "genres": [
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " Sten fulfilled many tasks in service to the Eternal Emperor and his Empire as special forces agent, tacship fleet captain and admiral. Now he is going to add a new one - a diplomat. The Eternal Emperor, who was assassinated 6 years ago, is back from the grave and once again he can lead his merchant Empire. However, domestic situation is desperate. Tahnwar followed by 6-year shortage of Antimatter Two brought many regions of Empire to the brink of economic collapse that can't be prevented with restoring flow of AM2. Even the Eternal Emperor can't manage this whole situation alone, so he asks his friends for help. Friends like certain Karl Sten. Sten, after proving his worth on the field of diplomacy, is sent to Altai Cluster, a very important region of the Empire, which shows a lack of stability. Altai resembles a Middle East-like war zone, where various ET and human factions are trying to kill each other and take control of the Cluster. One of Sten's tasks is the support of dictator Khaquan, whose rule by an iron hand is the only thing that keeps whole Cluster in check. Sten goes to Altai as prepared as never before, with plenty of information (especially one provided by his friend and former boss, admiral Ian Mahoney), his best friend Alex, Cind, Sten's lover and excellent sharpshooter, contingents of Bhor, Gurkha and also Emperor’s personal flagship Victory. Upon arrival to the Cluster central world Jochi Sten discovers that dictator Khaquan is dead and there is a bloody civil war between all major factions. Sten brilliantly stops all fighting, but he receives an unpleasant wake-up call in the form of an extremely well prepared assassination attempt, which he and his friends barely survive. Over Sten's objections, the Emperor (who is showing signs of instability) assigns a banished member of one faction as ruler of the whole cluster. This new ruler proves as big a despot as Khaquan, with storm troopers and mass arrests being daily order. Sten is powerless to stop him, his complains to the Emperor fall on deaf ears. While Sten and Alex are collecting evidence to compel the Emperor to rescind his decision, the Emperor secretly agrees with Sten's conclusion and decides to assassinate his newly appointed ruler, and in the same time make Sten a martyr, to cover suspicion. However, Cind and her sniper team kills the assassin before he can kill Sten. Fortunately, Sten knows about Emperor’s wavering loyalty. He receives many warnings from his friends, that not only the Eternal Emperor is the actual cause of continuing economic downfall, but also he doesn’t trust his former friends anymore and plans to dispose of Sten in case of failure. This is cemented when admiral Ian Mahoney, who was sent to help Sten, is imprisoned and charged with treason against the Empire. The situation on planet continues to spin out of control (thus the title of the book). Sten tries one last attempt at peace solution, which horribly fails (not to his fault), and Sten and his entourage are forced to flee under fire from Altai, against the order of the Emperor. As they are leaving, Sten hears that admiral Mahoney was executed. Few minutes later, Admiral Mason, whom we met in an earlier part of Sten's career, is ordered by the Emperor to use a planet buster to destroy Jochi. We leave Sten and his fleet in shock after Sten and a tacship pilot destroy Mason's ship, making Sten and company mutineers and rebels, declared outlaw by Imperial forces."
}