{
    "book_id": "2598899",
    "mid": "/m/07qs0h",
    "title": "Storm Warning",
    "author": "Mercedes Lackey",
    "publication_date": "1994",
    "genres": [
        "Science Fiction",
        "Speculative fiction",
        "Fantasy",
        "Fiction"
    ],
    "text": " When Storm Warning begins, we meet Emperor Charliss, the Eastern Emperor (first mentioned in Winds of Fury). He knows he is dying and must name a successor. Grand Duke Tremane, a Commander in the Army, is currently his favorite choice. Tremane is sent to Hardorn, a country the Imperial Army recently invaded after the Hardornen King, Ancar, was killed by a group of assassins from Valdemar. Tremane understands that he must succeed in this mission or he will be killed. Meanwhile, in Haven, the capital city of Valdemar, An'desha shena Jor'ethan, a young Shin'a'in Adept, is feeling lonely. While Adept Firesong k'Treva, his lover, is perfectly at home in Haven, An'desha feels left out and alien. He spends almost all of his time in Firesong's ekele, an environment something like a cross between a sukkah and a treehouse and something like the flets of the elves in Tolkien's The Lord of the Rings, where he meditates and tends the plants in the garden. However, he has been having premonitions of approaching doom. Neither he nor Firesong can explain these premonitions. Also, An'desha has an Adept-class (the highest level of ability of magic) potential, but refuses to be trained, believing his powers to be tainted by Falconsbane, by whom An'desha was earlier possessed. Ambassador Ulrich of Karse has been sent with his assistant, Karal Austreben, a novice Sun-priest, to negotiate peace between Karse and Valdemar. At the border, a single escort arrives, who seems to Karal to be some sort of Court official dressed in white and mounted on a white stallion; he later discovers this man is a Herald. As they ride north, Karal examines himself and his attitudes towards the people of Valdemar and the Heralds. Karsites are taught to fear the Heralds and Mages, who are said to have \"witch powers\". On their arrival in Haven they are greeted by the Seneschal, Lord Palinor, Kyril, the Seneschal's Herald, and Prince-Consort Daren. Karel is glad of the rest, but as the weeks pass, begins to feel lonely. Talia, the Queen's Own Herald, introduces him to An'desha. Karal and Ulrich, much to Firesong's chagrin and jealousy, help An'desha to become less afraid of his power, as well as to become more independent."
}