{
    "book_id": "393692",
    "mid": "/m/0230k1",
    "title": "Tai-Pan: A Novel of Hong Kong",
    "author": "James Clavell",
    "publication_date": "1966",
    "genres": [
        "Historical fiction",
        "Fiction",
        "Novel"
    ],
    "text": " The novel begins following the British victory of the first Opium War and the seizure of Hong Kong. Although the island is largely uninhabited and the terrain unfriendly, it has a large natural harbour that both the British government and various trading companies believe will be useful for the import of merchandise to be traded on mainland China, a highly lucrative market. Although the novel features many characters, it is Dirk Struan and Tyler Brock, former shipmates and the owners of two massive (fictional) trading companies who are the main focal points of the story. Their rocky and often abusive relationship as seamen initiated an intense amount of competitive tension. Throughout the novel, both men seek to destroy each other in matters of business and personal affairs. Struan is referred to throughout the novel as Tai-Pan, indicating his position as head of the largest of all the trading companies in Asia. Clavell translates Tai-Pan as \"Supreme Leader,\" although as described in the Tai-Pan entry, \"Big Shot\" might be more accurate. Brock, owner of the second largest of the trading companies, constantly vies to destroy Struan's company and reputation in an attempt both to exact revenge on Struan and to become the new \"Tai-Pan\" of Chinese trade. Other important characters of the novel include: * Culum Struan - Dirk Struan's son and future Tai-pan * Robb Struan - Dirk Struan's half-brother and business partner. * William Longstaff - first Governor of Hong Kong * Jeff Cooper, American trader and secret partner to the Noble House * Wilf Tillman, American trader and partner to Jeff Cooper. Guardian to Shevaun Tillman. Advocate of slavery. * Count Zergyev - Russian diplomat and spy to gauge British influence in Hong Kong * Gorth Brock - Tyler Brock's boat-captain son. * Jin-Qua, Chinese tea and opium trader, lends Dirk Struan \"40 Lac\" (about 1.656 million Pounds sterling, or 8 million dollars in silver bullion) to get out of debt to Tyler Brock. He is the originator of the \"coin debt\" to which Dirk and future Tai-Pans must swear to uphold (revealed as well in Noble House) * May–May - Dirk Struan's Chinese mistress, granddaughter of Jin-Qua, instructed to teach Dirk \"civilized\" (Chinese) ways. * Liza Brock, wife of Tyler Brock and Tess' mother * Aristotle Quance - Painter and hedonist, always in debt. The Struan family own several of his paintings. * Shevaun Tillman, ward of Wilf Tillman and hopeful bride to Dirk Struan. * Captain Orlov, \"The Hunchback\" Finnish opium ship captain under Dirk Struan. Often has visions of precognition of future events. * William Skinner, editor of the island newspaper, privy to secrets handed to him by Dirk Struan to keep his rivals off balance * Gordon Chen - Dirk Struan's Eurasian son by a Chinese mistress and secret head of the first Hong Kong Triad (underground society) * Tess Brock, daughter of Tyler Brock and eventual wife of Culum Struan.Also known as Hag Struan in later novels. * Mary Sinclair, secret English prostitute and devotee/spy of Dirk Struan, and sister of Horatio Sinclair. * Captain Glessing, former ship captain of Royal Navy and harbor master. Has a peninsula named after him. Loses an arm in the typhoon. * Horatio Sinclair, clerk to Dirk Struan, church fanatic and harbors incestuous desires for his sister Mary. * Wolfgang Mauss, renegade priest and teacher to Gordon Chen. * Roger Blore, gambler, makes an unheard of record time journey to Hong Kong, later becomes Dirk Struan's horse racing club owner. * Captain Scragger, pirate and negotiator for Wu Fang Choi, a pirate king. Scragger's family line is mentioned several times in the following books of the Asian Saga. * Wu Fang Choi, pirate king and secret partner to Jin-Qua, as the bullion for the deal came from him."
}