{
    "book_id": "17482095",
    "mid": "/m/0466mbd",
    "title": "Tempted",
    "author": "Cecily von Ziegesar",
    "publication_date": "2008-06",
    "genres": [
        "Young adult literature"
    ],
    "text": " After two weeks of being back at Waverly for almost being expelled, Jenny Humphrey has now become the new it girl (first it was Tinsley Carmichael). At the upcoming Halloween masquerade Jenny decides to dress up as Cleopatra and beats Tinsley for the best costume award. Meanwhile, Callie attempts to win back Easy in a Cinderella costume with a secret proving that she's a good person. But it backfires when Callie's costume reminds Easy of the snobby princess she is. After Easy tells her off, Callie runs away to a \"health spa\" set up by her mom. During the masquerade, Brett and Jeremiah reunite after Brett lies to him about Kara, her very friendly friend. After the masquerade, Easy climbs and accidentally collapses an oak tree, leaving first floor Dumbarton residents (like Kara) homeless. Tinsley, being the \"angel\" that she is, gives Kara a home, creating a very awkward rift with Brett in the room. Meanwhile, Callie finds out that the supposed health spa her mother set up for her is actually some kind of rehab-work camp. Luckily, through group confessions, she learned to get over, and let go of Easy. Easy, in an attempt to get over Callie and be able to stay in Waverly, searches for an extracurricular activity, but instead finds himself in Heath's club, Men of Waverly. While Callie's away, Jenny will play, with Drew that is, her supposed savior who paid for her re-admittance by paying off the owner of the burned barn. While going through Callie's things, Jenny finds out that it was Callie who paid for the burned barn fiasco. Once Jenny realizes it was Callie who saved her, she sees that Callie is a good friend after all. She leaves Drew and hides trying to stay away from her room. Meanwhile Tinsley has just gotten an email from Callie telling Tinsley where she is and that she needs help. Tinsley, feeling lonely and desperate now that she's a nobody, decides she needs to go rescue Callie but she can't do it alone. On her way out she bumps into Jenny and they formulate a plan putting their differences aside to help Callie. By getting Sebastian's car, Drew's roommate and also the guy Brett is supposed to tutor, Tinsley and Jenny head off to Maine. Heath and Kara have broken up when he told everyone about Brandon's baby blanket because Kara feels that he is insensitive and said it reminded her that he used to tease her. At the next Boy of Waverly (BoW) meeting, Heath is still trying to get over his breakup with Kara. Jeremiah and Brett later show up to the meeting and Jeremiah soon finds out the truth about Brett and Kara. Jeremiah then breaks up with Brett saying that it's for good. While on the drive to Maine, Sebastian's car breaks down leaving Jenny and Tinsley stranded.Jenny takes out her cell and texts Easy telling him what a good person Callie is. Easy, once getting the message, takes a charter plane straight to Maine to rescue Callie. At the rehab facility Callie has been trying to get over Easy and was put on a survival test out in the woods which turned out to be only fifty yards from the campus. Easy finds her and takes her back to the airport where they make up and get back together. But their reunion is short lived because when they get back the principal and Easy's guidance counselor are waiting for them. Easy broke his probation by leaving the school grounds without permission and the author makes it unknown if Easy will get expelled. Tinsley and Jenny go to sleep in Sebastian's car and when they wake up, they find that they were right next to a country club.It is later shown in the last IM conversations of the book that on the trip that the two become friends."
}