{
    "book_id": "1379823",
    "mid": "/m/04y0lm",
    "title": "The Gilded Age: A Tale of Today",
    "author": "Mark Twain",
    "publication_date": "1873",
    "genres": [
        "Novel"
    ],
    "text": " The term gilded age, commonly given to the era, comes from the title of this book. Twain and Warner got the name from Shakespeare's King John (1595): \"To gild refined gold, to paint the lily... is wasteful and ridiculous excess.\" Gilding a lily, which is already beautiful and not in need of further adornment, is excessive and wasteful, characteristics of the age Twain and Warner wrote about in their novel. Another interpretation of the title, of course, is the contrast between an ideal \"Golden Age,\" and a less worthy \"Gilded Age,\" as gilding is only a thin layer of gold over baser metal, so the title now takes on a pejorative meaning as to the novel's time, events and people. The novel concerns the efforts of a poor rural Tennessee family to grow affluent by selling the of unimproved land acquired by their patriarch, Silas “Si” Hawkins, in a timely manner. After several adventures in Tennessee, the family fails to sell the land and Si Hawkins dies. The rest of the Hawkins story line focuses on their beautiful adopted daughter, Laura. In the early 1870s, she travels to Washington, D.C. to become a lobbyist. With a Senator's help, she enters Society and attempts to persuade Congressmen to require the federal government to purchase the land. A parallel story written by Warner concerns two young upperclass men, Philip Sterling and Henry Brierly, who seek their fortunes in land in a novel way. They make a journey with a group intent on surveying land in Tennessee in order to acquire it for speculation. Philip is good-natured but plodding. He is in love with Ruth Bolton, an aspiring physician and feminist. Henry is a born salesman, charming but superficial. The theme of the novel is that the lust for getting rich through land speculation pervades society, illustrated by the Hawkinses as well as Ruth's well-educated father, who nevertheless cannot resist becoming enmeshed in self-evidently dubious money-making schemes. The Hawkins sections were written by Twain; these include several humorous sketches. Examples are the steamboat race that leads to a wreck (Chapter IV) and Laura’s toying with a clerk in a Washington bookstore (Chapter XXXVI). Notable too is the comic presence throughout the book of the eternally optimistic and eternally broke Micawber-like character, Colonel Beriah Sellers. The character was named Escol Sellers in the first edition and changed to Beriah when an actual George Escol Sellers of Philadelphia objected. A real Beriah Sellers then also turned up, causing Twain to use the name Mulberry Sellers in The American Claimant. The Sellers character was modeled after Twain's maternal cousin, James Lampton, and the land-purchase plot parallels Twain's father's purchase of a Tennessee parcel whose prospective sale, Twain wrote in his autobiography, \"kept us hoping and hoping, during 40 years, and forsook us at last\". The main action of the story takes place in Washington, D.C., and satirizes the greed and corruption of the governing class. Twain also satirizes the social pretensions of the newly rich. Laura's Washington visitors include \"Mrs. Patrique Oreille (pronounced O-rey),\" the wife of \"a wealthy Frenchman from Cork.\" The book does not touch upon other themes now associated with the \"Gilded Age”, such as industrialization, monopolies, and the corruption of urban political machines. This may be because this book was written at the very beginning of the period. In the end, Laura fails to convince Congress to purchase the Hawkins land. She kills her married lover but is found not guilty of the crime, with the help of a sympathetic jury and a clever lawyer. However, after a failed attempt to pursue a career on the lecture circuit, her spirit is broken, and she dies regretting her fall from innocence. Washington Hawkins, the eldest son who has drifted through life on his father’s early promise that he would be “one of the richest men in the world,” finally gives up the family's ownership of the still-unimproved land parcel when he cannot afford to pay its $180 of taxes. He also appears ready to overcome his passivity: \"The spell is broken, the life-long curse is ended!\" Philip, drawing upon his engineering skills, discovers coal on Mr. Bolton's land, wins Ruth Bolton's heart and appears destined to enjoy a prosperous and conventionally happy marriage. Henry and Sellers, presumably, will continue to live gaily by their wits while others pay their bills."
}