{
    "book_id": "7534826",
    "mid": "/m/0264njs",
    "title": "The Yiddish Policemen's Union: A Novel",
    "author": "Michael Chabon",
    "publication_date": "2007-05-01",
    "genres": [
        "Alternate history",
        "Fiction",
        "Novel"
    ],
    "text": " The book opens with Meyer Landsman, an alcoholic homicide detective with the Sitka police department, examining the murder of a man in the hotel where Landsman lives. Beside the corpse lies an open cardboard chess board with an unfinished game set up on it. Landsman calls his partner, half-Tlingit, half-Jew Berko Shemets, to help him investigate further. Upon filing a report on the murder at police headquarters, Landsman and Berko discover that Landsman's ex-wife Bina has been promoted to commanding officer of their unit. Landsman and Berko discover that the victim was Mendel Shpilman, the son of the Verbover rebbe, Sitka’s most powerful organized crime boss. Mendel was believed by many to be the Tzadik ha-Dor, the potential messiah, born once in every generation. As Meyer continues to investigate Mendel's murder, he discovers that the supposed \"chosen one\" had taken a flight with Naomi, Landsman's deceased sister. He follows Naomi's trail to a mysterious set of buildings with an unknown purpose, set up in Tlingit territory by Jews. Landsman flies there to investigate; he is knocked out and thrown in a cell, whose walls have graffiti in Naomi's handwriting. The naked and injured Landsman, after a crazed escape attempt, is rescued by a local Tlingit police chief, Willie Dick, who reunites him with Berko. They discover that the mysterious complex is home to a paramilitary group who plan to build a new Temple in Jerusalem. This involves destroying the Dome of the Rock. The American government, led by an evangelical Christian Zionist, has provided support. As Landsman and Berko follow up on this lead, a news report reveals that the Dome has been bombed. American agents apprehend the detectives and offer them permission to stay in Sitka after the reversion if they agree to keep quiet about the plot they have uncovered. Landsman says that he will and is released. Landsman reunites with Bina, frustrated by his failure with the Shpilman case. He keeps going over the chess board in his head, and suddenly realizes that it's not an unfinished game but a puzzle, and that he had seen the same position from the perspective of the other player in Berko's father, Hertz Shemetz's house. Landsman and Bina track down Hertz, and he confesses to killing Mendel at Mendel's own request. Landsman contacts an American newsman with the story. The book ends with Bina and Landsman reunited and ready to face their future wherever they may land in the Diaspora. The book contains a great deal of comic relief. The creative and playful use of the Yiddish language (for example, cops call a gun a \"sholem\" – literally a \"peace\") is an ongoing feature. The juxtaposition of the culture of the shtetl (the Jewish village of eastern Europe) on the Alaskan landscape is also playful and amusing."
}