{
    "book_id": "2129772",
    "mid": "/m/06p3mz",
    "title": "The Prince",
    "author": "S. M. Stirling",
    "publication_date": "",
    "genres": [
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " The action begins in the 2060s and ends in the 2090s. Over that period John Christian Falkenberg progresses from a junior officer in the CoDominium Navy, through a Captain and later Colonel of Marines, to a mercenary leader at the head of Falkenberg's Legion, whose core is composed of officers and NCO's from his former Marine command. Falkenberg is a military genius with a flair for the bold and unconventional, using heavy doses of deception. He has components of Donal Graeme in him, as well as the young Napoleon, though he rejects political power. He has an enemy in Senator Adrian Bronson of Earth, who blames him for the death of his grandson while under Falkenberg's command, and who also opposes Admiral Lermontov, Falkenberg's ally in the Navy. Through the stories, one theme is dominant. The CoDominium is shipping large numbers of voluntary and involuntary colonists to the colony planets. The involuntary colonists cause the most trouble, being used to a welfare state existence in government ghettoes known as Welfare Islands where drugs and entertainment, paid for by the remaining productive members of society, keep them pacified. Relocated to the colony worlds, they gather in city centers and shanty towns. Idealistic reformers take up their cause against the original colonists, who are mostly farmers and large landowners, purportedly in the name of liberty and equality. However, the inevitable outcome would be a short-lived welfare state followed by economic collapse and starvation. Falkenberg and his people are thus on what some would call the wrong side. They act to suppress bandits, rebels and insurgents who prey on landowners, and who may be in cahoots with reforming politicians bent on industrializing the economy. Partly this illustrates the soldier's dilemma, having to obey orders without regard to the rights and wrongs of the cause. It also illustrates Jerry Pournelle's convictions, which echo those of Robert A. Heinlein, that democracy is not the only proper form of government, nor is it always the best given the realities of economics and ecology. In each case in the stories, the nominal democrats are likely to lead their societies to destruction. Often, their opponents are not much better morally, but less likely to destroy their world. The weapons and tactics employed are easily recognizable to a 20th century reader. Indeed a major point in the narrative is the likelihood that, given the need to import all advanced technology, the mule would be a better vehicle than the truck on a colony world, and a tank or two might be the deciding factor in a campaign. The weapons are rifles, mortars and light artillery. A few helicopters are available, but in some situations they are vulnerable to missiles fired by ground troops. Originally published as the novel West of Honor, later incorporated into Falkenberg's Legion Founded by religious zealots, Arrarat's society is besieged by well-organized (and well-supplied) bandit gangs composed mainly of involuntary colonists. The story is a first-person narrative by newly-commissioned Lieutenant Harlan (Hal) Slater of the CoDominium Line Marines. Falkenberg commandeers him and any other available soldiers to form a provisional battalion to be sent to Arrarat in response to an urgent request for help from the governor. On arrival they find that they are not at all welcome. The governor had asked for a much larger (and more experienced) unit to deal with numerous lawless bands in control of much of the countryside. The military men have other concerns, however. They fear the havoc restless soldiers will create in the capital. To avoid this Falkenberg elects to take the marines up-river to the bandit-occupied Fort Beersheba, an old fort built by the Line Marine regiment that had initially pacified the planet. Slater is tasked with taking and holding Fort Beersheba in a daring night assault using one company of airlifted troops, while Falkenberg marches the remainder of the newly organized 501st Line Marine Battalion up the river valley toward him. Holding the fort is not easy - though disorganized and untrained, the rebels have plenty of weapons with which to pummel Slater's A Company. Although A Company takes heavy casualties, Slater holds his position as the anvil to Falkenberg's hammer and the bandits attempting to flee from the CoDominium forces are destroyed. After establishing the fort as a base, Slater and the other officers watch the restless and combat-eager marines suffer more and more from a military kind of cabin fever which they call the Bug. To combat this growing problem, Falkenberg forces the reluctant planetary governor to move against the bandits tyrannizing the farmers of the Jordan Valley who simply want to farm and be let alone by both the central government and the bandits gangs. Meanwhile Falkenberg directs a cleaning out of the farther reaches of the colony. However, the governor's campaign goes poorly and his forces are besieged in the town of Allansport, forcing him to call Falkenberg for help. Slater takes A Company to bait the enemy south of Allansport, and ends up holding off a major enemy counter-attack and occupying the strategic hill called the Rockpile, taking extreme casualties. However, because of Slater's actions the enemy is defeated, with Slater severely wounded and medevacked to the capital. However, the political situation is much more complicated. The religious farmers who had been oppressed by a gang of ex-convicts begin avenging themselves on anyone who collaborated with the bandits; while the colonial governor, who was trying to use the bandits to generate revenue to set up industries on Arrarat to provide employment for the time-expired convicts, becomes an enemy. How much of an enemy he will be is debatable, as he is in the Bronson camp and Bronson has no use for losers. The story ends with the newly promoted Major Falkenberg recruiting the now Captain Slater (the youngest in the history of the fleet) into joining him in a transfer to Falkenberg's new command, the 42nd Line Marine Regiment, and Slater's Arrarat-born girlfriend Kathryn agreeing to join him. Originally part of the novel The Mercenary, later incorporated into Falkenberg's Legion Falkenberg has been recruited by Admiral Lermontov of the CoDominium fleet to create a military force that can support a government on one of the colony planets, providing the Fleet with a base when the CoDominium collapses, taking Earth with it. He is courtmartialed and discharged from the CoDominium Marines on a technicality in order to operate as a mercenary, though thanks to his conflict with Senator Bronson of Earth, he was likely to be arrested anyway. On Hadley he encounters the same situation as on other colonies, with the added element that the CD is pulling out. The authorities left behind are trying to create power bases by raising armies, some from landowners, some from industrialists, some from the convicts and involuntary colonists. Falkenberg, nominally working for the government in power, begins training his Mercenary Legion, using a battalion of officers and noncoms from his Marine regiment, the 42nd Line Marine Regiment, who have arrived as 'colonists,' as the cadre. Eventually this force, plus a regiment of local troops trained separately, allows him to dictate the outcome on Hadley. One of the local officials who had been involved with training that regiment attempts a coup, but is killed by Legion troops anticipating the attempt. The reason for the coup is an imminent takeover by \"democratic\" populist forces organizing the underclasses. Since all resources are already being used to feed the underclass, any takeover would lead to collapse. Having foiled the coup, Falkenberg carries out a military assault on the populists in a stadium, killing thousands and eliminating their leaders. Though in theory the odds are a thousand or so Legion soldiers against ten times as many civilians, some with firearms, in practice the battle IS entirely one-sided, and depicted as such by Pournelle - as in all cases where trained, well-organized and determined soldiers face untrained civilians. The scene of the soldiers descending from the topmost level of the stadium, firing in volleys, is very like the classic Odessa Steps sequence in the movie The Battleship Potemkin (except that the sympathies are completely reversed). The ruthlessness of the assault is reminiscent of Napoleon's tactics used when dealing with uprisings in Paris. The colourful description \"There was too much blood, blood cascading down the steps, blood pouring down stairwells\" might be partially derived from medieval chronicles describing the conquest of Jerusalem by the Crusaders. The scene as described also sounds remarkably like Belisarius' slaughter of the Nika rioters in the Hippodrome in 6th century Constantinople. The colony is left in the charge of the government's one remaining Vice President, a technical operator who understands the need to remove the population to the countryside and stabilize the agricultural economy. Falkenberg, angered by the necessity of his actions and fully aware that he had perpetrated an atrocity - though convinced it was necessary and unavoidable - takes the Legion and departs. Later, Pournelle, tongue in cheek, provides the official version of \"the government of Hadley thanking Falkenberg for suppression of civil disturbances\". Originally a short story \"His Truth Goes Marching On\", later incorporated into Prince of Mercenaries Captain Peter Owensford of Falkenberg's Legion recounts how, as a Lieutenant in a Volunteer Brigade sponsored by the Earth Humanity League, he was part of an intervention on the side of Republican forces against the local rulers, a Spanish aristocracy known as Carlists. Thanks again to dumping of colonists from Earth, the Santiago colony on Thurstone has progressed to de facto slavery by debt bondage in order to maintain social order. Parallels with the Spanish Civil War are many and, according to the author, intentional. The campaign is brutal, especially with a detached officer corps of political appointees unable to make proper military decisions. A \"political officer\" in the zampolit Soviet style, parroting liberty and atheism instead of communism, overrules Owensford's tactical decisions and impedes his training of the men. In the end, after losing many troops, Owensford catches the officer and some cronies preparing to use an atomic bomb to destroy his command and provoke the CoDominium Navy to act against the Carlists. He confiscates the bomb and attempts to retreat; but is caught in a Carlist advance. Eventually he surrenders to mercenary forces (who as detached professionals are less likely to execute him out of hand), and becomes a mercenary himself. His commanding officer in the mission, Captain Anselm \"Ace\" Barton, has already done so. Originally the novel Prince of Mercenaries. Parts of the novel incorporate the short story \"Silent Leges\". On the hot jungle planet of Tanith, Falkenberg is working with Governor Blaine, another Lermontov ally. Tanith is the source of a drug used in the Welfare Islands, borloi, and the revenue from that traffic is being used to support the Fleet as the Senate on Earth cuts its support year by year. Most of the workers on the plantations are convicts. Falkenberg is helping to deal with a rebellion in the plantations. He is also helping Blaine to support Lermontov. Here Prince Lysander of Sparta, a planet founded with certain political ideals by the Constitutional Society, comes to learn about Falkenberg. He finds himself in the middle of a plot to hijack borloi away from the Navy on behalf of Senator Bronson. Enlisting with Falkenberg as a junior officer, he learns the realities of military life. The opposition is another force of mercenaries commanded by Ace Barton. They foil the plot, but now Bronson is determined to undermine Sparta. Barton and Falkenberg broker a truce, with Barton rescuing Falkenberg when one of the locals reneges on the agreement and takes Falkenberg hostage. Barton's part in the rebellion means he has to leave the planet, and with few options, he re-enlists with Falkenberg, who sends him to Sparta. Lysander commits himself to the plans of Lermontov and Falkenberg to use Sparta as a base for the Navy after the CoDominium collapse. Originally a short novel, \"Sword and Scepter\". Part of the novel The Mercenary, later incorporated into Falkenberg's Legion Falkenberg departs Tanith for a contract on the planet New Washington. This is one of a pair of planets, orbiting a common center which itself orbits a red dwarf star. It is one of the farthest colonies from Earth, being over a hundred parsecs away. The two planets are tidally locked, so they always present the same face to each other. As day progresses to night on New Washington, the side of the sister planet Franklin facing it goes from night to day. One revolution takes 40 hours. The pair revolve around their star in 52 days. New Washington was founded by Franklin dissidents. Now that certain ores have been found on New Washington, Franklin has invaded with CoDominium connivance and mercenary help. Falkenberg is hired to throw out the invaders. As usual, the political class on New Washington is not entirely behind his military objectives. He is able to execute stealthy takeovers of crucial installations to give him an operational base, from which he takes over large amounts of territory on behalf of the rebel government. The campaign eventually comes to a head when Falkenberg's forces come up against a band of Scottish mercenaries from the planet Covenant and holds them at a pass in the mountains, inflicting devastating casualties with his artillery. The leaders of the local militia leaders are outraged when Falkenberg allows an extravagantly long cease-fire with the Coventanters and demand that Falkenberg now try to force the pass himself, however the rebel officials Falkenberg has left behind begin illegal reprisals against civilians and Falkenberg leaves his force guarding the pass and returns to the capital. At this point a CoDominium ship appears, ostensibly to stop the conflict which is breaching the Laws of War. In fact the commander of the ship is a Lermontov ally. The danger was that Franklin would be able to build its own Navy and threaten Lermontov's plans if the invasion succeeded. The scheme was to pacify the planet at minimum cost by creating enough trouble for the CoDominium to order mercenaries on both sides to leave, at which point no credible military force would be present. This turns out to be the real reason Falkenberg did not try to force the mountain pass. However, Falkenberg has decided to stay. He secures a land grant for his Legion, turning them into settlers. In the end Falkenberg becomes Protector of New Washington. Originally the novels Go Tell The Spartans and Prince of Sparta, co-written with S.M. Stirling The remaining narrative takes place on Sparta, leading up to the acclamation of Lysander as Imperator by the Navy and Marines when the CoDominium collapses. However, before this can happen, the conflict between Spartan society and the convict underclass must be resolved. Sparta is a constitutional dual monarchy, one King taking external affairs, the other King being involved in the economy. Citizenship with the right to vote is an earned privilege, as in Heinlein's Starship Troopers. Citizens are also expected to join the militia, on the model of Swiss citizen-soldiers. Other than enforcing basic laws, education and military service, the government does not intervene in the lives of the people. Prosperity or starvation is the responsibility of the individual. The underclass can attempt to become Citizens, and many do. For the rest, the usual populists try to organize them into a Movement. Paradoxically, Sparta's openness and political transparency makes it more vulnerable to such a Movement than a dictatorship such as Carlist Santiago. One such movement has a guerilla army of self-styled Helots. After the episode on Tanith, Senator Bronson begins building up the open and covert oppositions on Sparta. His motives are actually not far removed from Lermontov's - he too wishes to set up a power base among the colonies to preserve his version of civilization when the CoDominium collapses. However, his appetite for personal and dynastic power prevents him from finding common ground with Lermontov, Blaine and Falkenberg. He rejects their attempts at a truce. Instead he sends in supplies and advisors to organize the Helot forces, and employs techno-ninja saboteurs from the Meiji colony to infiltrate the data systems on Sparta. To counter this, a cadre of Falkenberg's Legion does not accompany him to New Washington, instead going to Sparta to create the nucleus of an army. Leading this portion of the Legion is Peter Owensford, along with Ace Barton, the mercenary Falkenberg defeated on Tanith, and Benjamin Whitlock, a sociologist and political historian who, with his Southern U.S.A. roots, may be a stand-in for the author, Jerry Pournelle, who is from Louisiana. The rebels are led by a woman, Skida \"Skilly\" Thibodeau, who strongly resembles the actress, singer and model Grace Jones. Although highly intelligent and an amateur student of military history, she devises complex campaign plans which the Legion is able to detect and foil, despite the Helots' advanced weaponry and sabotage campaigns supporting her. Much of the narrative is taken up with these bloody campaigns, in which Skilly's rebels employ artillery, missiles, rape, murder, poison gas and civilian massacre in order to undermine Spartan society. They have help from former CoDominium officers in the pay of Bronson. The penultimate act of the Bronson campaign is an attempt to use the Marine garrison on Sparta, with support from suborned Navy ships and a general uprising by Helot elements in the capital, to destroy the government. The armed Citizens stand and fight, so much that the Marines switch sides. The Navy restores proper command, almost engaging in a fratricidal space battle. Lysander's aging father is killed when the palace is assaulted. In the final chapters, one of Skilly's officers, a nephew of Bronson's, defects and tells Lysander's generals that there is an atom bomb somewhere in the city. Skilly then contacts the commanders, offering the location of the bomb in return for a safe-conduct off the planet. They grant her this, but some of Falkenberg's men simply set out to do privately what the government cannot do publicly. The problem of the underclass is dealt with in a fashion that again echoes Heinlein's notions, this the one of being sent to Coventry - those who do not accept Sparta's social contract will be given basic tools and sent to uninhabited islands to work out their own fate without interference. Finally, with the CoDominium in collapse and all Earth authority vanished, the Generals and Admirals acclaim Lysander, now King of Sparta, as Imperator."
}