{
    "book_id": "4525718",
    "mid": "/m/0c74z6",
    "title": "The Gate of Time",
    "author": "Philip José Farmer",
    "publication_date": "1966",
    "genres": [
        "Alternate history",
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " Roger Two Hawks, an Iroquois serving as a combat pilot in WWII, is shot down during a raid on Ploieşti, Romania. While parachuting he feels a strange dizziness. Being hidden by locals, he realises that they neither look nor speak like Romanians, but rather resemble Native Americans and speak a language distantly resembling that of his own tribe. The mystery is resolved when he sees a globe and finds that he is in a world where the continent of America does not exist, having been drowned for the whole of humanity's tenure on Earth. As a result, the ancestors of the various Native American tribes did not cross the non-existent Bering Strait but wandered westward into Europe, taking the general place of the Slavs in our history. Thus, the Iroquois live in Romania and the Ukraine, the Aztecs in Russia, and so on. Though very different from our world, in this reality, too, a war is going on resembling the one which Two Hawks left behind, with a kind of aggressive Germany-analogue trying to conquer everybody else (though its dominant people are not Germanic but rather Lithuanian). Two Hawks very quickly gets involved. His knowledge and abilities are very much in demand, since this world does not yet have heavier-than-air flight, and its possession could decide the war. He goes through a very fast-paced series of adventures, involving such elements as Hittites who survived into the 20th century, a Luftwaffe pilot who also ended up in this world, an England which had never known a Roman Empire nor a Norman Conquest but has many Cretan and Semitic elements in its makeup, an unknown chapter in the life of Elizabethan adventurer Humphrey Gilbert, an Arab-colonised South Africa and a mysterious island on the site of our world's Colorado, where an underground Polynesian temple is to be found. As can be expected, Two Hawks also experiences a most tempestuous love affair."
}