{
    "book_id": "10819244",
    "mid": "/m/02qr0v_",
    "title": "The Princess Diaries, Volume V: Princess in Pink",
    "author": "Meg Cabot",
    "publication_date": "2004-04",
    "genres": [
        "Young adult literature"
    ],
    "text": " Mia Thermopolis is in a royal puddle. Her one and only boyfriend won't take her to the prom and her 15th birthday is coming up. Her friends try to convince her that he'll ask her on her birthday and she believes that fantasy. On the day of her birthday, Michael and his band sing a song for her and turn up their amps so that everyone in the school can hear. He earns detention and makes it in time for Mia's birthday dinner. She receives gifts from her family and Michael that she wouldn't expect, along with the fact that Michael got her a snowflake necklace which symbolises when they fell in love at the winter dance. At the dinner, disaster strikes. Grandmere's poodle jumps out of her purse and runs around the restaurant causing a busboy to spill a meal on Grandmere's suit and getting the busboy (whose name is Jangbu) fired. Then comes the birthday party. Mia and her friends play a game of Seven Minutes in Heaven when her parents are out getting more birthday supplies. In the game she asks Michael to prom but he declines, saying he'd rather go bowling. When it's Lilly's turn, she enters the closet with the handsome Jangbu (whom she met while protesting for him), and apparently reaches second base too, Instead of taking her boyfriend Boris into the closet with her, making Boris break down before Mia's parents arrive and catch them, sending all the guests home. At school, Boris tells Lilly that he loves her so much, he'll drop a globe on his head if she doesn't take him back, and on her refusal he accidentally does so, injuring his skull, luckily Mia and Michael stop him from severely bleeding. After school, Tina meets up with Boris to comfort him and they become a couple. Later on, all the busboys in town go on strike after the incident at the restaurant. This ruins the venue for the senior prom, but Grandmere steps in and gives them a place: The Empire State Building. Mia blackmails Lana into letting Michael's band play at the prom. Michael and his band play at the prom and Michael and Mia reach second base. During the prom Mia's mother also gives birth to Rocky Thermopolis-Gianini. Jangbu the busboy returns to his home country and leaves Lilly thinking about her decisions in leaving Boris who is now in love with Tina."
}