{
    "book_id": "364618",
    "mid": "/m/01_vcl",
    "title": "The Good Soldier Švejk",
    "author": "Jaroslav Hašek",
    "publication_date": "",
    "genres": [
        "Black comedy",
        "Satire",
        "Novel"
    ],
    "text": " The story begins in Prague with news of the assassination in Sarajevo that precipitates World War I. Švejk displays such enthusiasm about faithfully serving the Austrian Emperor in battle that no one can decide whether he is merely an imbecile or is craftily undermining the war effort. However, he is arrested by a member of the secret police, Bretschneider, after making some politically sensitive remarks, and is sent to prison. After being certified insane he is transferred to a madhouse, before being ejected. Švejk gets his charwoman to wheel him (he claims to be suffering from rheumatism) to the recruitment offices in Prague, where his apparent zeal causes a minor sensation. Unfortunately, he is transferred to a hospital for malingerers because of his rheumatism. He finally joins the army as batman to army chaplain Otto Katz; Katz loses him at cards to Lieutenant Lukáš, whose batman he then becomes. Lukáš is posted with his march battalion to barracks in České Budějovice, in Southern Bohemia, preparatory to being sent to the front. After missing the train to Budějovice, Švejk embarks on a long anabasis on foot around Southern Bohemia in a vain attempt to find Budějovice, before being arrested as a possible spy and deserter (a charge he strenuously denies) and escorted to his regiment. He is then promoted to company orderly. The unit embarks on a long train journey towards Galicia and the Eastern Front. Stopping in a town on the border between Austria and Hungary, in which relations between the two nationalities are somewhat sensitive, Švejk is again arrested, this time for causing an affray involving a respectable Hungarian citizen and engaging in a street fight. After a further long journey and close to the front line, Švejk is taken prisoner by his own side as a suspected Russian deserter, after arriving at a lake and trying on an abandoned Russian uniform. Narrowly avoiding execution, he manages to rejoin his unit. The unfinished novel breaks off abruptly before Švejk has a chance to be involved in any combat or enter the trenches, though it appears Hašek may have conceived that the characters would have continued the war in a POW camp, much as he had done. The book also includes a very large number of anecdotes told by Švejk (usually either to deflect the attentions of an authority figure, or to insult them in a concealed manner) which are not directly related to the plot."
}