{
    "book_id": "6266783",
    "mid": "/m/0fzqbb",
    "title": "The Boats of the \"Glen Carrig\"",
    "author": "William Hope Hodgson",
    "publication_date": "1907",
    "genres": [
        "Fantasy",
        "Speculative fiction",
        "Horror",
        "Fiction"
    ],
    "text": " The novel The Boats of the \"Glen Carrig\" starts in the middle of an adventure. The subtitle reads: Being an account of their Adventures in the Strange places of the Earth, after the foundering of the good ship Glen Carrig through striking upon a hidden rock in the unknown seas to the Southward. As told by John Winterstraw, Gent., to his Son James Winterstraw, in the year 1757, and by him committed very properly and legibly to manuscript. We learn nothing else from the text about what happened to the &#34;Glen Carrig,&#34; its captain, or any of the other people aboard the ship. The text begins: Now we had been five days in the boats, and in all this time made no discovering of land. Then upon the morning of the sixth day came there a cry from the bo'sun, who had the command of the lifeboat, that there was something which might be land afar upon our larboard bow; but it was very low lying, and none could tell whether it was land or but a morning cloud. Yet, because there was the beginning of hope within our hearts, we pulled wearily towards it, and thus, in about an hour, discovered it to be indeed the coast of some flat country. The narrator calls this dismal, muddy place the &#34;land of lonesomeness.&#34; The men paddle the two lifeboats up a creek. The air is filled with strange cries and growls. They come across an abandoned ship, and climbing aboard, discover food. The ship appears to have been evacuated in haste, with coins and clothing left behind. While spending the night aboard the ship, the survivors are attacked by a strange tentacled creature. They find troubling notes left by a female passenger aboard the ship, one of which makes reference to a nearby spring. The men locate the spring, but after filling their water containers, they discover horrifying plants that have taken on human shapes, and which produce blood-curdling cries. The survivors quickly flee and head back out to sea. Floating on the open sea, the survivors confront a tremendous storm. The second boat becomes separated from the first, although the narrator reveals that those aboard will eventually make it back to London. The story now concentrates entirely on the survivors in the first boat. The men set up a canvas covering to shield the boat from breaking waves and a &#34;sea anchor&#34; which keeps the boat perpendicular to the waves. The storm is a long ordeal, but the boat and the men come through unscathed. After surviving the storm, the men encounter giant, floating masses of seaweed, and enormous crabs. They pass a number of lost, ancient vessels in this Sargasso Sea, which the narrator calls the &#34;cemetery of the oceans.&#34; After encountering giant crabs and a weird humanoid creature they locate a habitable island. While the men explore, young seaman Job remains in the boat, and is attacked by a giant &#34;devil-fish&#34; (an enormous octopus). Job is struck with an oar and gravely injured. The bo&#39;sun bravely risks his life to bring Job ashore, but Job remains unconscious. The narrator discovers that the boat is badly damaged, and it must be repaired before it can be used again. Things become difficult for the men on the island. The narrator is attacked in his sleep by some kind of tentacled creature, which leaves marks on his throat. The unconscious Job is discovered missing, and a frantic search is carried out. His dead body is discovered in the valley, drained of blood. The men, filled with rage, burn down the island&#39;s forest of giant toadstools, the flames lasting through the night. In the morning, they bury Job on the beach. The bo&#39;sun grimly starts making his repairs to the boat, using wood recovered from another wrecked ship. Ascending to the highest point of the island, the men find that they are quite near to a ship embedded in the weed, and while keeping watch they see a light aboard the ship. Those aboard the ship have built a protective superstructure, which can be closed to resist attacks by the creatures that inhabit the &#34;weed-continent.&#34; The men manage to establish contact with the crew using words written on large pieces of canvas, and begin planning strategies to rescue the people aboard. The evenings on the island get progressively worse. The men are attacked repeatedly by hideous, foul-smelling, tentacled humanoid creatures that swarm over the island in the dark; these can only be kept at bay with huge bonfires. The narrator and several other men are injured in an attack. A seaman named Tomkins goes missing, and Job&#39;s body disappears from his grave, evidently removed by the ghoulish &#34;weed-men.&#34; Although in dire straits themselves, the men on the island retain a strong desire to aid those aboard the ship trapped in the seaweed. Coastal life-saving operations historically could use a small mortar (later known as a &#34;Lyle gun&#34;) to fire a projectile carrying a light rope, which was carefully pre-coiled in a basket to avoid fouling. This would be used to haul a stronger rope, which could be pulled taut and used to accommodate a breeches buoy that could be slid along a rope hawser. This possibility is discussed. The men on the island ask the people aboard the trapped ship if they have a mortar aboard. They reply by holding up a large piece of canvas upon which is written &#34;NO.&#34; The narrator advocates the construction of a giant crossbow to fire a line over to the trapped ship. The bo&#39;sun assents, and the men build the elaborate crossbow, composed of a number of smaller bows that can be fired together to propel a single arrow. The bow can easily launch an arrow past the vessel, but unfortunately when even a light line is attached, the arrows fall far short. All is not lost, though, because another crew member manages to build a large box kite which succeeds in carrying a line to the ship on the first attempt. The men manage to use the light line to pull across successively stronger lines, until they have a heavy rope stretched between the island and the ship. The bo&#39;sun attaches this to a conveniently located boulder, while, the crew of the ship attaches the line to the stump of a mast and uses a capstan to gradually winch the ship closer to the island. Two groups exchange letters by pulling an oilskin bag along the connecting rope. We learn that the ship, which was attacked by a devil-fish, has been stuck in the weed for seven years, and the captain and more than half of the crew are dead. Fortunately the ship carried a great deal of food, and so those aboard have not gone hungry. Indeed, the ship is even able to supply the men on the island with fresh bread, wine, ham, cheese, and tobacco. When the ship is close enough, and the rope high enough above the weed to ensure a safe passage, the narrator rides a breeches buoy to the ship, where he receives a hero&#39;s welcome. He discovers that there are several women aboard: the captain&#39;s wife, who is mad; the &#34;buxom woman&#34; who is now the cook, and the young and eligible Mistress Madison. The narrator and Mistress Madison develop a romance and Mistress Madison, who was only twelve years old when the ship was trapped in the weed, looks forward to re-joining the wider world as a young woman of nineteen. But they are not out of the weeds yet: the bo&#39;sun sends a note indicating that he has doubts about the state of the rope, which has frayed slightly, and insists that it is too dangerous for the narrator to return the way he came. The weed is still a dangerous place, and the ship is attacked again by the devil-fish and by the weed-men. But the crew of the ship works through the night to winch the ship closer to the island, and it is finally freed from the weed altogether. The rest of the men from the island tow the ship around to the far side of the island using the now-repaired lifeboat. At this point in the narrative, the story begins to significantly compress time: Now, the time that it took us to rig the ship, and fit her out, was seven weeks, saving one day. During this time the combined crew disassembles the superstructure, repairs the masts, and installs sails. They try to avoid the floating masses of weed, but brush against one accidentally and are again boarded and attacked by weed-men. Victory against the weed-men is overshadowed by sorrow when it is discovered that the captain&#39;s wife has disappeared during the attack. The bulk of the return journey is condensed into a single sentence: And so, after a voyage which lasted for nine and seventy days since getting under weigh, we came to the Port of London, having refused all offers of assistance on the way. In the concluding sentences of the book we learn that the narrator is a man of some wealth. He marries Mistress Madison, gives gifts to the crew members, and provides a place for the bo&#39;sun, who is now his close friend, to live upon his estate. In the closing of the story the narrator describes how he and the bo&#39;sun often talk about their adventures, although they change the subject when the narrator&#39;s children are around, because &#34;the little ones love not terror.&#34;"
}