{
    "book_id": "5365942",
    "mid": "/m/0dhm7z",
    "title": "The Stranger",
    "author": "Chris Van Allsburg",
    "publication_date": "",
    "genres": [
        "Children's literature",
        "Fantasy"
    ],
    "text": " One fall day, while Farmer Bailey is riding down the road in his truck, he runs over something or someone. At first, he thinks he has hit a deer, but when he gets out to see what he hit, he finds that he has accidentally run over a man. The man tries to flee but loses his balance and falls down. Farmer Bailey takes him to his house, where he and his wife, Mrs. Bailey, discover that the stranger cannot talk. The Baileys call a doctor to examine him. The doctor arrives and takes the stranger's temperature with his mercury thermometer. As the doctor holds it up to his mouth, the stranger blows on it and the mercury freezes. The doctor thinks that his thermometer is broken. Although the stranger isn't seriously hurt, he can't remember who he is or where he's from. The doctor advises the Baileys to give the stranger shelter until he's fully recuperated. They do, and he fits in well with the family and even helps about the farm. One night the stranger comes out to have dinner with the Baileys. They are having soup, and the stranger notices steam rising from his plate. He lightly blows on the bowl, and the steam drifts away. When he blows, Mrs. Bailey feels a draft. Mr. Bailey enjoys having the stranger as his guest, but he also notices how peculiar the weather has been. The stranger goes for a walk in the forest and notices some rabbits and hares. They would usually flee from humans, but they walk toward the stranger. It still feels like summer on Mr. Bailey's farm, and the summer warmth makes his pumpkins grow bigger than normal. The stranger too notices this. He wonders why the trees on the Bailey farm are still green while all the other trees on the other farms are red and orange. One day, however, the stranger blows on a green leaf. When it turns orange, he realizes it's time for him to leave the Baileys. On his last evening at the house, the stranger gets hugs from all the Baileys before he leaves. They come outside to wave goodbye to their friend, but he's disappeared. With the stranger's departure, fall has come to the Bailey's farm, and the trees are now all red and orange. Etched in frost of the farmhouse windows is the old phrase, \"See you next fall.\""
}