{
    "book_id": "17874327",
    "mid": "/m/047dgzl",
    "title": "The Sorceress: The Secrets Of The Immortal Nicholas Flamel",
    "author": "Michael Scott",
    "publication_date": "",
    "genres": [
        "Thriller",
        "Fantasy",
        "Fiction"
    ],
    "text": " Flamel and Palamedes take the twins to Stonehenge, where they enlist the help of Gilgamesh. While the twins are adjusting to the powers Gilgamesh has taught them, Cernunnos returns with the Wild Hunt and attacks the twins and Gilgamesh. Gilgamesh is wounded by the Archon, but the twins use their newly found powers to protect the King. But what Nicholas Flamel withholds from the twins is that Gilgamesh the King is insane. Though he has no aura - and hence cannot use his powers - he can still pass on his knowledge to the awakened human twins. If Gilgamesh refuses to teach the twins, they will be unable to escape back to San Francisco using the Ley Lines and will be trapped in Dr. John Dee's city, his hometown of London, where he is at his strongest. Flamel uses Francis to enlist Palamedes, the Saracen Knight, to help them. Palamedes takes them to his home, a junkyard in London, and they manage to work together to contact Perenelle. Perenelle is trapped on Alcatraz with the friendly but untrustworthy spider elder, Areop-Enap, after narrowly escaping the Sphinx and defeating the Morrigan. Morrigan had been suppressed sufficiently by the Words of Power that resided on the island that her body was retaken by her two sisters, Macha and Badb. Perenelle also makes fleeting contact with Scathach and Joan of Arc by scrying. Areop-Enap and its spider army are then attacked by an onslaught of poisoned flies, killing most of the spiders and wounding Areop-Enap. Billy the Kid has joined forces with Machiavelli in an attempt to kill the sorceress, but Perenelle, aided by Macha and Badb, tricks the pair and steals their boat, travelling back to the mainland with her new ally, the Crow Goddess. Unfortunately, the Dark Elders have awakened an ancient being even more powerful and mysterious than them: an Archon. The Archon, named Cernunnos, is known as the Horned God and is the leader of a pack of wolf people called the Wild Hunt. Cernunnos, the Wild Hunt, and Dr Dee engage Shakespeare,the Gabriel Hounds, Palamedes, the twins, and Flamel in a vicious battle. While making their escape, Josh loses Clarent, and Dee grabs the sword, reuniting it with its twin, Excalibur. The two swords fuse together to make a new sword. They activate the ley lines at Stonehenge and are greeted by Perenelle at the other end. Meanwhile, Scathach and Joan of Arc try to get to Alcatraz to help Perenelle but are trapped in a prehistoric era by Machiavelli, who had deliberately set the trap to snare them. They do not know how to return to their time and must try to survive while they wait for Flamel and the others to find and rescue them."
}