{
    "book_id": "598935",
    "mid": "/m/02v1lh",
    "title": "The Stars My Destination",
    "author": "Alfred Bester",
    "publication_date": "1956",
    "genres": [
        "Science Fiction",
        "Speculative fiction",
        "Fiction"
    ],
    "text": " Gully Foyle is the last remaining survivor of the Nomad, a merchant spaceship attacked in the war between the Inner Planets and the Outer Satellites and left drifting in space. He blindly waits for over six months for a rescuer. Seeing a spacecraft named Vorga, he sets off signal flares and rejoices thinking he will be saved. The Vorga however passes him by, leaving him to die. This callousness triggers a consuming rage in Foyle that transforms him. Vengeance becomes his mission. Improvising a repair to Nomads engine, Foyle sends the ship into the asteroid belt, where it is captured and incorporated into the Sargasso asteroid, a body built of the wreckage of other crashed ships. The inhabitants, who call themselves the Scientific People, tattoo a mask reminiscent of tā moko onto Foyle's face, with the word \"N♂MAD\" across his forehead, and marry Foyle to one of their women. Once he recovers from his ordeal he blasts out of the asteroid and is picked up by a ship from the Inner Planets. He does not know about his tattoo until one of the hands on the Navy ship gives him a mirror. Disguised as a disabled jaunter, among others who are undergoing therapy for head injuries that have affected their ability, Foyle plans an attack on the Vorga. Before he can do this, he is discovered by his instructor, Robin Wednesbury, a telesend (a kind of telepath who can send thoughts to others, but not receive them). He blackmails her into helping him, but his attack on the Vorga fails and he is captured by security forces working for Presteign, the aristocratic head of the huge Presteign corporation (owner of the Vorga). They grill Foyle about Nomad but he refuses to talk, and Foyle is thrown into the Gouffre Martel, a complex of underground caves in the Pyrenees. These are used as a prison, where the inmates live in total darkness, unable to form a picture of their location in order to jaunte. Foyle discovers that an acoustic quirk in the prison caves allows him to communicate with a fellow prisoner, a woman named Jisbella McQueen. They plot an escape, and McQueen arranges to have Foyle's tattoos removed, but the removal is not total. Although Foyle's face looks normal most of the time, when he becomes emotional or excited, the rush of blood to his face brings back the markings. Dagenham raids the clandestine hospital where the tattoos are being expunged, but Foyle and Jisbella escape in a ship and head out to the Sargasso Asteroid where the Scientific People live. There they recover the ship's vault from the Nomad. Besides a fortune in platinum, it contains something else. As the vault is ejected into their ship, Dagenham's men arrive and capture Jisbella, while Foyle, still obsessed, abandons her and jets away. With his new fortune, Foyle intends to find the Captain of the Vorga, avenging himself on a person rather than the ship itself. He also realizes that he must learn self-control, as the manifestation of his facial markings will give him away. Using the alias \"Geoffrey Fourmyle of Ceres,\" Foyle re-emerges as a rich dandy who charms high society with his antics, leading a troupe of freaks called the Four Mile Circus. Foyle has extensively altered himself physically and rigorously educated himself. He seeks out Robin Wednesbury, now socially blacklisted due to her family connections with the Outer Satellites, and offers her a chance to reunite with her family if she will use her one-way telepathy to help him navigate high society. She reluctantly agrees. During a society party, Foyle meets Jisbella McQueen again, now the lover of Saul Dagenham, the detective who interrogated Foyle just before his escape from Gouffre Martel. He learns the real reason Dagenham wanted the location of Nomad: the vault contained a sample of a substance called PyrE, which Foyle had himself found, but whose nature he was unable to determine. Then, during a sudden nuclear attack by the Outer Satellites, Foyle is smitten with Presteign's daughter Olivia, who has been watching the attack with her altered sense of sight: she sees only infrared light, but not the normal visible spectrum. Foyle grabs her with intent to ravish her before they die, only to find out that she has deceived him. She tells Foyle that to have her, he must be as cruel and ruthless as she is. Foyle continues his hunt for the Vorgas captain, only to find that each of the crew has been given a kind of implanted death-reflex to prevent mention of the ship. Throughout these episodes, Foyle is tormented by the appearance of the \"Burning Man\", an image of himself on fire. He finally closes in on the Captain, now a neo-Skoptsy (a person with all sensory nerves disabled) living on Mars, and therefore immune to conventional torture. Foyle kidnaps a telepath, interrogates the Captain in her crypt, and finds that Olivia Presteign was the commander of the Vorga – moments before commando soldiers storm the crypt. Foyle is rescued by Olivia. She had been transporting refugees for cash, only to murder them all by throwing them out into space. Her victims included Robin's family. She now sees a kindred spirit in Foyle, a freak who cannot live with \"normal\" humans, someone who can match her urges to destroy and conquer. Foyle, driven by rage, remorse, and self-pity, tries to give himself up to the authorities. He unwittingly turns himself over to a lawyer, Regis Sheffield, who turns out to be a double agent working for the Outer Satellites. They are interested in him because apparently Foyle holds the holy grail of jaunting: space travel. He had been planted as a decoy to draw Inner Planets ships towards an ambush, but had jaunted back into the wreck of the Nomad from hundreds of thousands of miles away. After Presteign learns of Olivia and Foyle being in cahoots, he suffers an epileptic seizure and babbles that PyrE is the most powerful explosive ever created. It is activated by telepathy, and so Robin (now having turned herself in to the authorities as well) is enlisted to activate it. The PyrE explodes, causing many incidents of destruction worldwide, but mostly at the HQ of the Fourmyle Circus in St. Patrick's Cathedral, where Foyle and Sheffield are holed up. The explosion partially collapses the building, killing Sheffield and trapping Foyle, unconscious but alive, over a pit of flame. In the wreckage and confusion of the detonation, suffering from synesthesia brought on by the effects of the explosion on his neurological implants, Foyle once again jauntes through space and time, revisiting key moments of his journey to this point. Some of the synesthesia is conveyed to the reader visually, through graphic renditions of the text created by the noted illustrator Jack Gaughan.Review by Tal Cohen, dated June 2, 1999. Retrieved 2011-08-20.American Buddha Online Library \"Special calligraphy and ideographs in Chapter 15 created by Jack Gaughan.\" Accessed 2011-08-20. As The Burning Man, he appears to himself during the quest, as well as in other times and places, such as during his escape from the Gouffre Martel, when he distracts the guards enabling him and Jisbella to break out, and in space when Foyle was aboard the Nomad. Finally he jauntes to some unknown location in the future, where Robin telepathically gives him instructions (relayed from himself) for the exact route he needs – allowing for his confused senses – to escape the collapsing cathedral. On returning to the present, Foyle is pressured from all sides to surrender the rest of the PyrE, or to let mankind benefit from his ability to space-jaunte. To Foyle's ears, this sounds like a no-win situation: to unleash a deadly weapon on the human race, or to let humanity spread like a disease by space-jaunting. He finally leads them to the vault where he has the rest of the PyrE stored, but steals it and teleports across the globe, throwing one slug of PyrE after another into the crowds and insisting the people be told what it is. \"I've given life and death back to the people who do the living and dying,\" he says. He delivers one last speech, where he asks humanity to choose either to destroy itself or follow him into space. At this point he realizes the key to space-jaunting. It is faith: not the certainty of an answer, but the conviction that somewhere an answer exists. He then jauntes from one nearby star to another. In the course of his star-hopping, Foyle locates the answer for the future: new worlds suitable for colonization reachable only if he can share the gift of space-jaunting. Finally he comes to rest in the locker on Nomad, where he spent his time before being reborn the first time. The Scientific People now see him as a holy man, and take up vigil to await his revelation."
}