{
    "book_id": "9601299",
    "mid": "/m/02plg2d",
    "title": "The House of Pendragon I: The Firebrand",
    "author": "Debra A. Kemp",
    "publication_date": "2003-10",
    "genres": [
        "Fantasy",
        "Historical novel"
    ],
    "text": " King Arthur, the Pendragon, lies dead after the Battle of Camlann. Lin, his only child by his queen, Gwenhwyfar, is one of five remaining members of the Round Table. Civil strife has laid waste to the unified Britain forged during Arthur's reign. In Lin's warrior persona she suppresses her gender. Through years of habit, she presents an outward calm for the soldiers who have come to accept a woman's presence and command in the army. To be an effective fighting unit, they cannot be distracted by her gender either. Lin tells the men of her half-brother, Modred's defeat and that her father has been taken to a place of healing. Beneath her stoic facade, she is torn by grief and self-doubt. She knows a mere handful of men still live who would support her claim as Arthur's heir. In her mind, it is not enough. In her mind, she is unworthy to follow in her father's wake. She denies her birthright and does not return to Camelot. Twelve years pass in restless wandering. Nightmares of Camlann and of a past that she has kept hidden continue to plague her thoughts and dreams. She is now married to GAHERIS (RIS), her father's nephew, by whom she has borne three children; BEAR (ARTHUR), MELORA, and GERNIE, with a fourth child expected. Her children are unaware of their mother's true identity as the Pendragon's daughter. The family at last camps in the shadow of Camelot. The homecoming is at once difficult and joyous. Lin's secret gnaws at her mind constantly. The children are excited and curious, having heard countless tales of Camelot from their uncle, DAFYDD. While exploring the deserted fortress of Camelot, Bear questions his mother and forces her to realize he is ready for the truth. Yet she does not reveal this immediately. Instead, Lin relates her childhood as a slave in QUEEN MORGAUSE's holding of DUNN NA CARRAICE in the distant kingdom of Orkney, before she learned the truth of her birth and her own royalty. Once begun, the catharsis must run its course. Lin's earliest memories are of sorrow and hardship. At five years old, the only mother she knows dies, leaving Lin alone with Dafydd, the boy she believes is her true elder brother. She hides the pain of abandonment from others and establishes her lifelong pattern of self-denial and internalization. While at work, Lin often watches the royal family. She especially enjoys Orkney's princes sparring in the practice yard. Prince Modred, the youngest, gains her sympathy when she sees the cruel jokes his older brothers play on him. She even comes to the prince's aid. Modred resents anyone knowing of his weak moments. That a mere slave witnesses two of those moments is not to be tolerated or forgiven. Dafydd is proud his sister displays such compassion. He feels duty-bound to take care of Lin after his mother's death. During the next few years, he hones his skills as a story-teller. His tales of Camelot's honor ease many of the horrors of slavery which surround him and his sister. Then he receives his leather slave's collar, a coming of age \"gift\" from Queen Morgause, their mistress. Their owner. The event shatters Lin's fragile peace with her lot in life. Questions of the established order form in Lin's mind. She rejects her brother's slavery to the point of a futile attack on the overseer. She is given a small taste of the lash as a lesson. Dafydd is far more accepting of their situation than Lin. He finds it better to survive with as few scars as possible. Lin's beating breaks his heart. He tries to dissuade her rebellion while tending her wounds later that night. For two years, he seems successful. At best, Lin's calm is temporary. On Lin's twelfth birthday, she is collared like so many slave before had been. She also gains Prince Modred as her master. The prince is now seventeen. He has recently been told by his mother that his father is the celebrated Arthur Pendragon and that Lin is his half-sister, his father's legitimate child. She stands in his way to the throne. She is the same slave who helped him escape the outhouse his brothers had locked him inside of a few years ago. She heard his screams, she must know his fears. Years of competition with his older brothers and warrior training have set the pattern of violence in Modred. He has never held any sort of power in Dunn na Carraice. He has ultimate power over Lin. Lin only knows and reacts according to her instincts. The blood of kings flows through her veins. Far from subduing Lin—as Morgause hopes—slavery brings out Lin's strengths. She resists her collar, refusing to use the word \"master\" or bend her knees in subservience. For her open rebellion against the collar, Modred has Lin flogged, enjoying the sight of her pain. Afterwards, he rapes her to further prove his mastery over his possession. Again, Dafydd cares for his sister. He does not understand her defiance. He wants her to accept reality. They are slaves and can do nothing to change that fact. One thing he does know about Lin is her need for his stories about Camelot. He redoubles his efforts. To Lin, Camelot is a beacon of hope and of equality—things Dunn na Carraice and her life lack. Prince Modred treats her like a beast, branding her as his property. He embodies the inequality she despises. Each fuels the passions of the other. While outwardly continuing her resistance, the intensity of the punishments she endures take their toll on her body and her mind. Lin begins to believe in her unworthiness to be loved and to love in return. She sees herself as damaged goods no husband will ever want to touch while at the same time having no desire to ever be touched by a man again. Her sleep becomes tortured by nightmares and she does not eat, except when Dafydd presses the issue. Easily provoked by Modred, she invites the beatings in the hope the next one will bring release from her suffering through death. Lin's self-neglect grieves Dafydd, yet he admires his sister's strength of will and the courage she displays in defying Prince Modred. He has come to understand that resistance is as important to Lin as story-telling is to himself. He cannot dream of not weaving his tales. Lin's struggle reminds Dafydd, and all of Orkney's slaves, of their humanity. Dafydd becomes determined to keep his hero, his sister, alive. Obsessed with quelling his slave's spirit, Prince Modred's abuses intensify. He soon includes Dafydd in his tortures, since he knows Lin feels Dafydd's pain as her own. Lin realizes there is only one cruelty Prince Modred has left with which to break her. It is but a matter of time before he uses it. The time is brief. But through a misunderstanding in the actual order given, Lin is sent to the auction block along with her brother. She watches Dafydd displayed on the block, filled with horror and utterly defeated. Meanwhile, Modred is unaware of his moment of triumph. Lin's sale is not part of his plan. Lin loses all hope when she watches Dafydd disappear after being sold. In his memory, she goes to the block as defiant as ever and brings but a few coins for those who would profit from human flesh. She is taken to Britain's mainland in the cargo-hold of a ship laden with other souls sharing her fate. Not long after disembarking, Lin discovers that Dafydd had been on the ship also, as a cabin-boy. But the shadow of yet another auction looming in their future taints their joy of reunion. Now on foot, the slavers' destination is the northern British city of Ebrauc. Unbeknownst to the slave traders, the Pendragon is in residence in Ebrauc when they arrive on market day. King Arthur has tried to outlaw slavery in his realm, yet has been unable to stop it. Performing errands, CAI, seneschal and foster-brother to the Pendragon, passes a pavilion with an auction in progress. Curiosity leads him inside to investigate. Appalled to see children for sale, he uses his authority to halt the activity and cuts away the collars from those who have not been sold. Lin is among them. Cai notices the lean, auburn-haired girl with the bruised face and aloof stance in the midst of the others. Something about the girl draws his attention to study her more closely. Recognition sparks. She bears an uncanny resemblance to the Queen. Cai takes Lin to Arthur. Arthur also sees his wife's features in the child standing before him. After a long interview he has no doubt, the girl who says she came from Orkney is his long-missing daughter, long-believed dead. He welcomes Lin to his residence and tells her the truth of her identity.. He explains how her mother, Gwenhwyfar, did not know of the serious rift between him and his half-sister, Morgause. Gwenhwyfar only thought to send their daughter to fosterage among kin. Lin is sickened by the news that Modred is her half-brother. She tells her father of the rapes and of the child she miscarried not many days before. Furious with his half-sister and the boy he sired, Arthur wants to avenge his innocent daughter for the abuse she endured as a slave. He is willing to leave immediately for Orkney. Lin has selfish reasons for stopping her father. She views slavery as a stigma and wants it to remain secret. Public vengeance means exposure. She also realizes she cannot let her father fight her battles. When the time comes for her to confront Modred, she knows she cannot be hiding behind her father. She must face Modred alone as she has always done."
}