{
    "book_id": "1400224",
    "mid": "/m/04zkwn",
    "title": "The Sands of Time",
    "author": "Sidney Sheldon",
    "publication_date": "1988",
    "genres": [
        "Fiction"
    ],
    "text": " The story begins in Pamplona, Spain in 1976. The Basque people are fighting against Spain for their rights to free speech and cultural independence. While people are distracted with bulls let loose in the town during a fight, the famous Jaime Miró (a member of the Basque terrorist group ETA) sneaks into the Pamplona prison disguised as a priest and escapes with two of his fellow terrorists, Ricardo Mellado and Felix Carpio. The Prime Minister assigns Colonel Ramón Acoca (head of the anti-ETA group GOE) to find and kill Jaime Miró. Acoca has his own reasons for killing the terrorists; he vowed revenge after his wife and unborn child were killed in a Basque demonstration years before. The Cistercian Convent of the Strict Observance had been running just outside of a town called Ávila since 1601, one of seven left in Spain after the Civil War had destroyed hundreds of them. The nuns know nothing of the outside world; in their discipline they eat little, pray at least eight times a day, flagellate (whip) themselves at least once a week, and carry out their assigned tasks. Their only valuable asset is a donated solid gold cross, hidden away so that the nuns only know poverty. The nuns have no eye contact nor speech, only using an ancient, secret sign language to communicate with each other. The convent is run by the Reverend Mother Betina. A new nun, Sister Lucia, is only at the convent to hide from the police. As Lucia Carmine the daughter of a Mafia boss in Italy, lost everything when her father’s business crumbled. However, she managed to take revenge to the two of his father's betrayers - the bribed judge and Carmine's personal bodyguard - through assasination. She was put in the wanted-list of the police since then, as the main suspect whose motives were too obvious to the public. Lucia attempts to flee the country, deciding to go to Switzerland, where a hidden bank account contains millions of dollars promised to her by her father. However, while going through Spain, she decides to hide out at the convent so the police won’t find her. Meanwhile, Colonel Accoa believing the nuns are hiding Jaime Miró, has his men raid the convent, arresting and raping the nuns. Before she is arrested, the Reverend Mother Betina gives the gold cross to Sister Teresa, who is one of four nuns (including Sisters Lucia, Megan, and Graciela). Lucia leads the nuns through the countryside to a safe convent, planning to steal the gold cross, pawn it, and get money and a fake passport to go to Switzerland and get her money. Colonel Acoca is furious; he has figured out that four of the nuns are missing and is convinced that Jaime Miró escaped before the soldiers got there. The Prime Minister doubts that he was there in the first place and believes that Acoca is starting to get out of control, but continues to have the Colonel search for both Miró and the missing nuns, in order to avoid public's suspicion and critics about the brutality and raid to the convent done by his men for no obvious reason. The four nuns meet up with a man who calls himself Friar Carrillo, who brings them to a store so they can change. He takes Graciela, who is the most beautiful one, away from the other nuns for a minute and begins to rape her, but the other nuns intervene, tying up Carrillo, who was a wanted murderer posing as a Friar to steal from the monasteries in his travels. The nuns leave Carrillo in the store and continue traveling. In the forest they run into Jaime Miró hiding with his men, Ricardo and Felix from the prison, Jaime’s girlfriend Amparo, and Rubio Arzano, another man, and decide to travel on together. The owner of the store turns Carrillo over to the Colonel, who has connected him to the nuns because of the robes left in the store. Acoca beats Carrillo until he tells him about the nuns. However, angry that Acoca hurt him, he does not tell them where they are going. Sister Teresa, the oldest among others in her early-sixties, is convinced that the terrorists are bad men trying to kidnap her. She starts to have flashbacks of her past life with Monique, her only-sister who betrayed her and ran away with Raoul - her fiancee and would-be husband at the time of her supposed-to-be wedding party. She begins to think that she sees Monique’s baby (from Raoul) in the present - even though the child would be over 30 by now. In this way the reader begins to understand Teresa is heading for a nervous breakdown. At this time, in another part of the world Ellen Scott, CEO of a major New York company called Scott Industries is also having flashbacks. She started out as a worker in one of the company’s factories, and attracted the attention of Milo Scott, the younger brother of the CEO of the company when she saved him from a factory accident. They married, but Ellen noticed that Byron, her brother-in-law, pushed Milo around, giving him all the dirty jobs. Her only hope was that one day, Byron would die and leave the company to Milo, leaving him free to run the company as he wished. However, Byron and his wife Susan have a baby girl name Patricia, their heir. Ellen assumed the child would inherit the company. While on a business trip to Spain, the private jet that Ellen, Milo, Byron, Susan, and Patricia were traveling in crashes, killing everyone accept Milo, Ellen, and the baby. Taking control, Ellen forces Milo to abandon the baby at a farm so that the baby will be presumed dead and the company will go to Milo. When they read Byron’s will later, they discover that although his fortune was left to Patricia, the company was left to Milo. Milo feels guilty, but Ellen convinces him that they did the right thing. Milo dies a year later, and Ellen becomes the new CEO of Scott Industries. Now in present day (1976, 28 years later), Ellen is dying of cancer and needs to leave the company to someone. She hires her chief of security, former detective Alan Tucker to search for a baby abandoned in Ávila, Spain 28 years before - also to redeem herself from the sin she had done before she dies. Back in Spain, Colonel Acoca informs his colleagues that the nuns are with Jaime Miró. When they inquire how he found this information, he replies that one of Miró’s terrorists is an informant. Sister Teresa is slowly going insane, believing that the terrorists were hired by Raoul to kidnap her and take her back to Èze, France, where she grew up. While everyone is sleeping, she leave the golden cross bellow the sleeping bag of the Lucia, wanders around the area until she finds Colonel Acoca’s men and informs them that they are hiding in the nearby hills. Lucia takes this chance to secure the cross, which she keeps with her. Meanwhile, Alan Tucker is in Ávila speaking to a priest who assisted the farmer couple who discovered baby Patricia after Milo and Ellen abandoned her. He finds out that the baby was immediately hospitalized for pneumonia, and then taken to a nearby orphanage because the farmers couldn't afford to raise a child. However, they name the little girl Megan before leaving her at the orphanage. Tucker finds out that she became a nun, and that she was currently on the run from Colonel Acoca’s men. Alan starts to make connections, and realizes that this is baby Patricia, a fact that Ellen purposely left out when she gave him the assignment. Excited, Alan decides to blackmail Ellen with the information he has just found. Colonel Acoca’s men raid Jaime Miró’s camp with the nuns, and they split up to avoid capture - Ricardo Mellado with Sister Graciela, Rubio Arzano with Sister Lucia, and Jaime Miró, Felix Carpio, and Amparo with Sister Megan. But Colonel Acoca captures Sister Teresa. He interrogates her for information she doesn’t have, and when he gets nothing, his men take turns raping her until she speaks. However, she pulls out a pistol and shoots at them, so they are forced to shoot her, killing her. Lucia is starting to fall in love with Rubio, who thinks she’s been in the convent for ten years. He tries to explain the current state of the world, which Lucia already knows. At the same time, Jaime is reflecting upon his life as a terrorist. His father was one of the few Basque men who would not join the ETA because it was violent. When the Spanish invaded their town, they took refuge at a church because Jaime’s father said it would be safe. All of the Miró family is killed except Jaime, who vows revenge. This also explains his initial reluctance at having the nuns accompany his terrorists, because he did not trust the church. His girlfriend Amparo is just as dedicated as he is. Jaime and Megan start to bond, much to Amparo’s chagrin. As the group stops at a hotel for the night, the room clerk calls the police and tells them that Jaime Miró is staying at his hotel. The police storm the hotel and find that Miró and the rest of the group are already gone. The Prime Minister expresses his disappointment in Colonel Acoca because he had not found Miró yet. Rubio asks Lucia to say a prayer. Lucia panics, but shares the 23rd psalm (\"The Lord is my shepherd; I shall not want…\"). For the first time in her life, Lucia understands the prayer and what it means to her. While taking a bath in a stream, Lucia almost drowns, and Rubio saves her. Overcome with love, she convinces Rubio to sleep with her. Rubio wishes to marry her, and Lucia finds herself wishing she could, if she didn’t have to leave him and go to Switzerland with the money from the cross, which she is still carrying. When they finally come to a small town, Lucia goes to a pawn shop and haggles for money and a passport. She tells the clerk that she will keep the cross with her until later when the passport is finished, but feels upset at the thought of leaving Rubio. They have dinner together, but Rubio is stabbed when he defends a snide comment someone makes about Lucia. They run to a church, where Lucia tries her best to take care of him, but is forced to go to a hospital to take care of him. They are both arrested, because the authorities recognize Rubio as a terrorist and Lucia as the mafia murderer from Italy. Sister Graciela and Ricardo Mellado had been traveling together for just as the others, but Graciela would not talk to Ricardo despite his best efforts. Although he is exasperated with her cold shoulder, he is reluctantly starting to fall for her. It isn’t until she is almost attacked by a wild wolf in a cave that she begins to speak to him. She doesn’t want to love him because of her memories with the Moor, but falls for him anyway, agreeing to marry him. Alan Tucker goes to the orphanage to find more information about Megan/Patricia, but the owner gives him false dates because Ellen Scott paid her to confuse Alan. Ellen feared that Alan knew too much, and she already had the information she needed from him. Alan’s only job now is to find Megan and bring her to Ellen. Megan is still bonding with Jaime, and Amparo is growing angry. They hide out at a bullfight, where Megan impresses Jaime with her knowledge of the subject. They discover that Rubio and Lucia were arrested, and Megan is shocked to find out that Lucia was lying because she genuinely liked her. She is also saddened to hear about Sister Teresa’s death. Jaime and Megan speak to each other some more, and Megan grows sympathetic to his ideals even though she believes that violence is wrong. Jaime holds up a bank to get money to continue traveling, and Acoca soon confronts the bank teller. Security is tightened all over, but Megan proves her usefulness when she puts on a show for the soldiers by convincing them that she has been exposed to typhoid from her sons and gets the group through, gaining Jaime’s admiration. Jaime asks her if she still wants to go back to the convent, and Megan states that she isn’t sure. Jaime is convinced that someone is telling Acoca his secrets, and suspects Felix. Amparo tells Jaime that she answered a call from one of Jaime’s friends, and that Jaime should meet him in the town square for information. However, when Jaime goes, Megan overhears Amparo speaking to Colonel Acoca on the phone, exposing Amparo as the traitor. Megan, realizing that it was a trap, runs to the square and fakes an argument with a heavily disguised Jaime, so the soldiers won’t know that Jaime was there. Jaime is exceedingly grateful to Megan for saving him, and confronts Amparo. Amparo tells him that she is sick of the bloodshed, and Jaime agrees to keep her with them, but she is only treated like a traitor. Colonel Acoca discovers that Jaime escaped the trap, and Alan Tucker reads about it in the newspaper. Acoca decides to meet the group (now reunited with Ricardo and Graciela at a Circus) at the convent, where he assumes they are going. Jaime updates Ricardo and Graciela on Lucia, Rubio, and Teresa’s whereabouts. Jaime realizes that Acoca is waiting for them at the convent, so they don’t get caught. The group goes to the countryside again and waits with Basque friends. Jaime takes Amparo out for a drink, and puts powder in it, convincing Amparo that he is going to kill her (it’s really only crushed up sleeping pills). He takes her back to the house and sends her up to her room to \"die.\" Jaime asks Megan to wait in France with an aunt of his until he is done fighting so they can marry. She doesn’t say no, but thinks about it. She and Graciela debate about leaving the convent, wondering if they will miss it. The next morning, the group tries to leave the small Basque town only to be caught by Colonel Acoca, who was tipped off by Amparo, whose sleeping pills wore off quicker than Jaime had thought. Jaime threatens Acoca with a fight from the townspeople, forcing him to reluctantly retreat. Colonel Acoca has failed, and he knows that he will be killed. He tells Megan that they can run away together right away, but is interrupted by Alan Tucker, who has finally found Megan. He tells her that he is going to bring her to Ellen Scott. Megan is thrilled that she finally knows where she came from, but knows that she must leave Jaime for a while. She promises that she will be back soon. Ricardo and Graciela are about to be married, but Graciela stops during the ceremony and decides that she would miss her life at the convent too much. Jaime’s men get Rubio and Lucia out of prison by convincing the local authorities that they are to take them to Colonel Acoca to be interrogated. The sergeant makes a mock call to \"the Colonel\", who \"tells\" him that the men are right. Jaime’s men have interfered with the telephone wires, so he believes it is Acoca. Rubio and Lucia are reunited, and Lucia gets to Switzerland to collect her money, 13 million dollars. Megan is adopted by Ellen (so nothing has to be explained), and takes over Scott Industries when she dies. Three years go by, and Jaime has been caught and sentenced to death. Megan tries to save him by getting good lawyers, and even seeing the Prime Minister, but nothing happens. The execution appears to have been carried out perfectly. Megan has Jaime’s body bag delivered to her. She unzips it, and Jaime comes out of the bag, perfectly fine. Megan paid off the men who were supposed to carry out the execution (she gives them enough money to leave the country, and apparently enough that the one man can open up a hospital). She asks Jaime what kind of wine he would like with their dinner. Colonel Acoca is called to a meeting, but he knows that they are going to kill him and that there is no meeting. Lucia and Rubio are married with twins, a boy and a girl. They live in the French countryside where Rubio is a farmer. With the gold cross, Sister Graciela returns to the convent where life goes on as it did before. Character *Jaime Miró, a famous terrorist and member of the Basque terrorist group ETA. *Colonel Ramón Acoca is head of the anti-ETA group GOE, sent to capture Miró. *Reverend Mother Betina, head of the ancient Cistercian convent. *Sister Teresa, elderly, disappointed in love and leader of the four escaping nuns. *Sister Lucia, formerly Lucia Carmine, the wealthy daughter of an Italian Mafia boss, now impoverished. Lucia is on the run for murder. *Sister Megan, an orphan who joined the convent. *Sister Graciela, left home to become a nun. *Ricardo Mellado and Felix Carpio, escaped terrorists. *Byron and Susan Scott, owners of the New York company who have a child, Patricia. Byron is Milo's brother. *Ellen and Milo Scott, executives of Byron's company. *Alan Tucker, a former detective and Ellen's Chief of Security sent to search for the lost child, Patricia. The nuns The nuns hide their memories and pasts from each other but in their new circumstances start to introduce themselves. Sister Teresa is around 60, having been at the convent for 30 years. Growing up, she was always overshadowed by her stunningly beautiful younger sister Monique. However the rather plain Teresa had a lovely voice, and sang on the radio. A famous theatre director came to see her, but Monique got to him first, and he decided that compared to her sister, Teresa was too ugly to be in his show. This started a rivalry between the two sisters. Teresa fell in love with a young man named Raoul, but he eloped with her sister shortly before the wedding. Heartbroken, Teresa attempted suicide then suffered depression throughout her life. When Raoul sent her a letter stating that Monique left him with their baby and that it was Teresa he wanted all along, she decided to go into the convent because she could not face him. Sister Lucia as Lucia Carmine, daughter of an Italian Mafia boss, lost everything when her father’s business crumbled. Unknown to him, Lucia slept with the chief bodyguard and many other men in their town as a teenager(Paolo). Years later, the bodyguard, Benito, worked with the police to turn in Lucia’s father and brothers, who worked in the family \"business\". In revenge, Lucia pretends to thank the judge (formerly a family friend) for putting away her father, but poisons him. Then, in prison she seduces Benito, right before stabbing him. Now exposed as a murderer, Lucia attempts to flee the country, deciding to go to Switzerland, where a hidden bank account contains her father's hidden fortune. However, on her way through Spain, she decides to hide out at the convent to hide out from the police. Beautiful and exotic, Sister Graciela is the daughter of a woman whose fiancé left when he found out she was pregnant. Graciela’s mother, also gorgeous, became a whore, resenting her daughter and sleeping with many different men. When Graciela was 14, she was attracted to her mother’s current boyfriend, who was a “Moor.” They were caught having sex by Graciela’s mother, who threw an iron ashtray at Graciela’s head, injuring her. Convinced that she could not go back home, Graciela chose to join the convent. Sister Megan is a tomboy who was abandoned at a farm as a baby, but then brought to an orphanage because the farmers had no money to take care of her. She developed a love of reading and learned several languages there, daydreaming about who her parents could be. When she reached the age of 15, she decided to join the convent because she loved going to church. She was known as Patricia before the airplane that they are riding crash. Her parents died, but Milo and Ellen together with Patricia, luckily survived. At the moment, Ellen see an opportunity in owning the Scott Industries so they left Patricia at the front door of a farmer in Avila. Later they found out that in the Will of milo's brother, Bryan, (owner or scott industry, father of Patricia)leaving the whole company to his brother and only part of the income goes to Patricia."
}