{
    "book_id": "10863031",
    "mid": "/m/02qsc7w",
    "title": "The Princess Diaries, Volume X: Forever Princess",
    "author": "Meg Cabot",
    "publication_date": "2008-12",
    "genres": [
        "Young adult literature"
    ],
    "text": " Mia leaves us with an unhappy ending in the ninth book and we join her again in the tenth, which is set two years later, in her last few weeks of school before graduation. In this final book of the series, we see that while still a teenager, Mia has shown major improvements in her progression to becoming an adult. She has been dating J.P, keeping in touch with Michael, and building up a friendship with Lana, but she has not yet made up with Lilly. Mia is getting ready for her eighteenth birthday in a week, not to mention PROM and graduation, and still all she does is lie. She has been accepted in every college she applied to, but she fears it's because of her royal condition, and she told everyone she hadn't. She wrote a romance novel, under an alias, and told everyone it was a paper on Genovian olive oil, and is trying to get it published, with no success. She doesn't feel like going to her prom at all, and Michael is back in town after his CardioArm became a huge hit success and he has become a rich young man. All of a sudden, everything she was (sort of) sure of goes down the drain. She isn't so sure about her relationship with J.P, whose motives are unclear. She also has to deal with turning eighteen and the extravagant party that Grandmere is throwing for her, and helping her father win an election against her cousin, René. It all sounds very complicated - not forgetting Mia wants to lose her virginity before graduation. In the end she goes to prom with J.P, planning to have sex afterwards. After she learns from Lilly that J.P didn't really love anything about her, apart from her fame, Mia breaks up with him and she and Lilly become friends again. She also learns that JP lied to her saying he was a virgin while he and Lilly did have sex. Then, Michael appears and takes her back, telling Mia about his undying love for her. She then loses her virginity to Michael near the end of the book. Mia also decides to go to Sarah Lawrence and plans to never again leave Michael."
}