{
    "book_id": "724284",
    "mid": "/m/035w31",
    "title": "The Betrothed",
    "author": "Alessandro Manzoni",
    "publication_date": "1827",
    "genres": [
        "Historical novel"
    ],
    "text": " Renzo and Lucia, a couple in an unnamed Lombard village near Lake Como, are planning to wed on 8 November 1628. The parish priest, Don Abbondio, is walking home on the eve of the wedding when he is accosted by two \"bravoes\" (thugs) who warn him not to perform the marriage, because the local baron (Don Rodrigo) has forbidden it. When he presents himself for the wedding ceremony, Renzo is amazed to hear that the marriage is to be postponed (the priest didn't have the courage to tell the truth). An argument ensues and Renzo succeeds in extracting from the priest the name of Don Rodrigo. It turns out that Don Rodrigo has his eye on Lucia. Lucia's mother, Agnese, advises Renzo to ask the advice of \"Dr. Azzeccagarbugli\" (Dr Quibbleweaver, in Colquhoun's translation), a lawyer in the town of Lecco. Dr Azzeccagarbugli is at first sympathetic, showing Renzo a recent edict on the subject of priests who refuse to marry, but when he hears the name of Don Rodrigo he panics and drives Renzo away. Lucia sends a message to \"Fra Cristoforo\" (Friar Christopher), a respected Capuchin friar at the monastery of Pescarenico, asking him to come as soon as he can. When Fra Cristoforo comes to Lucia's cottage and hears the story, he immediately goes to Don Rodrigo's mansion, where he finds the baron at a meal with his cousin Count Attilio, along with four guests, including the mayor and Dr Azzeccagarbugli. When Don Rodrigo is taken aside by the friar, he explodes with anger at his presumption and sends him away, but not before an old servant has a chance to offer him help. Meanwhile, Agnese comes up with a plan. In those days, it was possible for two people to marry by declaring themselves married before a priest and in the presence of two amenable witnesses. Renzo runs to his friend Tonio and offers him 25 lire if he agrees to help. When Fra Cristoforo returns with the bad news, they decide to put their plan into action. The next morning, Lucia and Agnese are visited by beggars, Don Rodrigo's men in disguise. They examine the house in order to plan an assault. Late at night, Agnese distracts Don Abbondio's servant Perpetua while Tonio and his brother Gervaso enter Don Abbondio's study, ostensibly to pay a debt. They are followed indoors secretly by Lucia and Renzo. When they try to carry out their plan, the priest throws the tablecloth in Lucia's face and drops the lamp. They struggle in the darkness. In the meantime, Don Rodrigo's men invade Lucia's house, but nobody is there. A boy named Menico arrives with a message of warning from Fra Cristoforo and they seize him. When they hear the alarm being raised by the sacristan, who is calling for help on the part of Don Abbondio who raised the alarm of invaders in his home, they assume they have been betrayed and flee in confusion. Menico sees Agnese, Lucia and Renzo in the street and warns them not to return home. They go to the monastery, where Fra Cristoforo gives Renzo a letter of introduction to a certain friar at Milan, and another letter to the two women, to organise a refuge at a convent in the nearby city of Monza. Lucia is entrusted to the nun Gertrude, a strange and unpredictable noblewoman whose story is told in these chapters. A child of the most important family of the area, her father decided to send her to the cloisters for no other reason than to simplify his affairs: he wished to keep his properties united for his first-born, heir to the family's title and riches. As she grew up, she sensed that she was being forced by her parents into a life which would comport but little with her personality. However, fear of scandal, as well as manoeuvres and menaces from her father, induced Gertrude to lie to her interviewers in order to enter the convent of Monza, where she was received as la Signora (\"the lady\"). Later, she fell under the spell of a young man of no scruples, associated with the worst baron of that time, the Innominato (the Unnamed). Renzo arrives in famine-stricken Milan and goes to the monastery, but the friar he is seeking is absent and so he wanders further into the city. A bakery in the Corsia de' Servi, El prestin di scansc (\"Bakery of the Crutches\"), is destroyed by a mob, who then go to the house of the Commissioner of Supply in order to lynch him. He is saved in the nick of time by Ferrer, the Grand Chancellor, who arrives in a coach and announces he is taking the Commissioner to prison. Renzo becomes prominent as he helps Ferrer make his way through the crowd. After witnessing these scenes, Renzo joins in a lively discussion and reveals views which attract the notice of a police agent in search of a scapegoat. The agent tries to lead Renzo directly to \"the best inn\" (i.e. prison) but Renzo is tired and stops at one nearby where, after being plied with drink, he reveals his full name and address. The next morning, he is awakened by a notary and two bailiffs, who handcuff him and start to take him away. In the street Renzo announces loudly that he is being punished for his heroism the day before and, with the aid of sympathetic onlookers, he effects his escape. Leaving the city by the same gate through which he entered, he sets off for Bergamo, knowing that his cousin Bortolo lives in a village nearby. Once there, he will be beyond the reach of the authorities of Milan (under Spanish domination), as Bergamo is territory of the Most Serene Republic of Venice. At an inn in Gorgonzola, he overhears a conversation which makes it clear to him how much trouble he is in and so he walks all night until he reaches the River Adda. After a short sleep in a hut, he crosses the river at dawn in the boat of a fisherman and makes his way to his cousin's house, where he is welcomed as a silk-weaver under the pseudonym of Antonio Rivolta. The same day, orders for Renzo's arrest reach the town of Lecco, to the delight of Don Rodrigo. News of Renzo's disgrace comes to the convent, but later Lucia is informed that Renzo is safe with his cousin. Their reassurance is short-lived: when they receive no word from Fra Cristoforo for a long time, Agnese travels to Pescarenico, where she learns that he has been ordered by a superior to the town of Rimini. In fact, this has been engineered by Don Rodrigo and Count Attilio, who have leaned on a mutual uncle of the Secret Council, who has leaned on the Father Provincial. Meanwhile, Don Rodrigo has organised a plot to kidnap Lucia from the convent. This involves a great robber baron whose name has not been recorded, and who hence is called l'Innominato, the Unnamed. Gertrude, blackmailed by Egidio, a male neighbour (and acquaintance of l'Innominato) whose attentions she has returned, persuades Lucia to run an errand which will take her outside the convent for a short while. In the street Lucia is seized and bundled into a coach. After a nightmarish journey, Lucia arrives at the castle of the Unnamed, where she is locked in a chamber. The Unnamed is troubled by the sight of her, and spends a horrible night in which memories of his past and the uncertainty of his future almost drive him to suicide. Meanwhile, Lucia spends a similarly restless night, during which she vows to take the veil if she is delivered from her predicament. Towards the morning, on looking out of his window, the Unnamed sees throngs of people walking past. They are going to listen to the famous Archbishop of Milan, Cardinal Federigo Borromeo. On impulse, the Unnamed leaves his castle in order to meet this man. This meeting prompts a \"miraculous\" conversion which marks the turning-point of the novel. The Unnamed announces to his men that his reign of terror is over. He decides to take Lucia back to her native land under his own protection, and with the help of the archbishop the deed is done. The astonishing course of events leads to an atmosphere in which Don Rodrigo can be defied openly and his fortunes take a turn for the worse. Don Abbondio is reprimanded by the archbishop. Lucia, miserable about her vow to renounce Renzo, still frets about him. He is now the subject of diplomatic conflict between Milan and Bergamo. Her life is not improved when a wealthy busybody, Donna Prassede, insists on taking her into her household and admonishing her for getting mixed up with a good-for-nothing like Renzo. The government of Milan is unable to keep bread prices down by decree and the city is swamped by beggars. The lazzaretto is filled with the hungry and sick. Meanwhile the Thirty Years War brings more calamities. In September 1629, German armies under Count Rambaldo di Collalto descend on Italy, looting and destroying. Agnese, Don Abbondio and Perpetua take refuge in the well-defended territory of the Unnamed. In their absence, their village is wrecked by the mercenaries. These chapters are occupied with an account of the plague of 1630, largely based on Giuseppe Ripamonti's De peste quae fuit anno 1630 (published in 1640). Manzoni's full version of this, Storia della Colonna Infame, was finished in 1829, but was not published until it was included as an appendix to the revised edition of 1842. The end of August 1630 sees the death in Milan of the original villains of the story. Renzo, troubled by Agnese's letters and recovering from plague, returns to his native village to find that many of the inhabitants are dead and that his house and vineyard have been destroyed. The warrant, and Don Rodrigo, are forgotten. Tonio tells him that Lucia is in Milan. On his arrival in Milan, Renzo is astonished at the state of the city. His highland clothes invite suspicion that he is an \"anointer\"; that is, a foreign agent deliberately spreading plague in some way. He learns that Lucia is now languishing at the lazzaretto, along with 16,000 other victims of the plague. But in fact, Lucia is already recuperating. Renzo and Lucia are reunited by Fra Cristoforo, but only after Renzo first visits and forgives the dying Don Rodrigo. The friar absolves her of her vow of celibacy. Renzo walks through a rainstorm to see Agnese at the village of Pasturo. When they all return to their native village, Lucia and Renzo are finally married by Don Abbondio and the couple make a fresh start at a silk-mill at the gates of Bergamo."
}