{
    "book_id": "6481658",
    "mid": "/m/0g6_bf",
    "title": "The Abolition of Britain: From Winston Churchill to Princess Diana",
    "author": "Peter Hitchens",
    "publication_date": "2000",
    "genres": [
        "Non-fiction"
    ],
    "text": " The Abolition of Britain is a conservative polemic against the changes in the United Kingdom since the mid-1960s. It contrasts the funerals of Winston Churchill (1965) and Diana, Princess of Wales (1997), using these two related but dissimilar events, three decades apart, to illustrate the enormous cultural changes that took place in the intervening period. His argument is that Britain underwent a \"cultural revolution\", comparable to that of China in the 1960s. He describes and criticises the growing strength of such forces as multiculturalism, which still had a liberal consensus behind it at the time the book was written. He argues that English schools had largely ceased to teach the history of the country, criticising the preference for methodology, or the literature of Britain's past. Other changes gain Hitchens' attention, from the passivity and conformism resulting from the watching of television to the Church of England's rejection of its traditional liturgy and scripture. Sex education, he argues, is a form of propaganda against Christian sexual morality. The sexual revolution brought about by the first contraceptive pills was the result not of accidental discovery, but of research deliberately pursued by moral revolutionaries. He describes the efforts made to provide respectability for unmarried motherhood, not least the campaign to replace the expression \"unmarried mother\" with \"single parent\", thus lumping together those who had children out of wedlock with widowers, widows or deserted wives and husbands, and so deflecting disapproval. Hitchens sees the British establishment as being morally weak in their failure to resist the emerging drug culture, when they could easily have done so in the mid-1960s. He cites as one example the prosecution of Mick Jagger and the subsequent intervention of The Times in Jagger's defence in 1967 (\"Who breaks a butterfly on a wheel?\") after his (temporary) conviction. One chapter analyses the use of TV and radio soap operas to spread liberal cultural and moral propaganda, and refers to several instances where this intention has been openly expressed by the editors and authors of such programmes. In another, he attacks the development of \"anti-establishment\" comedy since the staging of Beyond the Fringe at the Edinburgh Festival in 1960. For Hitchens, the development of television, citing with approval a critical letter by T. S. Eliot to The Times in 1950, was something which should have led to a greater public debate than it did. In particular, Hitchens criticises the easy capture of the Conservative Party by lobbyists for commercial TV, which removed the BBC's monopoly power to defend cultural standards. He argues that the introduction of colour television, which made even the bad programmes look good, greatly increased the influence of TV over the public mind. He identifies the then Labour politician Roy Jenkins as a highly-effective campaigner for \"cultural revolution\". He describes the Chatterley trial, describing what he calls \"myths\" about it, and argues that the defence of literary merit (from the 1959 Jenkins backed Obscene Publications Act) eventually came to be used to allow the publications of books and periodicals which had none at all. He examines Jenkins' use of cross-party alliances and, what he sees as, supposed Private Members' Bills to achieve his programme. These legislative changes had not been mentioned in the 1964 or 1966 election manifestoes, and Hitchens develops his argument by drawing on proposals Jenkins had made in a section (p135-140) of his 1959 book The Labour Case. He cites warnings made by those who opposed the abolition of capital punishment, and claims that those warnings have largely proved to be true. For Hitchens this is an example of the political elite working against the desires of the public. Hitchens' view is sustained, in the case of capital punishment, by the liberal historian Dominic Sandbrook, in his history of the period White Heat (2006 p321) using contemporaneous opinion poll data. He went on to explore this issue in more detail in A Brief History of Crime. A chapter in The Abolition of Britain on the contrast between the public health policies on lung cancer and the public health policies on AIDS was left out of the first edition of the book, after Hitchens was advised that airing thoughts critical of homosexual acts would bring such criticism on it that it would distract attention from the book's main message. It was reinstated in the paperback and American editions, with an explanatory preface. Hitchens elaborated that the morality of homosexuality itself was tangential to his main argument. He wrote that British society's unwillingness to criticize sexual promiscuity among gay, bisexual, and straight men alike despite the ill after-effects stands in direct hypocritical contrast to government action against drug use. Hitchens argues that damaging moral and cultural effects on Britain occurred from the presence of huge numbers of U.S. troops during World War II. He also laments the cultural impact of American usage of the English language in Britain itself. For Hitchens, the major failing of the Thatcher governments was the absence of a decidedly conservative stance over cultural and moral matters."
}