{
    "book_id": "10863015",
    "mid": "/m/02qsc75",
    "title": "The Princess Diaries, Volume IX: Princess Mia",
    "author": "Meg Cabot",
    "publication_date": "2008",
    "genres": [
        "Young adult literature"
    ],
    "text": " Mia Thermopolis is having a bad time. She's failing Chemistry and Pre-Calculus, Michael has moved to Japan thinking she hates him, Lilly isn't speaking to her, someone has set up a hate site about her at www.ihatemiathermopolis.com, and Grandmere expects her to give a speech to the Domina Rei, the world's most exclusive women's society. Even when she goes to the theatre with J.P. as friends, it ends up all over the gossip magazines. When Michael finally calls, he decides it is best that they stay \"just friends\". Unable to cope, Mia retreats to her room, begins binge-eating, and refuses to go to school for four days. Eventually, Mia's family steps in. Her father takes her to see a cowboy psychologist, Dr. Knutz, who convinces Mia to return to school and try to move on with her life. Mia realizes she has depression, and returns to school, where Lilly still refuses to have anything to do with her. However, friendship comes from an unexpected direction: Lana Weinberger, Mia's enemy, offers her the olive branch, explaining that the main reason she disliked Mia was because of Lilly. Soon, the two have become friends. Kenny (who begins dating Lilly) causes the chemistry lab to explode during a class but right before that, J.P. tells Mia that he loves her; Mia is glad, but she explains that she is not yet ready for a new relationship. Meanwhile, as Mia is preparing for her speech to the Domina Rei, she discovers an old ancestress; Princess Amelie, who ruled Genovia for twelve days while she was only sixteen, before dying of the bubonic plague. By reading Amelie's diary, Mia discovers something shocking; over four hundred years ago, the princess legally changed Genovia from an absolute monarchy to a constitutional monarchy, led by a Prime Minister. However, her father refuses to accept the document's legality, and when Mia asks Lilly for help, she publicly humiliates her and reveals that she is the one behind www.ihatemiathermopolis.com. This effectively ends the girls' friendship, with Mia turning back to Tina and Lana instead. Dr. Knutz helps Mia decide to reveal Princess Amelie's story to the Domina Rei in her speech; this brave act earns her an invitation to join, and an e-mail from Michael, on her way home she finds J.P. waiting for her and she kisses him and Mia finally replies to Michael's e-mail with a little happiness."
}