{
    "book_id": "2379539",
    "mid": "/m/077st3",
    "title": "The Return",
    "author": "Judith Reeves-Stevens",
    "publication_date": "",
    "genres": [
        "Science Fiction",
        "Speculative fiction",
        "Fiction"
    ],
    "text": " The novel begins on the planet Veridian III and takes place shortly after the events seen in the motion picture Star Trek Generations. The body of James T. Kirk is stolen by the Romulans after his burial by fellow Starfleet captain Jean-Luc Picard. The Borg have formed an alliance with the Romulan Star Empire in order to destroy the Federation. Using alien technology, the Borg bring Kirk back to life and his katra is restored, but false memories are implanted to turn him against the Federation. The goal of this secret alliance is to destroy Picard and therefore Starfleet's only defense against the Borg but, despite his conditioning, Kirk is able to resist commands to kill Worf, Data, and Geordi La Forge, all of whom are attacked by him during his search for Picard. Simultaneously, Picard and Dr. Beverly Crusher are participating in a strike team in a Federation expedition to an assimilated colony, where they are captured on board a Borg vessel. They are able to escape and, as they move freely around the vessel, they learn of the Borg/Romulan Alliance. Spock also learns of this alliance when he is captured dealing with Romulans, but the Borg do not assimilate him as, for some reason, they believe Spock is already Borg. Kirk is eventually captured on Deep Space Nine attempting to kill Commander William Riker, and the implant that was responsible for his false memories is removed by the joint efforts of Dr. Julian Bashir and Admiral Leonard McCoy; McCoy acts as an advisor during the surgery while Bashir's younger, fitter hands perform the operation. Although Kirk retains the drives implanted in him by the device, leading him to a confrontation with Picard in a holodeck re-creation of the original USS Enterprise, Spock is able to remove the commands thanks to a mind meld. In the process, they learn that V'ger, the former Voyager 6, was actually upgraded by a division of the Borg Collective, which explains why the Borg did not assimilate Spock; they assumed the trace of V'ger in his mind from their meld (in Star Trek: The Motion Picture) was an actual link to the Collective. This also gives Starfleet another advantage; thanks to the meld, Spock knows the location of the Borg homeworld. Taking a Defiant-class starship (renamed Enterprise for the mission), the Enterprise-D senior staff, accompanied by Kirk, Spock and McCoy, travel directly to the Borg homeworld thanks to a stolen transwarp drive. Once there, the Enterprise neutralizes the Borg/Romulan fleet around the planet with a wave, dampening the Borg's communication and making them unable to maintain their link to the Collective, effectively neutralizing them. Taking this as a distraction, Kirk and Picard beam down to the planet in search of the Borg central node. Using Picard's memories as Locutus, they track down the Borg central node which, when deactivated, will sever the Borg Collective; every Borg ship will be separate from every other ship, and what can defeat one will always work a second time. However, the result will cause a cataclysmic explosion that will kill whoever operates the node. Picard and Kirk debate on who will go, each attempting to be the hero and sacrifice themselves. Kirk appears to give in and let Picard pull the lever, but he takes the sudden calm to knock Picard out and beam his unconscious body back up to the Enterprise. Kirk then pulls the lever and triggers the explosion. However, even as the crew watches, Spock, who has always been able to sense Kirk ever since they first mind-melded, still does not believe that his friend is dead."
}