{
    "book_id": "1882707",
    "mid": "/m/063gsq",
    "title": "The Snow Queen",
    "author": "Joan D. Vinge",
    "publication_date": "1980",
    "genres": [
        "Science Fiction",
        "Speculative fiction",
        "Fantasy",
        "Fiction",
        "Novel"
    ],
    "text": " The residents of Tiamat are split into two clans: \"Winters\" who advocate technological progress and trade with offworlders, and \"Summers\" who depend on their folk traditions and rigid social distinctions to survive on this marginal planet. Every 150 years, the sun's orbit around a black hole dramatically impacts the planetary ecology and to keep the uneasy peace, the government switches from Winter rule to Summer rule under a matriarchal monarch. Interstellar travel between Tiamat and the Hegemony is only possible during the 150 years of Winter rule, and a single woman rules the entire planet: a \"Snow Queen\" in Winter, a \"Summer Queen\" in Summer. The Hegemony's interest in Tiamat has to do with the \"mers,\" sentient sea-dwelling creatures whose blood provides the \"water of life,\" a virus that restores physical youth. Mers are hunted as frequently as possible during the Winter years, to the brink of extinction. This also allows a single Snow Queen to reign for the entire 150-year season, and it is with the Snow Queen, Arienrhod, that the story begins. She has secretly implanted several Summer women with embryos, clones of herself, in the hopes of extending her rule past her ritual execution at the end of Winter. The novel follows Moon, the only one of these clones to survive to adolescence. She and her cousin Sparks are lovers, and both are \"merry-begots\", conceived during the planetary festivals held every 20 years to remind Tiamat of the cycle of power. Moon becomes a sibyl, a position of high status among the Summer people, since they are keepers of knowledge freely available to anyone who asks. Sibyls enter a trance and by mysterious means, can answer questions. Sparks, unable to join her among the sibyl mystics and curious about his offworld heritage, travels to Carbuncle, Tiamat's capital, where he is immediately caught up by Arienrhod and eventually becomes the \"Starbuck\": her consort and commander of the mer hunts. Moon receives a message, apparently from Sparks, urging her to come to Carbuncle, though the city is barred to sibyls. On her way, she becomes entangled with smugglers and is taken off-world – a one-way trip for a Tiamatan citizen, as the Hegemony forbids Tiamat full access to their worlds. She is taken to the capital planet, Kharemough, and discovers that the Winters' prejudice against sibyls is a political tool used by the Hegemony to preserve its control of technology on Tiamat. Sibyls are highly respected throughout the other planets of the Hegemony; only on Tiamat, due to a careful reinforcement of superstitions during the reign of Winter, are they considered dangerous and mentally unstable. Eventually, despite the waning window of safe travel offered by Tiamat's orbit, she negotiates a return after finding out from a trance that Sparks is in danger. After a crash landing and short sojourn as a captive by an outback tribe of Winter fugitives in the north, Moon returns to Carbuncle and confronts Arienrhod for the fate of her beloved Sparks. Here she discovers the truth of her heritage and that Arienrhod considers her a failure; she wanted a clone in spirit, not just in body, a clone who would keep the Summers from rejecting technology – throwing all imported devices into the sea – at The Change. Moon proves her wrong by participating in the ritual competition for the Summer Throne, and winning. The Change will proceed, and Winter will end&mdash;but with an enlightened queen, preparing Tiamat to face the Hegemony as a peer when the 150 years of summer end and interstellar travel is again possible through the black hole."
}