{
    "book_id": "3066557",
    "mid": "/m/08p5nn",
    "title": "The Outsider",
    "author": "Richard Wright",
    "publication_date": "1953",
    "genres": [
        "Novel"
    ],
    "text": " This novel presents ideas which examine life in the light of modern philosophies. The novel's central character, symbolically named Cross Damon, represents the 20th century man in frenzied pursuit of freedom. Cross is an intellectual Negro, the product of a culture which rejects him. He is further alienated by his \"habit of incessant reflection\", his feeling that the experiences and actions of his life have so far taken place without his free assent, and a profound conviction that there must be more to life, some meaning and justification which have hitherto eluded him. When Cross is introduced (in \"Book One: Dread\") he is drinking too much, partly in an effort to forget his problems (of which he has many) but mostly to deaden the pain caused by his urgent and frustrated sense of life. There is an accident in which he is reported dead and so he sets out to create his own identity, and thus, he hopes, to discover truth. This search for the absolute compels him to commit four murders and ends in his despair and violent death. En route, he encounters totalitarianism in its most-likely-to-succeed form, Communism. Though he agrees with these other \"outsiders\" that power is the central reality of society and that \"man is nothing in particular\", he is outraged by their acceptance and cynical exploitation of these \"facts\". \"That’s enough\", he screams before he kills a Communist who has just told him that there is no more to life. You say life is just life, a simple act of accidental possession in the hands of him who happens to have it. But what's suffering? That rests in the senses... You might argue that you could snatch a life, blot out a consciousness and get away with it because you're strong and free enough to do it; but why turn a consciousness into a flame of suffering and let it lie, squirming...? Having rejected religion, the past and present organization of society, the proposed totalitarian alternative and the kindred uncontrollable violence of his own behavior as a &#34;free&#34; man, Cross abandons ideas and pins his last hope on love. But his mistress commits suicide when she sees him as he is. There follows a chapter in which the Law, personified by a hunchbacked district attorney who understands Cross Damon, convicts him of a crime and condemns him, but is powerless to give his life significance by punishment. After this Cross is murdered. The district attorney comes to his death bed and asks how was life and Cross dies murmuring, &#34;It was horrible.&#34;"
}