{
    "book_id": "1703697",
    "mid": "/m/05pr53",
    "title": "The Testament",
    "author": "John Grisham",
    "publication_date": "1999-02-02",
    "genres": [
        "Thriller",
        "Fiction",
        "Suspense"
    ],
    "text": " Troy Phelan, an eccentric elderly billionaire, commits suicide minutes after leaving his vast fortune to an illegitimate daughter, Rachel Lane, instead of his six children by three marriages. His reason is revulsion over years of fighting with, and embarrassment from, his family, as well as their greed &mdash; much of which was due to his neglect of his children and multiple affairs (both personal and business). His lawyers are now tasked with protecting Troy's wishes as well as finding the heiress. Nate O'Riley, a high-powered litigation lawyer and now recovering alcoholic, is sent to Brazil, where Rachel is believed to be living as a missionary. While Nate is trying to find Rachel, Troy's family does everything in their power to contest the new will. They argue that although Troy was examined by three of the top psychiatrists in the nation, he was lacking sanity at the time of the new will. The journey into the Pantanal of South America by way of Corumbá nearly kills Nate, but finally he and his guide locate the tribe with which Rachel Lane is living. She refuses the legacy or anything connected with it. Nate is unable to convince her otherwise, and returns to the United States after contracting dengue fever from a mosquito. In the meantime, the ex-wives, children and respective lawyers continue attempting to destroy and disprove all evidence of Troy Phelan's sanity and even the will itself. They finally decide not to contest the will in court, fearing that their testimony during the deposition will further hurt their case. They also realize that two witnesses for the plaintiff are lying and would be torn to shreds by Nate should a trial ever take place. To settle the matter, Nate agrees that the relatives of Troy Phelan will be paid fifty million dollars each (minus lawyers' fees) to stop turning the will contest into a legal quagmire. When all is over, Nate returns to the jungle in order to get Rachel to sign off on the settlement, but when he arrives he learns that Rachel has died from malaria. She has, however, left instructions that the money be put into trust for the benefit of the indigenous peoples and that Nate will have control of the trust. The end of the book shows Nate riding off in a boat into the Pantanal, not caring if it took a month to get back to civilization."
}