{
    "book_id": "15311113",
    "mid": "/m/09mv9c",
    "title": "The Magicians",
    "author": "John Boynton Priestley",
    "publication_date": "1954",
    "genres": [
        "Speculative fiction"
    ],
    "text": " The main character, Sir Charles Ravenstreet, is an industrialist in his mid-fifties, the Managing Director of the Birmingham-based New Central Electric Company. At a meeting of the Board in London, he finds himself unexpectedly voted out of his position. He turns down an offer to be named Production Manager instead, and later rebuffs the Chairman's suggestion that he enter politics. Later that evening, at a dinner party at Mr Garson's house, he is introduced to Mavis Westfret, a youngish widow. He sells his stock for £200,000 and begins to frequent fashionable restaurants and clubs, but they bore him, and he starts going out with Mavis. After a sexual encounter, she bursts into a sobbing confession of her dissatisfaction with her life, both past and present. The next evening he goes, on the suggestion of an acquaintance named Karney and his friend Prisk, to meet the newspaper tycoon Lord Mervil, who has a new business proposition for him. The proposition concerns a new drug called Sepman Eighteen, which produces a mild euphoria. Initially suspicious, Ravenstreet tries a sample back at his club bedroom, and it makes him so cheerful that he telephones at once to ask for another meeting. The week after, Ravenstreet is driving to his country house, Broxley Manor, when he sees the crash of a jet fighter a few miles ahead. An inn called The White Horse has been destroyed; the only survivors are a barman named Perkins, and three elderly male guests: Wayland, Perperek and Marot. The three men strike him as harmless cranks, and Ravenstreet suggests that they stay with him at his house. On their arrival, Perperek goes straight to the kitchen, waves away Ravenstreet's housekeepers, and starts making goulash for dinner. While he prepares it he perplexes his host by claiming that he and his friends knew in advance that the jet would crash, but that no-one would listen to them. At dinner the three men assert that they are magicians, and although Ravenstreet will not discuss his recent meeting with the tycoon, he is sufficiently intrigued by their manner that he allows Marot to \"show him his past.\" He finds himself reliving, in full, an afternoon from September 1926, when he was on holiday with his girlfriend at a cottage on Pelrock Bay. The day is a turning-point in his life, as it is the day on which he received a letter calling him back to work early, finally prompting him to break with Philippa in order to marry the boss's daughter Maureen. Philippa realises what is happening, but Ravenstreet is resolutely dishonest, and his future self finds the experience a torment, particularly as the decision turned out to be a poor one. Ravenstreet approaches the trio the next morning, and, still somewhat sceptical, asks for more information. They are reluctant to talk in detail, but say that superhuman forces are battling for control of humanity's destiny, and they succeed in persuading Ravenstreet to reveal that his dealings with Lord Mervil concern a new drug. Prisk telephones, wanting him to meet Ernest Sepman, the inventor, at his home. The magicians ask Ravenstreet to hold the next meeting at Broxley Manor so that they can inspect Lord Mervil and his associates. Ravenstreet drives to Cheshire and finds Sepman to be a bitter, cynical and greedy man who idolises his serially unfaithful wife Nancy, even while she boldly flirts with Prisk. Ravenstreet manages with difficulty to arrange a meeting at Broxley Manor. At first, Karney and Lord Mervil are furious at finding other guests in the house, but soon accept the magicians as harmless cranks, and during dinner they find themselves speaking with unusual frankness about their views. Lord Mervil asserts the necessity of a hidden elite in every society and Sepman loudly denounces him, in an outburst which causes his wife to run from the room with Prisk in tow. After dinner, the situation spirals out of Ravenstreet's control. Perperek announces that he has seen Karney somewhere before -- in 1921, in a police station in Constantinople, charged with smuggling. The revelation causes the ultra-respectable Karney to flee in irrational panic. Lord Mervil demands to know who the three strangers really are; Wayland humiliates him and somehow prompts a decompensation which ends in his fainting. When Prisk returns with Nancy, Sepman rounds on her and forces her to admit her unfaithfulness, and they both leave at once in Sepman's car. Ravenstreet pursues in his Rolls, accompanied by Perperek, but he is too late: the Sepmans are dead, having driven at high speed into a quarry. The entire night is spent talking to police. When they return, Wayland gives the exhausted Ravenstreet another vision, of the happiest morning of his life, in the summer of 1910. When he wakes up, he finds that Lord Mervil and his associates have left, and that he has been called to the Birmingham factory to help with a technical difficulty. He talks to the foreman, Tom Hurdlow, and surprises him by agreeing to finance his son's new business. When he returns home he finds that he and Perperek have been ordered to an inquest on the Sepmans' deaths. The inquest, presided over by a self-important coroner named T. Brigden Coss, descends into farce when Perperek is called as a witness. Perperek is charged with contempt of court, and taken to the police station. When the inquest is over, Ravenstreet hurries to the station with Inspector Triffett, where they find all the policemen aphasic and Perperek missing. All three magicians have left Broxley Manor, leaving only a cryptic note from Wayland. Not long afterwards, Ravenstreet is called to Purchester Cottage Hospital on the request of a Mrs Slade, who turns out to be the betrayed Philippa, now on the point of death. Wayland's letter gains meaning when Philippa informs him that one of her sons is also his, and that the two children he saw in the waiting room are his grandchildren."
}