{
    "book_id": "3136677",
    "mid": "/m/08tsy2",
    "title": "The Rising",
    "author": "Tim LaHaye",
    "publication_date": "2005-03-31",
    "genres": [
        "Speculative fiction",
        "Fiction",
        "Novel"
    ],
    "text": " The Rising deals with Rayford Steele's childhood and college days, and how he nearly married another woman. A conflict between father and son as Rayford decides to become an airline pilot against his father's wishes. Also featured is the birth of Nicolae Carpathia, who would later rise up in Nicolae as the Antichrist. Marilena is a simple Romanian woman who is overcome by the need to have a baby. Her husband, Sorin, does not love his wife anymore and is revealed to be a homosexual. Thus, Marilena reads an ad for a group to find something \"Beyond themselves\", and meets Viviana Ivinisova, later known as Viv Ivins. Viviana is a Russian who talks with the spirit world. She is a Luciferian, and says that loyalty to her lord can bring Marilena the baby she wants so badly. However, this baby comes through genetic engineering with the best traits of two sperm mixed into a hybrid sperm, which is fused with the egg. At first, it is unknown who Nicolae's two biological fathers are. Later, they are found out to be Sorin and his lover, and Nicolae orders them executed and the truth covered up. After giving birth and realizing the amazing talent her son possesses, while showing no concern for her, Marilena discovers Viv's plans for the prodigy child. Jonathan Stonagal is the financier of Nicolae's education. However, Marilena disagrees with these plans so much that she is finally assassinated; however, Nicolae is the one who plans her death through poisoning. Once Nicolae has become a powerful businessman, he is taken by a demon to the desert, where he is forced to remain without food or water for forty days. In a contrast to Jesus' temptation, Nicolae falls to all three temptations. After this, Nicolae is returned to Romania. Meanwhile, Rayford Steele deals with his father, who is determined to have Ray take over the family business. Ray has his own dreams of becoming a pilot, and joins ROTC to attend college, where he meets and almost marries Kitty. However, Ray has second thoughts about the latter, and breaks up with her. Furthermore, he later dates his friend Irene, and they get married after a while. Chloe Steele is born during this time as well. After befriending a woman named Jackie, Irene slowly begins to feel something is missing in her life. Jackie, a Christian, lays out God's plan of salvation, and Irene accepts Christ."
}