{
    "book_id": "3079253",
    "mid": "/m/08pzhf",
    "title": "The Chosen",
    "author": "Ricardo Pinto",
    "publication_date": "1999",
    "genres": [
        "Fantasy"
    ],
    "text": " The story concerns the move from boy to man of its hero, Carnelian, son of the Lord Suth. Formerly powerful and influential, Lord Suth is in exile far from Osrakum, capital of the Three Lands. His son has been brought up with only his father and immediate household, which though extensive is only a pale shadow of the extravagance and excesses of the court life normally experienced by a ruling Lord. A delegation of lords comes to their island, asking that Suth will return to the capital and oversee the election of a new emperor, since the current one is dying. The emperor has two sons, and a choice must be made between them. Suth agrees, and Carnelian is thrown into a world of cruelty and indifference to the suffering of others. His home is torn apart to make repairs to the ship which brought the delegation. Most of the household are left behind, without the stores they would have needed to survive the winter. It is death for a common man to look upon the face of such a lord, and Carnelian has several sharp lessons in the laws of caste which govern this society. The journey to Osrakum is experienced by the reader through the impressions of Carnelian, as a stranger to the three lands. Once at court, Carnelian again experiences the contrasts between the rich and powerful, and their inconsequential slaves. He becomes involved in the affairs of the two brothers contending for the throne. His position as an outsider and his fathers position, initially as regent and then as arbiter of the election, makes him well placed to see the inner workings of the palace and to become a natural rulebreaker and explorer of secret places. He becomes allied to prince Osidian, who in a tight and vicious contest gains the greatest number of votes to become Emperor. Molochite, the other prince, is not the sort to accept such a loss. Carnelian and Osidian are abducted, making it impossible for Osidian to attend his own coronation and causing him to lose the election by default."
}