{
    "book_id": "5421868",
    "mid": "/m/0dl4k6",
    "title": "The Tinder Box",
    "author": "Hans Christian Andersen",
    "publication_date": "1835-05-08",
    "genres": [
        "Children's literature"
    ],
    "text": " The story opens with a poor soldier returning home from war. He meets a witch, who asks him to climb into a hollow tree to retrieve a magic tinderbox. The witch gives the man permission to take anything he finds inside the chambers, but he must return the tinderbox. In the tree, he finds three chambers filled with precious coins guarded by three monstrous dogs, \"one with eyes the size of teacups\", who guards a vault filled with pennies, one with \"eyes the size of supper-plates\", who guards a vault filled with silver, and one with eyes \"the size of windmills\", who guards a vault filled with gold. He fills his pockets with money, finds the tinderbox, and returns to the witch. When she demands the tinderbox without giving a reason, the soldier lops off her head with his sword. In the following scene, the soldier enters a large city and buys himself splendid clothing. He makes many friends, and lives in a magnificent apartment. He learns of a princess kept in a tower after a prophecy foretold her marriage to a common soldier; his interest is piqued and he wants to see her but realizes his whim cannot be satisfied. Eventually, the soldier's money is depleted and he is forced to live in a dark attic. He strikes the tinderbox to light the room, and one of the dogs appears before him. The soldier then discovers he can summon all three dogs and order them to bring him money from their subterranean dwelling. Again, he lives splendidly. One night, he recalls the story of the princess in the locked tower, and desires to see her. He strikes the tinderbox and sends the dog with eyes the size of teacups to bring her to his apartment. The soldier is overwhelmed with her beauty, kisses her and orders the dog to return her to the tower. The following morning, the princess tells her parents she has had a strange dream and relates the night's adventure. The royal couple then watch her closely. When the princess is carried away again, they unsuccessfully use a trail of flour and chalk marks on neighborhood doors to find where she spends her nights. Eventually, her whereabouts are discovered and the soldier is clapped in prison and sentenced to death. On the day of execution, the soldier sends a boy for his tinderbox, and, at the scaffold, asks to have a last smoke. He then strikes the tinderbox and the three monstrous dogs appear. They toss the judge and the councilors, the King and Queen into the air. All are dashed to pieces when they fall to earth. The soldier and the princess are united, and the dogs join the wedding feast."
}