{
    "book_id": "1421363",
    "mid": "/m/05058l",
    "title": "The Blank Slate: The Modern Denial of Human Nature",
    "author": "Steven Pinker",
    "publication_date": "2002",
    "genres": [
        "Non-fiction"
    ],
    "text": " Pinker argues that modern science has challenged three \"linked dogmas\" that constitute the dominant view of human nature in intellectual life: * the blank slate (the mind has no innate traits) &mdash; empiricism * the noble savage (people are born good and corrupted by society) &mdash; romanticism * the ghost in the machine (each of us has a soul that makes choices free from biology) &mdash; mind/body dualism Much of the book is dedicated to examining fears of the social and political consequences of his view of human nature: * \"the fear of inequality\" * \"the fear of imperfectibility\" * \"the fear of determinism\" * \"the fear of nihilism\" Pinker claims these fears are non sequiturs, and that the blank slate view of human nature would actually be a greater threat if it were true. For example, he argues that political equality does not require sameness, but policies that treat people as individuals with rights; that moral progress doesn't require the human mind to be naturally free of selfish motives, only that it has other motives to counteract them; that responsibility doesn't require behavior to be uncaused, only that it respond to praise and blame; and that meaning in life doesn't require that the process that shaped the brain must have a purpose, only that the brain itself must have purposes. He also argues that grounding moral values in claims about a blank slate opens them to the possibility of being overturned by future empirical discoveries. He further argues that a blank slate is in fact inconsistent with opposition to many social evils since a blank slate could be conditioned to enjoy servitude and degradation. Evolutionary and genetic inequality arguments do not necessarily support right-wing policies. Pinker writes that if everyone was equal regarding abilities it can be argued that it is only necessary to give everyone equal opportunity. On the other hand, if some people have less innate ability through no fault of their own, then this can be taken as support for redistribution policies to those with less innate ability. Further, laissez-faire economics is built upon an assumption of a rational actor, while evolutionary psychology suggests that people have many different goals and behaviors that do not fit the rational actor theory. Raising living standards, also for the poor, is often used as an argument that inequality need not be reduced, while evolutionary psychology may suggest that low status itself, apart from material considerations, is highly psychologically stressful and may cause dangerous and desperate behaviors, supporting a society reducing inequalities. Finally, evolutionary explanations may also help the left create policies with greater public support, suggesting that people's sense of fairness (caused by mechanisms such as reciprocal altruism) rather than greed is a primary cause of opposition to welfare, if there is not a distinction in the proposals between what is perceived as the deserving and the undeserving poor. Pinker also gives several examples of harm done by the belief in a blank slate of human nature: * totalitarian social engineering. If the human mind is a blank slate completely formed by the environment, then ruthlessly and totally controlling every aspect of the environment will create perfect minds. * Inappropriate or excessive blame on and guilt for parents since if their children do not turn out well this is assumed to be entirely environmentally caused and in particular due to the behavior of the parents. * release of dangerous psychopaths who quickly commit new crimes. * construction of massive and dreary tenement complexes since housing and environmental preferences are assumed to be culturally caused and superficial. * persecution and even mass murder of the successful who are assumed to have gained this unfairly. This includes not only individuals but entire successful groups who are assumed to have become successful unfairly and by exploitation of other groups. Examples include kulaks in the Soviet Union; teachers and \"rich\" peasants in the Cultural Revolution; and city dwellers and intellectuals under the Khmer Rouge."
}