{
    "book_id": "17328064",
    "mid": "/m/043lf37",
    "title": "The Shack: Where Tragedy Confronts Eternity",
    "author": "William P. Young",
    "publication_date": "2007-05",
    "genres": [
        "Fiction"
    ],
    "text": " The novel is set in the American Northwest. The main character is Mackenzie Philips, a father of five, called \"Mack\" by his family and friends. Four years prior to the main events of the story, Mack takes three (of his five) children on a camping trip to Wallowa Lake near Joseph, Oregon stopping at Multnomah Falls on the way. Two of his children are playing in a canoe when it flips and almost drowns Mack's son. Mack is able to save his son by rushing to the water and freeing him from the canoe's webbing, but unintentionally leaves his youngest daughter Missy alone at their campsite. After Mack returns, he sees that Missy is missing. The police are called, and the family discovers that Missy has been abducted and murdered by a serial killer known as the \"Little Ladykiller.\" The police find an abandoned shack in the woods where Missy was taken, her bloodied clothing is found, but her body is never located. Mack's life sinks into what he calls \"The Great Sadness.\" At the beginning of the book, Mack receives a note in his mailbox from \"Papa,\" saying that he would like to meet with Mack on that coming weekend at the shack. Mack is puzzled by the note – he has had no relationship with his abusive father since he left home at age 13. He suspects that the note may be from God, whom his wife Nan refers to as \"Papa.\" Mack's family leaves to visit relatives and he goes alone to the shack, unsure of what he will see there. He arrives and finds nothing, but as he is leaving, the shack and its surroundings are supernaturally transformed into a lush and inviting scene. He enters the shack and encounters manifestations of the three persons of the Trinity. God the Father takes the form of an African American woman who calls herself Elousia and Papa, Jesus Christ is a Middle-Eastern carpenter, and the Holy Spirit physically manifests himself as an Asian woman named Sarayu. The bulk of the book narrates Mack's conversations with Papa, Jesus, and Sarayu as he comes to terms with Missy's death and his relationships with the three of them. Mack also has various experiences with each of them. Mack walks across a lake with Jesus, sees an image of his father in heaven with Sarayu, and has a conversation with Sophia, the personification of God's wisdom. At the end of his visit, Mack goes on a hike with Papa, who shows him where Missy's body was left in a cave. After spending the weekend at the shack, Mack leaves and is so preoccupied with his thoughts that he is nearly killed in an automobile accident. After his recovery, he realizes that he did not in fact spend the weekend at the shack, but that his accident occurred on the same day that he arrived at the shack. He also leads the police to the cave which Papa revealed, and they find Missy's body still lying there. With the help of forensic evidence discovered at the scene, the Little Ladykiller is arrested and put on trial."
}