{
    "book_id": "10862659",
    "mid": "/m/02qsbx5",
    "title": "The Princess Diaries, Volume VI: Princess in Training",
    "author": "Meg Cabot",
    "publication_date": "2005-04",
    "genres": [
        "Young adult literature"
    ],
    "text": " This story begins the day before Mia goes back to school to begin her sophomore year, which she feels is completely pointless, because Michael is now a freshman in college. The only thing that seems good about school this year is the arrival of a new English teacher, who both Mia and Lilly feel they will love. The first day of school begins, and Lilly does not make an effort to look nice because she has lost her boyfriend, Boris Pelkowski, to one of her and Mia's closest friends, Tina . Once Mia and Lilly arrive in school, they are shocked to discover that Boris has gotten 'hot' over the summer, making dramatic changes to his appearance so he can play violin better. The first English lesson of the year begins, and Mia, Lilly and Tina pass notes saying how great they think their new English teacher, Ms Martinez, is. Everything is going well until lunchtime, when, in the Jet Line, Lana, Mia's arch-enemy, tells Mia that college boys expect their girlfriends to Do It with them. This freaks Mia out because she is positive that she is not ready to sleep with anyone. Mia, thinking she has suffered enough for one day, receives another blow as Lilly nominates her for student-council president and Lana Weinberger, hearing this, immediately puts herself into the race, and Principal Gupta schedules the votes for president to be cast on the following Monday. Grandmere is delighted that Mia is running for president, because it will distract the media from Mia dumping snails into the bay back at Genovia to eat the killer algae that Monaco have dumped in, destroying the natural balance of the seas. Unfortunately, the snails don't seem to be doing anything, and some countries want Genovia to be kicked out of the EU. Lilly and Grandmere team up and organize Mia's campaign for student council president, putting posters up in the school, organizing televised interviews and handing out pens to promote Mia. Lilly confesses to Mia that she just wants Mia to run for president so that Mia can name her as her vice-president, and, after a few days, step down because of her hectic schedule and name Lilly as her successor, as Lilly is not popular enough to become president herself. A stressful school week ends and Mia visits Michael's dorm on Saturday (after a big sleepover at the Plaza with her friends, Lily Moscovitz, Tina Hakim Baba, Ling-Su Wong and Shameeka Taylor, where Mia stayed up until three o clock and was woken early because Lilly forced her to go to a soccer game to promote her campaign) and meets his roommate, Doo Pak, where she discovers condoms in Michael's bathroom. Shocked by this discovery, Mia has The Talk with Michael, who says he knows Mia isn't ready because she invited her friends for a sleepover once she found out she had a hotel room to herself, and not him. Michael tells her he understands, but is not going to wait forever and Mia begins to think that Michael is going to break up with her, a theme that is repeated in almost every book where Mia and Michael are in a relationship. On Monday, Mia debates against Lana (a debate which is also televised), and provides a much more convincing argument than Lana and gets the majority of the vote. Mia realizes that she wants to be president herself, when Michael shows up at school and Mia leaves with him. They go out to a restaurant and talk, and they agree to see if Mia is ready to do it every 3 months. Their relationship is strong once again, and the story ends. This book is a successful hit being one of Meg Cabot's most mature books."
}