{
    "book_id": "545026",
    "mid": "/m/02nl51",
    "title": "The Black Arrow: A Tale of the Two Roses",
    "author": "Robert Louis Stevenson",
    "publication_date": "1888",
    "genres": [
        "Children's literature",
        "Adventure novel",
        "Speculative fiction",
        "Romance novel",
        "Fiction",
        "Historical novel",
        "Historical fiction"
    ],
    "text": " In the reign of \"old King Henry VI\" (1422–1461, 1470–1471) and during the Wars of the Roses (1455–1487) the story begins with the Tunstall Moat House alarm bell being rung to begin mustering troops for its absent lord Sir Daniel Brackley, who intends to join the Battle of Risingham. It is then that the \"fellowship\" known as \"The Black Arrow\" headquartered in Tunstall Forest begins to strike with its \"four black arrows\" for the \"four black hearts\" of Brackley and three of his retainers: Nicholas Appleyard, Bennet Hatch, and Sir Oliver Oates, the parson. The rhyme that is posted in connection with this attack gets the protagonist Richard Shelton, ward of Sir Daniel, to become curious about the fate of his father Sir Harry Shelton. Having been dispatched to Kettley, where Sir Daniel was quartered, and sent to Tunstall Moat House by return dispatch, he falls in with a fugitive from Sir Daniel, Joanna Sedley, disguised as a boy and going by the alias of John Matcham. She is an heiress kidnapped by Sir Daniel, who wanted to obtain guardianship over her. Coincidentally, Sir Daniel was intending to marry Joanna to Dick himself; and, in her male disguise, Joanna brings up the matter to Dick, affording her the opportunity of feeling him out on the subject. Dick says he is not interested, but he does ask her if his intended bride is good-looking and of pleasant disposition. While making their way through Tunstall Forest, Joanna tries to persuade Dick to turn against Sir Daniel in sympathy with the Black Arrow outlaws, whose camp they discover near the ruins of Grimstone manor. The next day they are met in the forest by Sir Daniel himself disguised as a leper and making his way back to the Moat House after his side was defeated at the Battle of Risingham. Dick and Joan then follow Sir Daniel to the Moat House. Here Dick changes sides when he finds out that Sir Daniel is the real murderer of his father and escapes injured from the Moat House. He is rescued by the outlaws of the Black Arrow with whom he throws in his lot for the rest of the story. The second half of the novel, Books 3-5, tells how Dick rescues his true love Joanna from the clutches of Sir Daniel with the help of both the Black Arrow fellowship and the Yorkist army led by Richard Crookback, the future Richard III of England. The second half of the narrative centers around Shoreby, where the Lancastrian forces are well entrenched. Robert Louis Stevenson inserts seafaring adventure in chapters 4-6 of Book 3 as Dick and the outlaws steal a ship and attempt a seaside rescue of Joanna, who is being kept in a house by the sea. They are unsuccessful, and after Joanna is moved to Sir Daniel's main quarters in Shoreby, Dick then visits her in the guise of a Franciscan friar, which was a disguise used during the Wars of the Roses. Stevenson, the popularizer of the tales of the Arabian nights, has Dick tell the tale of Ali Baba and the Forty Thieves in Book 4, chapter 6 to help him escape from the ruined sea captain Arblaster, whose ship Dick and the outlaws had stolen. In the course of shadowing Sir Daniel in his goings to and from the house by the sea, Dick and the outlaws, who have made their Shoreby headquarters the \"Goat and Bagpipes\" alehouse, encounter another group of spies interested in Joanna. After a skirmish in the dark in which the outlaws prevail, Dick finds that he has conquered Joanna's lawful guardian Lord Foxham. Foxham, a Yorkist, promises to give Joanna to Dick in marriage depending on the outcome of a contemplated seaside rescue. There is irony in Foxham scolding Dick, who is nobly born, for consorting with outlaws when the outlaws are recruited in Dick and Foxham's plans to rescue Joanna. Seriously wounded in the failed seaside rescue, Foxham writes letters of recommendation for Dick to Richard Crookback since he must retire temporarily from action. Richard Crookback, Duke of Gloucester, makes his appearance in Book 5, with whom Dick keeps Lord Foxham's rendezvous. Dick's accurate knowledge of the Lancastrian forces in Shoreby aid Crookback in winning the battle. Dick is also successful as one of Crookback's commanders. A delighted Crookback knights Dick on the field of battle and, following their Yorkist victory, gives him fifty horsemen to pursue Sir Daniel, who has escaped Shoreby with Joanna. Dick succeeds in rescuing Joanna, but loses his men in the process. He, Joanna, and Alicia Risingham travel to Holywood where he and Joanna are finally married. In this way he keeps his initial pledge to Joanna to see her safe to Holywood. In the early morning of his wedding day Dick takes a walk on the outskirts of Holywood. He encounters a fugitive Sir Daniel trying to enter Holywood seaport to escape to France or Burgundy. Because it is his wedding day, Dick does not want to soil his hands with Sir Daniel's blood, so he simply bars his way by challenging him either to hand to hand combat or alerting a Yorkist perimeter patrol. Prudently, Sir Daniel opts to go away. Just after he leaves Dick he is shot by Ellis Duckworth with the last black arrow. Duckworth found in prayer by Dick tells him, \"But be at rest; the Black Arrow flieth nevermore - the fellowship is broken.\" Sir Richard and Lady Shelton live in Tunstall Moat House untroubled by the rest of the Wars of the Roses. They provide for both Captain Arblaster and the outlaw Lawless by pensioning them and settling them in Tunstall hamlet. Lawless does a volte face by returning to the Franciscan order as a friar by the name of Brother Honestus."
}