{
    "book_id": "3133672",
    "mid": "/m/08tln8",
    "title": "The Scapegoat",
    "author": "Daphne du Maurier",
    "publication_date": "1957",
    "genres": [
        "Crime Fiction"
    ],
    "text": " 'I left the car by the side of the cathedral, and then walked down the steps into the Place des Jacobins. It was still raining hard. It had not once let up since Tours, and all I had seen of the countryside I loved was the gleaming surface of the route nationale, rhythmically cut by the monotonous swing of the windscreen-wiper. Outside Le Mans, the depression that had grown upon me during the past twenty-fours had intensified.' (p.1) The Scapegoat is narrated by John, an Englishman and lecturer in French history at a London university, who is coming to the end of his holiday in France. He arrives in Le Mans, depressed and melancholy at the thought of returning to his lectures: 'the real meaning of history would have escaped me, because I had never been close enough to people' (p.1). John feels lonely, isolated, and as though his outward life is a meaningless facade. 'I lived and breathed and had my being as a law-abiding, quiet, donnish individual of thirty-eight. But to the self who clamoured for release, the man within? How did my poor record seem to him? [...] Perhaps, if I had not kept him locked within me, he might have laughed, roistered, fought and lied' (p.10). John considers concluding his visit at the Abbaye de la Grande-Trappe where he hopes to find some consolation but as he crosses the road in Le Mans the driver of a car calls out to him, addressing him as Jean. John tries to explain to the man who seems to know him that there has been a mistake but the man takes it to be a deliberate deception, winks, laughs and drives away. He enters the station buffet and is confronted by another man: 'I realised, with a strange sense of shock and fear and nausea all combined, that his face and voice were known to me too well. I was looking at myself' (p.13). John has a premonition that meeting his double could be 'fraught with tragedy, like the Man in the Iron Mask' (p.14) but he sits down and has a drink with his doppelganger, to whom he begins to confess his feelings of depression and failure. His double mistakes him for a Frenchman because of his excellent grasp of the language and they eventually retire to a backstreet hotel where they continue to drink and eventually swap clothes. John falls to the floor drunk and when he awakes, he discovers a chauffeur at the door: 'Monsieur le Comte is awake at last?' (p.27). John realises that his double has disappeared with his clothing and he attempts to convince the chauffeur that he is not the Comte. The chauffeur believes him to be drunk and when he enquires after the 'gentleman I was with last night' (p.30) the hotel receptionist has no knowledge of him. John decides that if 'he wished to make an idiot of me, I would do the same to him. I would put on his clothes and drive his car to hell - as he was no doubt driving mine - and have myself arrested, and then wait for him to turn up and explain his senseless action as best he could' (p.31). Ignoring further opportunities to explain his predicament, John shaves, dresses, gets in the car and they make for the chateau at St Gilles. He realises that Jean de Gué 'had given me what I asked, the chance to be accepted. He had lent me his name, his possessions, his identity. I had told him my own life was empty: he had given me his' (p.34). They arrive at the chateau and John is met by a man named Paul, Jean's brother, who appears irritated by his lateness. John enters the house and goes into a room in which three women are seated. One, named Blanche, leaves as soon as he enters; the second, a fair-haired woman, who is pregnant, tells him that they have been worried about his absence; and the third, dark-haired, exchanges a knowing glance with him. The women inform him that Marie-Noel has a fever and when asked about Paris he declares carelessly: 'I have no idea what happened in Paris. I'm suffering from memory loss' (p.41). The pregnant woman expresses her hope that he has reached an agreement in Paris but John continues to taunt the women: 'Actually, I am not Jean de Gué at all. I am someone else. We met in Le Mans last night, and changed clothes, and he has disappeared in my car, heaven knows where, and I am here in his place. You must admit it's an extraordinary situation' (p.42). The women take no notice, believing him to be suffering from a hangover, and eventually John admits that he drank too much in Le Mans and leaves the room. Venturing upstairs, John finds himself in a bare room decorated only with religious paraphernalia: a painting of the scourging of Christ, a crucifix, and a small alcove for prayer. A servant discovers him and asks, looking rather surprised, if he is searching for Mademoiselle Blanche. He is told that she is with the Madame la Comtesse who is eager to see him and will not wait. He follows the servant into a room in which 'a massive elderly women, her flesh sagging in a hundred lines, but her eyes, her nose, her mouth so astonishingly and horribly like my own that for one wild moment I believed after all Jean de Gué had come up here before me and was masquerading as a final jest' (p.46). John intuits that the woman is Jean's mother and when she presses him as to whether he has renewed the contract; he tells her that everything has been arranged. She pesters him for a present that he has brought her from Paris and then they dine. She tells him that Marie-Noel has been having visions and that 'she kept telling Françoise and Renée that you were not coming back' (p.52). Blanche, who has been sitting with Madame la Comtesse while the local priest attended her, declares that she will inform the bishop if Marie-Noel continues to have visions of the Virgin Mary. The mother's maid, Charlotte, presses John for the package and he leaves the room, fortuitously stumbling upon Jean's dressing room where he discovers a number of parcels, marked F, R, B, P, M-N, and Maman. He returns with the parcel but Charlotte intercepts it and takes it away. When he returns to the dressing room he discovers that the pregnant woman is Françoise and that rather than being Paul's wife, as he had assumed, she is in fact Jean's wife. John gives her the package marked 'F' which turns out to be a locket brooch containing a miniature of himself/Jean. Françoise is pleased but confesses her deep unhappiness to John. When she falls asleep, John goes out into the corridors of the chateau and is accosted by Renée, the dark haired woman, who says: 'I waited for you, leaving my door open. Didn't you see it?' (p.64). John brushes her off and she storms away upstairs. He goes out onto the terrace at the back of the house and is suddenly pelted by chestnuts, by a kneeling figure in an upstairs window. He looks closer and discovers that it is a child who declares: 'I swear to you, that if you don't come to me by the time I count a hundred, I shall throw myself out of the window' (p.67). John rushes inside and finds the child, who looks like Jean de Gué in miniature and calls him 'Papa'; the child is Marie-Noel. She is affectionate and playful with him but notices that his hands and smell are different. She tells him that she had a vision of the Virgin Mary who told her that her father would not return. She declares that she would have killed herself if he had not returned: 'And then I should have burnt in hell. But I would rather burn in hell than live in this world without you' (p.71). Her room, like Blanche's, also contains a crucifix, a prie-dieu, and pictures of the saints. John returns to his bedroom and opens the package marked M-N, it is a book called 'The Little Flower' about St Therese Lisieux. John thinks that Jean acted wrongly to escape from the chateau- 'none of these people under his roof would be behaving as they had behaved tonight but for something he had done to them' (p.76)-but he sees an opportunity for himself to put it right. When John awakes the next morning, Gaston tells him that Paul will be expecting him at the verrerie (the glass-works) in the afternoon. John gives Marie-Noel her present and declares that he will give all the other presents at lunchtime, although Marie-Noel is surprised that there is one for Blanche. At lunch, the content of Renée's package- a lace nightgown- upsets the party and there is further embarrassment when Marie-Noel reads the label on Paul's present- a remedy for impotence. Blanche does not open her parcel. John realises his mistake and leaves with Paul for the verrerie. He apologises for the mistake but Paul remains furious. At the verrerie, John discovers that the reason for Jean's visit to Paris was to attempt to save the business by renegotiating a contract with a firm called Carvalet to sell their glass. Despite having no idea as to the outcome of Jean's meeting, John tells Paul that he has renewed the contract and that production can continue as normal. Paul is delighted. John interrogates Jacques who works at the foundry and discovers that the verrerie is a liability and that unlike Jean's father, and Monsieur Duval who managed affairs previously, the Comte's management of the business has been non-existent. He then meets some of the workers at the foundry including Julie and her son-in-law André who had been badly injured in an accident. Back at the chateau, John reads the letter from Carvalet and discovers that they had declined to renew the contract and that the visit to Paris had been a failure. John decides to rectify the situation. He rings Carvalet and tells them that he will accept their terms, despite running the verrerie at a loss. He suspects that someone has overheard his phone call but he cannot locate the other extension. He rummages through Jean's desk in search of some information about his finances but instead finds a photograph album featuring himself, Paul, and Blanche as children, and a man named Maurice. Renée comes into the library and berates him for giving her the lingerie at the dinner table. John suddenly realises that Jean was having an affair with her and he attempts again to brush her off. He goes to see Marie-Noel and discovers that Blanche had opened her package. Inside was a bottle of perfume and a note: 'For my beautiful Béla, from Jean'. Marie-Noel also lets slip in conversation that Jean had not spoken to Blanche in fifteen years and John muses: 'no wonder the giving of a present had been out of character. The revelation was disturbing, even sinister, especially when I remembered the snapshots of the two children with their arms about each other. Something personal and bitter had come between Blanche and Jean de Gué, yet it was accepted by all, even by the child' (p.127). When John puts Marie-Noel to bed she tells him that she had sinned by threatening to kill herself and she attempts to perform penance by beating herself with a leather whip. Appalled by the effects which Blanche's religion is having on his daughter, John delivers the whip back to her only to find the door slammed in his face. John decides to spend his second night at the chateau sleeping in the dressing room. 'I knew that everything I had said or done had implicated me further, driven me deeper, bound me more closely still to that man whose body was not my body, whose mind was not my mind, whose thoughts and actions were a world apart, and yet whose inner substance was part of my nature, part of my secret self' (p.138). The next morning John decides to go to the bank in Villars to investigate his double's finances. Renée contrives to go with him but John encourages Marie-Noel to join the party. Marie-Noel is delighted but when doing cartwheels in her mother's room, smashes two ornaments. Françoise is upset and lashes out at the child, telling her that when the baby arrives, she will take second place. John takes the pieces of the ornaments with him, parcelled up in some discarded paper he found in the dressing room, hoping to arrange for them to be mended in Villars. Renée is annoyed that she and Jean/John are to be chaperoned by the child and she goes off to the hairdressers. Marie-Noel visits the antique shop to see if they can fix the ornaments while Jean goes to the bank. In his vault he discovers the marriage settlement relating to Jean and Françoise. He discovers that Françoise's dowry was in trust for a male heir and that Jean would only come into the money otherwise if Françoise reached the age of fifty having only given birth to daughters or if she died. John understands why it is crucial for Françoise's baby to be a boy and why she is anxious about the pregnancy. John leaves the bank, having been told that Marie-Noel had already left town in a lorry going back to the verrerie. He goes over to speak to the blonde woman who he presumes owns the antique shop where Marie-Noel left the ornaments. She ushers him inside and declares: 'That child of yours is adorable but it was very naughty of you to send her here. Any why for heaven's sake did you wrap up those pieces of broken porcelain in cellophane and paper with a card addressed to me?' (p.155). John inadvertently wrapped the pieces in the paper containing the note to 'Béla' from Jean. He realises that this woman in Villars is Béla and she is another of the Comte's mistresses. John tells Béla the truth about the Carvalet contract and she asks him why the sudden concern for the verrerie and its workforce. She tells him that she has always wondered whether his lack of interest in the place was because of what happened to Maurice Duval. John encourages her to keep talking and she mentions that he died during the Occupation. He tries to tell her about the change that has come over him/Jean and that he is a different person. Béla replies 'you aren't the only one with a dual personality. We all have multiple selves. But no one avoids responsibility that way. The problems remain to be tackled just the same' (p.164). When John returns to the house, he discovers that the doctor who had called to see Françoise has already left and he has ordered her to remain in bed in order to protect the baby. He goes to talk to Françoise and tells her that he had a long meeting at the bank which prevented him from being home in time, and he confesses about the Carvalet contract. Françoise is pleased that he confided in her and she then asks if he looked at the marriage settlement when he was in the vault. He says that he did and she asks whether he will inherit the money if she dies. '\"What happens if I die? You get everything, don't you?\" \"You're not going to die\"' (p.172). John goes to see Jean's mother and when he mentions that perhaps Françoise should see a specialist if the pregnancy is going to present problems, she says slyly 'Whatever for?' (p.176). They are interrupted by a telephone call from Dr Lebrun. He tells John that Françoise needs complete rest. Marie-Noel asks why the servants are gossiping about the baby dying and she asks why they need to have another baby. John replies honestly that it is because of the money they will receive from the marriage settlement. John returns upstairs to sit with Françoise rather than brave Paul and Renée in the salon. She is touched, if a little surprised, by the concern. The following day he goes down to the verrerie to go through the figures with Jacques in the office and he then asks about the rest of the disused house. He finds a box of books, one of which is inscribed 'Maurice Duval', and he asks Jacques why they don't make the house inhabitable. He replies that 'there are not very happy memories connected with the house when it was last inhabited. Few people would wish to live there now [...] When the last man to live here, the master of the verrerie, Monsieur Duval, is woken from his bed in the middle of the night, and taken downstairs and shot by his own countrymen, and his body thrown into the well cut to pieces with his own glass, even if it happened a long time ago and is something we all prefer to forget, yet it does not make anybody very anxious to come and live here, where it happened, bringing a wife and family' (p.189). John signs the new contract from Carvalet and puts it in the post. He then goes to talk to Julie and asks her about the Occupation. She shows him a snapshot of a young German officer whose coat she cleaned so that he would not get in trouble with his superiors. The villagers ostracised her two years afterwards: 'so you see, when war comes to one's own village, one's own doorstep, it isn't tragic and impersonal any longer. It's just an excuse to vomit private hatred' (p.194). When he returns to the chateau, the servants ask John about the arrangements for the annual shoot the following day. He has overheard references to the 'grande chasse' during the past few days but he suddenly realises its implications: he, John, cannot shoot. He goes out into the grounds of the chateau, desperate for an excuse not to participate. He sees a fire burning and decides on a rash course of action. He drops Jean's watch into the fire and then thrusts his hand into the flames to retrieve it. He returns inside in great pain, to the shock of the family, especially when they discover that the watch he had wished to save had been a present from Maurice Duval. Blanche dresses the wound and he tells Paul to organise the shoot; now he is injured, he has no interest in it. When he goes to put Marie-Noel to bed, she tells him that she saw him thrusting his hand into the fire on purpose. He tells her that it was because he had not wanted to shoot and she says that he must have been thinking about Duval. When John questions her further she says that she knows he met a horrible death, but that her grandmother had forbidden her from talking about Duval either to her father or to Blanche. She asks if he did it because he didn't want to kill any birds, and when he says that perhaps that was the reason, she is pleased at his courage and his 'great act of humiliation' (p.216). John persuades her not to mention it to any one and Marie-Noel agrees, although she tells him that she thinks his act to be like the sacrificial mortifications of the saints. When the annual shoot begins the next day, John discovers Jean's mother welcoming the guests, who are so surprised by her emergence from the chateau that John's hand goes unnoticed. John is annoyed when she mocks Paul and Renée's attempts to run the shoot but he then finds himself unable to control Jean's dog, César. The dog scatters the birds, to Paul's annoyance, and John returns to the chateau with Gaston, drinking cognac from a hip flask. He meets the man who first mistook him for Jean in Le Mans before the swop took place and on a whim he gives the man his own address in London: '\"Any assistance you give this chap you'll be giving to me; we're closer than brothers.\" Then I burst out laughing, thinking him extremely stupid not to see the point' (p.229). John is encouraged to give a speech to the guests, which despite his inebriation he does, but they are not amused when he jokes that if he had shot with his damaged hand 'some of you present might never have survived' (p.230). When he returns to the chateau, John is summoned to Jean's mother who appears to be unwell. Her maid is downstairs in the kitchen and the mother urges him to help her, directing him to a drawer. When John opens it he discovers that the package which he brought back from Paris was ampoules of morphine. 'But his mother was not ill or dying, neither was she in pain' (p.234). He reluctantly administers the drug and she loses consciousness. John spends the night in Villars with Béla. He recounts the events of the day and when he recalls his quip about the gun she comments: 'Coming from a one-time Resistance leader to a group of well-known collaborators, it must have sounded curious all the same' (p.245). When he returns to the chateau he discovers a letter from Marie-Noel pushed under his door in which she writes: 'The Sainte Vierge tells me you are unhappy, and are suffering now for wrong done in the past, so I am going to pray that all your sins may be visited upon me, who, being young and strong, can bear them better.' (p.248). When he goes in to Françoise, she tells him that Marie-Noel has disappeared. Everyone goes out to look for Marie-Noel except Françoise. By chance John discovers her down at the house at the verrerie being looked after by Julie, who found her down the well amongst the broken glass after the dog, César, was found there barking. When he expresses surprise about the well and that it has contained no water for fifteen years, he finally discovers the secret of Jean's past. Maurice Duval was shot by Jean and his men: 'poor Monsieur Duval, whose only crime was trying to preserve the verrerie while you were absent, for which you and your little group of patriots called him a collaborator, and shot him, and let him die there in the well' (p.258). John's realises that Marie-Noel had climbed into the well as an act of penitence on behalf of her father. Blanche arrives and looks around her at the house and John suddenly realises that 'what she was looking at had once been part of her life' (p.260): Blanche had had a relationship with Duval. Marie-Noel wakes up and tells John that she had had a dream in which the Virgin Mary told her that her grandmother wanted Françoise to die: 'In the dream I wanted her to die too. So did you. We were all guilty. It was very wicked. Isn't there something you can do to prevent it coming true?' (p.263). At that moment there is a telephone call from the chateau for John to return at once. Françoise has fallen from the bedroom window and been taken to the hospital in Villars. She requires a blood transfusion and when Blanche says that either Jean or Paul could donate because they are the same blood type, John speaks up and denies it. Blanche declares: 'You don't want to save her. You're hoping she'll die' (p.269). Françoise and her baby, which was a boy, both die and John thinks back on his behaviour towards Jean's wife. He is glad he gave her the locket but he regrets that he had done no more. Back at the chateau, John interrogates his mother's maid Charlotte. She says that when Marie-Noel had gone missing, Françoise worried that 'the child might have turned against her. She is too fond of her papa, she said, and of Mademoiselle Blanche' (p.275). Charlotte tells John that she agreed with Françoise and he worries about how this might have affected her. He goes to the bedroom and leans out of the window, wondering whether her death can really have been an accident. Fearing the worst, John goes to interrogate Jean's mother. He forces her into recounting a conversation which she had with Françoise shortly before she died. Madame la Comtesse recalls: '\"Does he want me to die so that he can marry someone else?\" she [Françoise] asked at last. I told her I did not know. \"Jean makes love to everyone. He has made love to Renée, even, here in the chateau, and he has a mistress in Villars\" [...] \"So the child isn't the only one to want me out of the way,\" she said, \"Jean does, too, and so do you, and Renée, and the woman in Villars.\" I didn't answer her.' (p.283). Jean's mother concludes by saying 'You've got what you wanted, haven't you?' (p.283) but John denies it vehemently. He declares that he needs her help and after considerable effort, he persuades her to resume her position at the head of the family and to give up the morphine. She agrees and goes downstairs to begin making the funeral arrangements. The commissaire de police arrives to investigate Françoise's death. The suspicion of suicide is raised and when Charlotte is interviewed, she lets slip that she had been listening in to John's conversation with Carvalet about the renewal of the contract. Paul is astonished. When the commissaire goes to Françoise's bedroom Marie-Noel is there, having leant out the window and discovered the locket on the ledge. It seems that when leaning out to rescue Jean's present, Françoise fell. Paul confronts John about the Carvalet contract and he tells him the truth. John admits that he/Jean has no head for business and he agrees with Paul that if he had gone to Paris instead, the contract would no doubt have been more favourable. John suggests that Paul take over that part of the business and travel with Renée, while he stays at the chateau. Paul is surprised but he accepts, believing it to be the only way to save his marriage. Later when Renée confronts him, John says that he is not in love with her. She asks him whether he contrived the Carvalet contract in the hope that Françoise would die, and is relieved when he denies the charge. John sits with Jean's mother until she falls asleep as she is beginning to suffer withdrawal symptoms from the morphine. He then goes to see Blanche and while she dresses his hand, he forces her to talk about the past. He tries to apologise but Blanche is still angry, reminding him of his mockery of her and Duval's relationship, and his jealousy when their father made Duval head of the verrerie. John tells Blanche that he wants her to run the verrerie in his place and to live in the master's house. 'The house is waiting there for you. It's been waiting for fifteen years.' (p.326). The next day the funeral arrangements are begun, Blanche goes down to the verrerie, and Renée begins to talk about travelling with Paul. Then there is a telephone call for John. It is Jean de Gué: 'It's me. Jean de Gué. I've just seen today's newspaper. I'm coming back' (p.334). They agree to meet at the master's house at the verrerie. 'Although the emotion that filled me now was violent, over-whelming, yet at the same time I felt deliberate and calm. I was the possessor now, he the intruder. The chateau was my chateau, the people were my people, the family who in a few minutes would sit with me round the table were my family, my flesh and blood; they belonged to me and I to them. He could not return and make them his again' (p.336). John goes into the library and removes a revolver from the desk drawer. He waits in the master's house but when there is a knock at the door, he finds the priest standing there, who takes the gun from his hand. The priest had feared that John might kill himself and he says: 'What good would that do, to you or to them? By living, you can create their world afresh. Already I see signs of it, here in the master's house' (p.343). When the priest leaves, Jean de Gué enters holding a gun and says 'So you planned to get rid of me, did you, and stay in St Gilles?' (p.345). Jean is amazed that John has managed to keep up the deception for seven days and he amuses himself by wondering how John dealt with his various intrigues, and problems with Renée, with Blanche, with Françoise. He mocks John's attempt to take his mother off morphine: 'tonight she'll be a raving maniac', and he thinks that John's plan for Renée and Paul will break up their marriage even sooner: 'Renée will find the lover she's been searching for and Paul feel himself more inferior than ever [...] What want of tact, if I may say so, how lacking in finesse' (pp.347-8). He is more concerned with the Carvalet contract but considers that asking Blanche to run the verrerie might in fact make sound business sense. Jean thinks that John wants to stay at the chateau for the money and comfort, but John says 'I happen to love your family, that's all' (p.349). Jean laughs in disbelief that he could love them, listing their faults: 'Paul, who is an oaf, a weakling, a thoroughly disagreeable personality [...] Blanche, who is so twisted with repressed sex and frustrated passion that the only stimulation she gets out of life is to kneel before a bleeding crucifix' (p.350). John tells Jean to kill him, if that is his wish, and to throw him down the well. Jean is surprised that he has discovered the secret about Duval. He believes that John could not possibly have met Béla, and John does not disabuse him of this notion. He then tells John that during his time in the chateau, he had been to London. Jean stayed in his flat and then sold it, clearing out his bank account and changing the money into francs after fortuitously meeting up with his friend from Le Mans, to whom John had given his London address during the annual shoot. John is astounded: 'unless I liked to make a fool of myself by writing to the university and saying it was all a mistake - that I had decided not to resign after all - I had no work. I had no money, save for one or two investments. I had no flat, and if I didn't get back to London soon I should have no furniture. I did not exist. The self who had lived in London had gone forever' (p.355). Jean admits that in a strange way he missed his family, and the two exchange clothes. Jean suggests that they might make the switch again, from time to time, if they fancied a change. They get into John's car and drive towards the chateau. He tries to tell Jean that his family has changed, but he ignores him. Jean gets out of the car and walks the rest of the way and John sees him greet Marie-Noel as he drives on along the road. John drives to Villars to see Béla. She alone had realised that he was someone else and not the real Jean de Gué. She says that he had a 'tendresse' that Jean did not possess. She says that because of John the family in the chateau will be different, even if Jean tries to undo the good he has done there. John says that Jean is a 'devil' but Béla replies: 'he's not a devil. He's a human, ordinary man, just like yourself' (p.364). She tells him that 'you've given something to all of us [...] Just now I called it tendresse. Whatever it is, it can't be destroyed. It's taken root. It will go on growing. In the future we shall look for you in Jean, not for Jean in you' (pp.364-5). John says that at St Gilles his failure turned into love but 'the problem remains the same. What do I do with love?' (p.367). He leaves resolving to follow his original path to the Abbey de la Grande Trappe. 'I drove to the network of roads at the top of the town, turned left, and took the road to Bellême and Mortagne' (p.368)."
}