{
    "book_id": "4296575",
    "mid": "/m/0bvq05",
    "title": "The Black Book",
    "author": "Orhan Pamuk",
    "publication_date": "1990",
    "genres": [
        "Fiction"
    ],
    "text": " The protagonist, an Istanbul lawyer named Galip, finds one day that his wife Rüya (the name means \"dream\" in Turkish) has mysteriously left him with very little explanation. He wanders around the city looking for his clues to her whereabouts. He suspects that his wife has taken up with her half-brother, a columnist for Milliyet named Celal, and it happens that he is also missing. The story of Galip's search is interspersed with reprints of Celal's columns, which are lengthy, highly literate meditations on the city and its history. Galip thinks that by living as Celal he can figure out how Celal thinks and locate both him and his wife, so he takes up residence in Celal's apartment, wearing his clothes and eventually writing his column. Galip starts getting mysterious phone calls from one of Celal's obsessed fans, who displays an astonishing familiarity with the columnist's writings. After Galip's columns under Celal's name start to take the form of impassioned pleas to Rüya, a woman from Celal's past misinterprets the articles and calls Galip, thinking they are actually Celal's attempts to win her back. It turns out that Celal and the woman had had an affair, and the fan who is calling Galip is the woman's jealous husband. In an eerie twist, it turns out that the husband has been following Galip around Istanbul in an attempt to find Celal through him, accounting for Galip's frequent apprehension that he is being watched. Galip finally agrees to meet both of them at a public location, a store called Aladdin's that figures in much of the narrative. Soon after, Celal is shot to death in the street. Rüya is found also shot in Aladdin's store. The identity of the killer is never discovered for certain. The novel ends with the postmodern twist of the author revealing his presence in the narrative. The story is more concerned with exploring the nature of story-telling as a means of constructing identity than with a straightforward plot. As such, it is full of stories within the main story, relating to both Turkey's Ottoman past and contemporary Istanbul."
}