{
    "book_id": "13130092",
    "mid": "/m/02z7vxk",
    "title": "The Reluctant Queen: The Story of Anne of York",
    "author": "Eleanor Hibbert",
    "publication_date": "1990",
    "genres": [
        "Historical novel"
    ],
    "text": " The novel begins in with a prologue, in the year 1485. Anne, the narrator, knows she is dying and has decided to write her memoirs before death slowly takes her. She worries about the fate of her family including that of her husband Richard, the King of England. Richard is severely maligned by his people, and Anne fears that his power and position would be greatly jeopardized after her death. This leads to her reminiscing on happier days. She recalls growing up in the English countryside with her noble family: her father Richard, her mother Anne, and sister Isabel. At the age of five she meets her future husband, eight-year-old Richard Plantagenet who is studying under the tutelage of her father. Richard's brother Edward has recently been proclaimed King by the English people, usurping the throne from mentally unstable King Henry VI and his aloof consort, Margaret of Anjou. Richard enthralls young Anne with tales of his brother and the Wars of the Roses. Anne's father as the Earl of Warwick has played a crucial part in placing Edward on the English Throne, and plans to marry him to French noblewoman, Bona of Savoy, much to his daughter Isabel's chagrin as she secretly wants to be Queen Consort. Soon all of England is shocked to discover that Edward has secretly married a young widowed mother, Elizabeth Woodville Grey who is five years older than he is, and is considered by many to be a \"commoner\". The Earl is disgusted with Edward's choice of a bride, as is Edward's mother Cecily Neville, Duchess of York, who out of spite informs her son that she had him illegitimately. He does not believe her and refuses to have the marriage annulled, something which will have calamitous results in the future. Isabel, dismayed that the King did not choose her for a bride, sets her sights on his younger brother George, Duke of Clarence. George and Isabel marry just as Warwick severs ties with King Edward and joins the Lancastrian side of the War of the Roses. A pregnant Isabel is so distressed by the sudden move that she gives birth to a stillborn daughter. Warwick proposes that Anne marry Edward, Prince of Wales Henry and Margaret's son. Anne is terrified that Queen Margaret will be her mother-in-law until she gets to know her better. Anne's parents, along with Isabel and George, head back to England, while Anne remains with her future in-laws. Soon Anne marries and travels back to England with her husband and mother-in-law as Princess of Wales. She is horrified to discover that her father has died in the dreaded Battle of Barnet. Prince Edward also dies in battle, much to the grief of Queen Margaret. Soon she and Anne are taken prisoner by the Yorkist soldiers. The King releases Anne, believing her the victim of her father's ambition. Queen Margaret is imprisoned and Anne is sent under the watchful eye of George and Isabel, as her mother in fear of her life is living in sanctuary in a abbey. Anne and Richard meet again after a long years absence and soon fall in love. Richard proposes marriage to her and she accepts, much to George's horror. George, wanting the inheritance of Warwick only for himself, drugs Anne and arranges for her to be spirited away to be taken in by servants and force her to believe that she is a disillusioned scullery maid. Anne manages to see through the facade and asks for one of the deposed servant girls for help. The girl alerts Richard who rescues Anne. The entire court as well as Isabel believed Anne to have run away after her marriage was refused by her guardian's. Despite several setbacks, Anne marries Richard and becomes Duchess of Gloucester. With her relatives restored to favor, Anne's mother is reunited with her children, and is delighted to learn that Isabel is pregnant again. Isabel gives birth to a daughter Margaret Plantagenet. Anne wants to give Richard a child and is dismayed to learn that he had had a mistress before the marriage, and shares two children with her. Anne is shocked and hurt but soon forgives Richard, and they eventually have a son christened Edward after the King. Isabel becomes pregnant again twice, but dies along with her last infant son. Richard's one-time mistress also dies leaving Anne as stepmother to her two young children. George, distraught over his wife's death, confronts the King and dies mysteriously. After several years, King Edward dies suddenly, leaving his young son as heir. It is soon discovered that the late King had betrothed marriage to another, making his marriage to Queen Elizabeth invalid, and barring her children from the throne. Richard, and a reluctant Anne assume rule as King and Queen. Anne worries about the health of her young son, and her own imbalances of illness which leads her to believe that Richard is attracted to his niece Elizabeth of York. When Edward dies, Anne's health takes a turn for the worse. Rumors envelop the countryside after Richard's nephews vanish without a trace. Richard invites his widowed sister-in-law and her daughter's back to court, despite Anne's paranoia about Elizabeth. Anne realizes her mistake too late. With the last ounce of her strength she writes her memoirs, then silently dies on the night of an eclipse. Unmentioned in the novel are Richard's eventual downfall and death at the battle of Bosworth and Elizabeth's rise as consort of the new king, and mother of a new dynasty, and the fate of Isabel's children Edward and Margaret who were executed in 1499 and 1541 respectively."
}