{
    "book_id": "2578185",
    "mid": "/m/07p8s5",
    "title": "The Historian",
    "author": "Elizabeth Kostova",
    "publication_date": "2005-06-14",
    "genres": [
        "Horror",
        "Speculative fiction",
        "Fantasy",
        "Fiction",
        "Historical novel",
        "Suspense"
    ],
    "text": " The Historian interweaves the history and folklore of Vlad Ţepeş, a 15th-century prince of Wallachia known as \"Vlad the Impaler\", and his fictional equivalent Count Dracula together with the story of Paul, a professor; his 16-year-old daughter; and their quest for Vlad's tomb. The novel ties together three separate narratives using letters and oral accounts: that of Paul's mentor in the 1930s, that of Paul in the 1950s, and that of the narrator herself in the 1970s. The tale is told primarily from the perspective of Paul's daughter, who is never named. Part I opens in 1972 Amsterdam. The narrator finds an old vellum-bound book with a woodcut of a dragon in the center associated with Dracula. When she asks her father Paul about it, he tells her how he found the handmade book in his study carrel when he was a graduate student in the 1950s. Paul took the book to his mentor, Professor Bartholomew Rossi, and was shocked to find that Rossi had found a similar handmade book when he was a graduate student in the 1930s. As a result, Rossi researched Ţepeş, the Dracula myth surrounding him, and the mysterious book. Rossi traveled as far as Istanbul; however, the appearance of curious characters and unexplained events caused him to drop his investigation and return to his graduate work. Rossi gives Paul his research notes and informs him that he believes Dracula is still alive. The bulk of the novel focuses on the 1950s timeline, which follows Paul's adventures. After meeting with Paul, Rossi disappears; smears of blood on his desk and the ceiling of his office are the only traces that remain. Certain that something unfortunate has befallen his advisor, Paul begins to investigate Dracula. While in the university library he meets a young, dark-haired woman reading a copy of Bram Stoker's Dracula. She is Helen Rossi, the daughter of Bartholomew Rossi, and she has become an expert on Dracula. Paul attempts to convince her that one of the librarians is trying to prevent their research into Dracula, but she is unpersuaded. Later, the librarian attacks and bites Helen. Paul intervenes and overpowers him, but he wriggles free. The librarian is then run over by a car in front of the library and apparently killed. Upon hearing her father's story, the narrator becomes interested in the mystery and begins researching Dracula as she and her father travel across Europe during the 1970s. Although he eventually sends her home, she does not remain there. After finding letters addressed to her that reveal he has left on a quest to find her mother (previously believed to be dead), she sets out to find him. As is slowly made clear in the novel, Helen is the narrator's mother. The letters continue the story her father has been telling her. The narrator decides to travel to a monastery where she believes her father might be. Part II begins as the narrator reads descriptions of her father and Helen's travels through Eastern Europe during the 1950s. While on their travels, Helen and Paul conclude that Rossi might have been taken by Dracula to his tomb. They travel to Istanbul to find the archives of Sultan Mehmed&nbsp;II, which Paul believes contain information regarding the location of the tomb. They fortuitously meet Professor Turgut Bora from Istanbul University, who has also discovered a book similar to Paul's and Rossi's. He has access to Mehmed's archive, and together they unearth several important documents. They also see the librarian who was supposedly killed in the United States&nbsp;– he has survived because he is a vampire and he has continued following Helen and Paul. Helen shoots the vampire librarian but misses his heart and consequently, he does not die. From Istanbul, Paul and Helen travel to Budapest, Hungary, to further investigate the location of Dracula's tomb and to meet with Helen's mother, who they believe may have knowledge of Rossi&nbsp;– the two had met during his travels to Romania in the 1930s. For the first time Helen hears of her mother and Rossi's torrid love affair. Paul and Helen learn much, for example that Helen's mother, and therefore Helen herself and the narrator, are descendants of Vlad Ţepeş. Part III begins with a revelation by Turgut Bora that leads the search for Dracula's tomb to Bulgaria. He also reveals that he is part of an organization formed by Sultan Mehmed&nbsp;II from the elite of the Janissaries to fight the Order of the Dragon, an evil consortium later associated with Dracula. In Bulgaria, Helen and Paul seek the assistance of a scholar named Anton Stoichev. Through information gained from Stoichev, Helen and Paul discover that Dracula is most likely buried in the Bulgarian monastery of Sveti Georgi. After many difficulties Paul and Helen discover the whereabouts of Sveti Georgi. Upon reaching the monastery they find Rossi's interred body in the crypt and are forced to drive a silver dagger through his heart to prevent his full transformation into a vampire. Before he dies, he reveals that Dracula is a scholar and has a secret library. Rossi has written an account of his imprisonment in this library and hidden it there. Paul and Helen are pursued to the monastery by political officials and by the vampire librarian&nbsp;– all of them are seeking Dracula's tomb, but it is empty when they arrive. Paul and Helen move to the United States, marry, and Helen gives birth to the narrator. However, she becomes depressed a few months afterwards. She later confesses that she feared the taint of the vampiric bite that she acquired earlier would infect her child. The family travels to Europe in an attempt to cheer her up. When they visit the monastery Saint-Matthieu-des-Pyrénées-Orientales, Helen feels Dracula's presence and is compelled to jump off a cliff. Landing on grass, she survives and decides to hunt him down and kill him in order to rid herself of his threat and her fears. When the narrator arrives at Saint-Matthieu-des-Pyrénées-Orientales, she finds her father. Individuals mentioned throughout the 1970s timeline converge in a final attempt to defeat Dracula. He is seemingly killed by a silver bullet fired into his heart by Helen. In the epilogue, which takes place in 2008, the narrator attends a conference of medievalists in Philadelphia, and stops at a library with an extensive collection of material related to Dracula. She accidentally leaves her notes and the attendant rushes out and returns them to her, as well as a book with a dragon printed in the center, revealing that either Dracula is still alive or one of his minions is imitating the master."
}