{
    "book_id": "9228597",
    "mid": "/m/0280zzm",
    "title": "The Astonishing Life of Octavian Nothing, Volume 1: The Pox Party",
    "author": "Matthew Tobin Anderson",
    "publication_date": "2006-09-12",
    "genres": [
        "Speculative fiction",
        "Young adult literature",
        "Historical fiction",
        "Historical novel"
    ],
    "text": " The greater part of the story is told by a boy named Octavian, who grew up with his mother Cassiopeia, an African princess, in a house full of philosophers and scientists in colonial Boston. Under the watchful eyes of Mr. Gitney, also known as 03-01, Octavian has received a classical education as well as a musical education which has made him into an extremely skilled violinist. Octavian eventually comes to understand the price of his powdered wigs and education: he is not only the \"property\" of Mr. Gitney, but he is also being used as an experiment to test whether the African race is inferior to the European race. In time, Cassiopeia angers the scientists' benefactor and the Society loses its monetary support. The two are forced to go under the new watchful eye of Richard Sharpe, who cuts Octavian off from his books. It is later revealed that Richard Sharpe works for a group of colonial businessmen, who now fund the house where Octavian is held. These businessmen own slaves, and it is strongly implied that Sharpe is attempting to bias the experiment with Octavian in order to prove that Africans are inferior. He does this by stopping most of Octavian's education and making him work in the house. When the political unrest that would later spur the American Revolution begins to seep into the Gitney household, Gitney decides to move into the countryside outside of Boston, and then hold a Pox Party. Each attendee is infected with the pox, with the hope that under this controlled circumstance they will have only benign cases. Gitney also wants to both weaken and quarantine his slaves when he begins to hear talk of a slave revolt. Cassiopeia, however, is killed by the pox, and after her death is dissected by the scientists in the house. Octavian discovers what the scientists are doing and in his anger flees the house, and ends up in the Colonial Army. Octavian's military adventures are narrated mostly in epistolary form by Private Evidence Goring in letters to his sister Fruition. Octavian is eventually recaptured, and back at the Gitney house he is kept chained and completely alone. When Sharpe and Gitney, as well as his former classics teacher Dr. Trefusis, eventually decide to speak with him, Octavian is furious to discover that, with many of their funds coming from plantation owners in Virginia, they are counting on Octavian to fail, and to prove the \"inferiority\" of the African race."
}