{
    "book_id": "299323",
    "mid": "/m/01rpw_",
    "title": "The Years of Rice and Salt",
    "author": "Kim Stanley Robinson",
    "publication_date": "2002",
    "genres": [
        "Alternate history",
        "Science Fiction",
        "Speculative fiction",
        "Novel"
    ],
    "text": " The novel is set in various locations around the world, starting in 783 AH by the Islamic calendar (1405 AD by the Gregorian calendar) with the Black Death plague killing nearly 99% of the population of Europe. The story follows a group (jāti) of protagonists who are continually reborn throughout the centuries into various cultural and geographical settings, as well as their meetings in bardo between their lives. The book features Muslim, Chinese (Buddhist, Daoist, Confucianist), American Indian, and Hindu culture, philosophy and everyday life. It mixes sophisticated knowledge about these cultures in the real world with their imagined global development in a world without Western Christendom. The main characters, marked by identical first letters throughout their reincarnations, but changing in gender, culture-nationality and so on, struggle for progress in each life. Each chapter has a narrative style which reflects its setting. Within the novel's re-imagined world, many places are given unfamiliar names, mostly of Chinese or Arabic origin. For example, Europe becomes Firanja, Great Britain and Ireland become the Keltic Sultanate, and Spain becomes al-Andalus; while the Pacific Ocean and Australia are called by Chinese names Dahai (大海) and Aozhou (澳洲), respectively, and North America becomes Yingzhou (鄞州), a land from Chinese myth. The ten chapters are: * Book One - Awake to Emptiness - A plague in Christendom, Zheng He's explorations, feudal China. * Book Two - The Haj in the Heart - Mughal India and the colonization of Europe. * Book Three - Ocean Continents - The discovery of the New World by the Chinese military. * Book Four - The Alchemist - An Islamic renaissance in Samarqand. * Book Five - Warp and Weft - Native Americans align with Samurai. * Book Six - Widow Kang - The Qing dynasty meets Islam in western China. * Book Seven - The Age of Great Progress - Beginnings of industrialism in Southern India; Japanese diaspora to North America. * Book Eight - War of the Asuras - A worldwide \"Long War\", fought for over 60 years in trenches with pre-atomic weapons between the nations of Islam and an alliance of Chinese, Indian, and Native American nations. * Book Nine - Nsara - Science, urban life and feminism in Islamic Europe's surviving post-war metropolis. * Book Ten - The First Years - Globalization and sustainability, and recovery from the Long War. Several historical figures make appearances in this world, including Tamerlane, Chinese explorer Zheng He, Akbar the Great, and Kampaku Toyotomi Hideyoshi. The first chapter is written in a style reminiscent of the Chinese classic, the Journey to the West. In the last chapters the book becomes increasingly reflexive, citing fictional scientists and philosophers introduced in previous chapters as well as referring to Old Red Ink, who wrote a biography about a reincarnating jati group."
}