{
    "book_id": "13091612",
    "mid": "/m/02z647h",
    "title": "The Last of the Jedi: Against the Empire",
    "author": "Judy Blundell",
    "publication_date": "",
    "genres": [
        "Science Fiction"
    ],
    "text": " Power grows, rebels face a choice: give in... or fight. Some form pockets of resistance on battleground planets . Some go undercover, trying to fight the Empire from the inside, and others watch and wait. For Ferus Olin, hatred for the Empire is personal. The things that have been closest to him have been destroyed. The order he once belonged to has been decimated. And the future isn't looking much brighter... Unless a true rebellion can be born. Ferus Olin is so decimated by Roan's death that the only thing that keeps him going is the fact that the Emperor has promised to teach him in the ways of the dark side. He believes that this will make him strong enough to kill Darth Vader. He only lives for Revenge. The Emperor has also put him in charge of finding possible Force adepts. During their last mission, in which Roan was killed Amie Antin was captured and this has left Wil, the new leader of the eleven heartbroken. Ferus arranges a plan to have her taken back before she is transferred off planet. He calls his own strike force of Ry-Gaul and Solace formerly known as Fy-Tor-Ana. Clive Flax is also on the team. Ferus goes through lesson one which Palpatine does not attend. He tells him he does not need a lightsaber; only to let his anger flow through him instead of accepting it and releasing it like a Jedi would. He destroys the room much like Vader did after he learned of Padme's fate. Vader meets with the evil scientist Jenna Zan-Arbor because he has learned that she has found a way to erase memory. She can erase certain memories and Vader wants the ones of Padme and Obi-Wan erased. She was always greedy and she accepts Vaders High price. Trevor Flume has enlisted in the Naval academy that Lune was taken to. Lune is a Force adept and naturally landed in his advanced class. Trevor is there to get him out, but during their escape they are caught and Lune is taken to his dad, Bog Divinian. Bog offers Lune to be used as a test subject for Zan-Abor's experiments, because he was to get in good with the Emperor and he also wants Lunes memories of his mother, Astri Oddo, erased. The instructor Maggis, helps Trevor escape because he is sick of the Empire. They ultimately save Ferus and Lune at the medical facility. Ferus was promoted to Head inquisitor and was sent to work over Hydra, the former head after Ferus took Malorum out. He gets a look at the list of possible Force adepts. He finds promising subjects and ignores the report about the little girl on Alderaan. This is probably Leia, but Ferus does not know it. Ferus first had to see Roan's family and tell them of his death. Contrary to his belief they did not blame him, but took him into consideration as well. Overtaken by grief, Ferus leaves the room and is met by Roan's first cousin. He learns that she turned down a job at a large medical facility. He asks her to take the job because he believes he can get information on Vader's identity. He believes this is the key to defeating him. She takes the job and gets him in. This may be the same facility that Vader was created at, because there was said to be a terrible scream at the end of the Clone Wars. Ferus lets his anger get to him and almost turns his back on Lune! He used the Force to distract Zan Arbor and escapes with the boy. He returns him to his mother back on Coruscant. Amie was successfully rescued, but Flame was injured in the process. Clive thinks hes seen her before and does not trust her. He ventures to her homeworld to find some answers but before he can get them, his contact was killed. He asks Astri to help him, and she accepts the distraction. Ferus makes a contact with Obi-Wan by which he is instructed to file a report dismissing the importance of the little girl on Alderaan. He does not want to waste his time because, again, he does not understand and Obi-Wan won't tell him. And in order to file the report he has to go to Alderaan and pretend to investigate. But he feels the pain in Obi-Wan's heart and decides to leave immediately. es:Against the Empire"
}