{
    "book_id": "1124243",
    "mid": "/m/048b9f",
    "title": "The True Believer: Thoughts on the Nature of Mass Movements",
    "author": "Eric Hoffer",
    "publication_date": "1951",
    "genres": [
        "Non-fiction"
    ],
    "text": " Hoffer argues that all mass movements such as fascism, communism, and religion spread by promising a glorious future. To be successful, these mass movements need the adherents to be willing to sacrifice themselves and others for the future goals. To do so, mass movements often glorify the past and devalue the present. Mass movements appeal to frustrated people who are dissatisfied with their current state, but are capable of a strong belief in the future. As well, mass movements appeal to people who want to escape a flawed self by creating an imaginary self and joining a collective whole. Some categories of people who may be attracted to mass movements include poor people, misfits, former soldiers, and people who feel thwarted in their endeavors. Hoffer quotes extensively from leaders of the Nazi and communist parties in the early part of the 20th century, to demonstrate, among other things, that they were competing for adherents from the same pool of people predisposed to support mass movements. Despite the two parties' fierce antagonism, they were more likely to gain recruits from their opposing party than from moderates with no affiliation to either. The book also explores the behavior of mass movements once they become established (or leave the \"active phase\"). With their collapse of a communal framework people can no longer defeat the feelings of insecurity and uncertainty by belonging to a compact whole. If the isolated individual lacks vast opportunities for personal advancement, development of talents, and action (such as those found on a frontier), he will seek substitutes. These substitutes would be pride instead of self-confidence, memberships in a collective whole like a mass movement, absolute certainty instead of understanding. Hoffer does not take an exclusively negative view of \"true believers\" and the mass movements they begin. He gives examples of how the same forces that give rise to True Believer mass movements can be channeled in more positive ways:"
}