{
    "book_id": "2588025",
    "mid": "/m/07p_w9",
    "title": "The Short-Timers",
    "author": "Gustav Hasford",
    "publication_date": "1979",
    "genres": [
        "Autobiographical novel",
        "Speculative fiction",
        "Fiction",
        "War novel"
    ],
    "text": " The book is divided into three sections, written in completely different styles of prose. \"The Spirit of the Bayonet\" chronicles Pvt. James T. \"Joker\" Davis' days in the Marine Corps boot camp, where a drill instructor (Gunnery Sergeant Gerheim) breaks the men's spirits and then rebuilds them as brutal killers. Here, Joker befriends two privates nicknamed \"Cowboy\" and \"Gomer Pyle\". The latter, whose real name is Leonard Pratt, earns the wrath of both Gerheim and the rest of the platoon through his ineptitude and weak character. Though he eventually shows great improvement and wins honors at graduation, the constant abuse has unbalanced his mind. In a final act of madness, he kills Gerheim and then himself in front of the whole platoon. This section is written in a very simple, savage style. \"Body Count\" shows some of Joker's life as a war correspondent for the Marines in 1968. While in Da Nang, he runs across Cowboy, now assistant squad leader in the Lusthog Squad. As the Tet Offensive begins, Joker is dispatched to Phu Bai with his photographer, Rafter Man. Here, he unwillingly accepts a promotion from Corporal to Sergeant, and the two travel to Huế to cover the enemy's wartime atrocities and meet up with Cowboy again. During a battle, Joker is \"wounded\" (actually only knocked out by an RPG concussion blast) and the book goes into a psychedelic dream sequence. After his quick recovery, Joker learns that the platoon commander was killed by a friendly grenade, while the squad leader went insane and attacked an NVA position with a BB gun only to be shot down. Later, Joker and Rafter Man battle a sniper who killed another Lusthog Marine and an entire second squad; the battle ends with Rafter Man's first confirmed kill and Cowboy's being wounded slightly. As Joker and Rafter Man head back to their base, Rafter Man panics and dashes into the path of an oncoming tank, which fatally crushes him. Joker is reassigned to Cowboy's squad as a rifleman, as punishment for wearing an unauthorized peace button on his uniform. The writing style in \"Body Count\" is more complex than that in \"The Spirit of the Bayonet\". \"Grunts\" takes place on a mission through the jungle with Cowboy's squad, outside of Khe Sanh. They encounter another sniper here, who wounds three of the men multiple times. After the company commander goes crazy and begins babbling nonsense over the radio, Cowboy decides to pull the squad back and retreat, rather than sacrifice everyone trying to save the wounded men. Animal Mother, the squad's M60 machine gunner, threatens Cowboy's life and refuses to retreat. Promoting Joker to squad leader, Cowboy runs in with his pistol and kills each victim with a shot to the head. However, he himself is repeatedly wounded in the process; before he can kill himself, the sniper shoots the gun out of his hand. Realizing his duty to Cowboy and the squad, Joker kills Cowboy and leads the rest of the men away. This section is written in a more complex style than the previous two, with more time spent on Joker's inner thoughts."
}