{
    "book_id": "6113208",
    "mid": "/m/0fqrbq",
    "title": "The Heart Is Deceitful Above All Things: Stories",
    "author": "Laura Albert",
    "publication_date": "2001-06-09",
    "genres": [
        "Novel"
    ],
    "text": " The Heart Is Deceitful Above All Things is told from Jeremiah's perspective and is a collection of interlinked chapters that focus on his early life with his mother. At the start of the novel, five-year-old Jeremiah is taken away from his foster parents to live with his biological mother Sarah, a drug addict and lot lizard prostitute, who has recently turned 23 and legally gained custody. Jeremiah moves with his mother from truck driver to truck driver as he gets older, though his age in each chapter is never clearly established. Sarah forces Jeremiah to take on various roles of siblings and offspring (gender determined by Sarah). After wetting his bed, Jeremiah gets viciously belted by her then-boyfriend, Luther, while his mother fondles his penis. He is made to shoplift by Sarah and is left home alone and unattended for six days when Sarah marries one of her men. The man returns alone from their honeymoon, explaining how Sarah abandoned him after he lost his money in Atlantic City. He then sodomises Jeremiah, then dumps him outside a hospital. After some ineffectual psychotherapy, he goes to live with his repressive Christian grandparents' home. Jeremiah is abused there as well; he is being forced to get into scalding water. Two years later, Jeremiah's mother unexpectedly turns up and takes him away, aware of the lack of power her parents have over the custody decision. She makes him grow shoulder-length hair and act as a girl, on occasion for the sexual satisfaction of her clients. With Sarah as the only influential figure in his life, Jeremiah starts to adopt his mother's seduction techniques. After dressing up as a 'baby doll', Jeremiah seduces Jackson, his mother's latest man. Jackson initially tries to rebuff the boy's advances, but then rapes him."
}