{
    "book_id": "1177458",
    "mid": "/m/04dqx9",
    "title": "The Magician",
    "author": "W. Somerset Maugham",
    "publication_date": "1908",
    "genres": [
        "Speculative fiction",
        "Fantasy",
        "Fiction"
    ],
    "text": " Arthur Burdon, a renowned English surgeon, is visiting Paris to see his fiancée, Margaret Dauncey. Margaret is studying art in Parisian school, along with her friend Susie Boyd. On his first evening in Paris, Burdon meets Oliver Haddo, who claims to be a magician and is an acquaintance of Burdon's mentor, the retired doctor and occult scholar Dr Porhoët. While none of the company initially believe Haddo's claims, Haddo performs several feats of magic for them over the following days. Arthur eventually fights with Haddo, after the magician kicks Margaret's dog. In revenge, Haddo uses both his personality and his magic to seduce Margaret, despite her initial revulsion towards him. They get married and run away from Paris, leaving merely a note to inform Arthur, Susie and Porhoët. Arthur is distraught at the abandonment and promptly returns to England to immerse himself in his work. By this time Susie has fallen in love with Arthur, although she realizes that this love will never be returned, and she goes away to Italy with a friend. During her travels, Susie hears much about the new Mr. and Mrs. Haddo, including a rumour that their marriage has not been consummated. When she eventually returns to England, she meets up with Arthur and they go to a dinner party held by a mutual acquaintance. To their horror, the Haddos are at this dinner party, and Oliver takes great delight in gloating at Arthur's distress. The next day, Arthur goes to the hotel at which Margaret is staying, and whisks her away to a house in the country. Although she files for divorce from Haddo, his influence on her proves too strong, and she ends up returning to him. Feeling that this influence must be supernatural, Susie returns to France to consult with Dr Porhoët on a possible solution. Several weeks later, Arthur joins them in Paris and reveals that he visited Margaret at Haddo's home and that she suggested her life was threatened by her new husband. She implies that Haddo is only waiting for the right time to perform a magical ritual, which will involve the sacrifice of her life. Arthur travels to Paris to ask for Dr Porhoët's advice. A week later, Arthur has an overwhelming feeling that Margaret's life is in danger, and all three rush back to England. When they arrive at Skene, Haddo's ancestral home in the village of Venning, they are told by the local innkeeper that Margaret has died of a heart attack. Believing that Haddo has murdered her, Arthur confronts first the local doctor and then Haddo himself with his suspicions. Searching for proof of foul play, Arthur persuades Dr Porhoët to raise Margaret's ghost from the dead, which proves to them that she was murdered. Eventually, Haddo uses his magic to appear in their room at the local inn, where Arthur kills him. However, when the light is turned on Haddo's body has disappeared. The trio visit Haddo's abandoned home to find that he has used his magic to create life - hideous creatures living in tubes - and that this is the purpose for which he sacrificed Margaret's life. After finding the magician's dead body in his attic, Arthur sets fire to the manor to destroy all evidence of Haddo's occult experiments."
}