{
    "book_id": "3320223",
    "mid": "/m/095mhg",
    "title": "The Dew Breaker",
    "author": "Edwidge Danticat",
    "publication_date": "2004",
    "genres": [
        "Fiction",
        "Novel"
    ],
    "text": " The Book of the Dead: main characters are introduced, Ka and her family. Ka sculpts a wooden statue of her father, it is cracked wood, scared and the image of him is thoughtful, pondering, staring at his hands. Ka and her father are on a trip in order to show the statue to someone who would like to buy it. The statue is a disturbance to Ka's father because he does not feel he is deserving of it. Before they reach their destination, Ka's father leaves their motel room with the sculpture and returns after many hours without it. Soon after he reveals the real reason he fled Haiti to his daughter. ″Ka, your father was the hunter, he was not the prey.″ The rest of this story is Ka seeing her father in a new light, not as the oppressed anymore. Seven: A short and seemingly completely unrelated story to the first, Seven is about a man whose wife arrives from Port-au-Prince to NYC. They've been separated for seven years and now are together again in a strange place, living together in a basement. In the basement also live her husbands two housemates, Michel and Dany. Her husband works two jobs, a night janitor at Medgar Evers College, and a day janitor at Kings' County Hospital. Water Child: Nadine works in a hospital. She has family in Haiti, and soon after we discover she seems to be a previous girlfriend of the man in the previous story. ″He should be home resting now, she thought, preparing to start his second job as a night janitor at Medgar Evers College.″ But when she tries to call him she finds the number unlisted as in the previous chapter it is noted \"Gone was the phone number he'd had for the last five years, ever since he'd had a telephone. (He didn't need other women calling him now.)\" because of the arrival of his wife. Nadine is very secluded, most of the story is about her unborn, aborted child. A shrine has been constructed for this child that is described in much detail. She is estranged from her family, lover, and country. She has a very quietly tortured soul. The Book of Miracles: Narrated by Ka's mother, The Book of Miracles chronicles the family's car trip through NYC to get to Christmas-Eve mass and their run-in with a look-a-like of Haitian criminal Emmanuel Constant. Ka's \"Manman,\" Anne, is very faithful and struggles with her daughter's flippant demeanor and typical teenage angst. \"What if it were Constant? What would she do? Would she spit in his face or embrace him, acknowledging a kinship of shame and guilt that she'd inherited by marrying her husband?\" The potential presence of Constant coupled with the religious setting brings to light Anne's own guilt and fear of living a lie, both with her relationship with her daughter and as a member of the Haitian community in NYC. Night Talkers: It's quickly established we're talking again about one of the men of the basement, Dany. Dany has traveled back to Haiti to visit his aunt Estina Esteme. He tells his aunt that it is his landlord who he recognized to have killed his parents, who is also the father of Ka. Then Claude appears. Claude is also from NY but has been exiled back to Haiti for killing his father in a rage. Claude contracts to Dany is a rough way. Dany has traveled so far because he's found the murderer of his parents, only to find Claude, accepted into the community he stills feels so to be much a part of him. Claude, the man who murdered his own father. The Bridal Seamstress: The story of the magazine intern Aline Cajuste and Beatrice Saint Forte the bridal seamstress. Beatrice is not very compliant with Aline's attempts to guide or even start the interview. But Aline is not made for this job and is sympathetic and swayed by the person Beatrice is. Beatrice offers advice, saying things like, ″Everything happens when it's meant to happen.″ Beatrice takes Aline for a walk, motioning to houses, all her neighbors from different places in the world and she ends on the Haitian prison guard. Not the barber he's become, but the prison guard he was. She says, ″I knew him in Haiti.″ And then after some small talk Beatrice openly expands into the story of the prison guard she knew it Haiti. She explains the term, chouket lawoze, Danticat's settled on the translation Dew Breaker. Beatrice goes on to show her whipped feet. Aline's undecided whether the woman is even sane, but in the end sees sense in her and returns to sit by her side, to watch the leaves fall. Monkey Tails: This is the most detailed retelling of life on the ground in Haiti during Jean-Claude Duvalier's regime. It recounts the president and his wife on television, the regular radio addresses, and the exile of Baby Doc. This story also gives an idea of familial relations, the broken families living next door to each other, and never openly acknowledging their illegitimate relations. It features a young Michael, one of the men from the basement. The Funeral Singer: This is the story of three Haitian women trying to make it through a diploma class in America. The story falls backs on their pasts and futures. One of the women Mariselle may have been a victim of Ka's father, as her husband \"had painted an unflattering portrait of the president...He was shot leaving the show.\" Also the teacher June, may be the patient of Nadine in the 'Water Child' who lost her voice due to laryngectomies and had to go a speech therapist, for when teaching \"Her voice hisses, but is flat, never rising or falling.\" The Dew Breaker: This uniting end story clarifies the story of Ka's father, and his relationship with his wife. The relationship is a very strange on that echos back to themes of the book about family and redemption. Anne's husband is also the murderer of her brother the priest which makes the situation epically poignant. Danticat never seems to allow the reader to have any room for comfort. She doesn't let us off with anything. Nothing is easily answered, or explained. It's unbelievable and completely possible that Anne could forgive this. It's as big a question as the redemption of a murderer, no matter how corrected he's become."
}