{
    "book_id": "2306716",
    "mid": "/m/072l3n",
    "title": "Tom Clancy's Splinter Cell: Operation Barracuda",
    "author": "David Michaels",
    "publication_date": "2005-11-01",
    "genres": [
        "Spy fiction"
    ],
    "text": " Taking place almost a year after the first novel, the plot picks up with Third Echelon attempting to search and bring to justice the members of The Shop, an international arms dealing ring that played a large part in the first novel. While Sam Fisher is working to collect information on The Shop in Ukraine and Russia, Third Echelon is continuing its investigation into how the Shop had previously managed to gain the identity of a number of Splinter Cells and murder them, another plot element from the first book. However, when a German scientist named Jeinsen, who had defected to the United States from East Germany long ago, goes missing and then reappears dead in Hong Kong, heads begin to turn. Jeinsen had developed a new submarine vehicle for the United States Navy, that could theoretically carry a nuclear weapon. Sam Fisher is sent to learn why the scientist was in Hong Kong and who killed him; it is suspected that a local group of Triads named the Lucky Dragons had involvement. What Third Echelon does not yet realize is that Jeinsen, the Lucky Dragons, The Shop, and a traitor inside their own government are all part of a much larger picture involving a rogue Chinese general named Lan Tun, with ambitions to invade and conquer Taiwan. With Sam Fisher not even aware that he is the world's only hope of stopping an international crisis, he has to balance his job and a new romantic relationship with his Krav Maga instructor Katia Loenstern. Despite Sam's best efforts, Katia is killed by a Russian Mafiya sniper hired by The Shop to assassinate Sam Fisher. Ultimately, General Tun threatens to use the submarine vehicle to detonate an MRUUV (a very deadly nuclear bomb) off the coast of California, destroying LA with a massive tsunami, unless America abandons Taiwan when it is invaded by China. Fisher manages to foil the plot, and all the conspirators involved including the traitor, the general, and the Shop are viciously gunned down. The attack on Taiwan is a failure, as the Taiwanese military, with backup from the United States Navy, fends off the invading forces in a matter of hours."
}