{
    "book_id": "8779630",
    "mid": "/m/027jg6s",
    "title": "Troy: Fall of Kings",
    "author": "",
    "publication_date": "",
    "genres": [
        "Fantasy"
    ],
    "text": " As the book opens, Agamemnon and his fleet is anchored within sight of the burning Dardanos. Then Aeneas, known as Helikaon, appears in his ship, the Xanthos. He sets fire to the whole fleet. In Troy, meanwhile, the situation is grim. Priam is slowly losing his mind. His sons and generals attempt to plan the defence of the city. Kassandra (Cassandra) must travel to the isle of Thera with Andromache, wife of Hektor. Andromache and Kassandra board the Xanthos, which will go first to Thera, and then to Aeneas's colony far away in the Seven Hills (that is, Rome) for necessary supplies of tin. Aeneas's best friend Gershom is troubled by prophecies about himself Kassandra has told him. Gershom is, in fact, the fugitive Egyptian prince, Ahmose (Moses). On the journey, Helikaon and Andromache become lovers. Helikaon does not know that she has already borne him a son, passed off as the son of Hektor. When they reach Thera and Kassandra leaves them, Gershom sees a ship from Egypt and knows that he must leave Helikaon and sail to Egypt to face his destiny as Moses. Meanwhile, the Trojan captains Banokles and Kalliades realise that Troy is about to face an unexpected attack. They hurry back from Dardanos, too late: Paris and Helen are dead and the city is in danger. Odysseus, the reluctant ally of Agamemnon, forms a plan which enables the attackers to capture the plain outside Troy, and the lower part of the city itself. The Xanthos arrives and delivers Andromache and the tin, then escapes with the Trojan fleet, burning and sinking fifty-seven enemy ships as they do so. Hektor and the Trojan Horse leave the city to endure the siege. Hektor kills Patroklos, the friend of Achilles. Odysseus, once a friend of Hektor, carries to him an offer from Agamemnon and Achilles: all the women and children except for the royal family will get to leave Troy and the siege if Hektor fights Achilles. The fight is a trick: Agamemnon wants both dead. His agent poisons Hektor's blade, so Achilles starts dying. A mob attacks Hektor for his supposed treachery, but he fights them off with the aid of Achilles. Odysseus exposes the plot and Agamemnon's agent too late: both heroes die. Odysseus and his friend Nestor refuse to remain under such a treacherous leader as Agamemnon, and abandon the siege, along with the Myrmidons. Agamemnon decides that it is time to use one of Odysseus's plans to gain access to the city. Skorpios, one of Hektor's Trojan Horse, wakes up, having been knocked unconscious. He discovers that many of his comrades are dead and that the rest have fled. Their armour has all been stripped. Finding a horse, Skorpios rides off in the direction of Troy. On the walls of Troy, the defenders can see fifty of the Trojan Horse, chased by two hundred of Agamemnon's soldiers. The Trojan Horse are headed for the gates. The Trojans open the gates and let the Trojan Horse in. However, Kalliades realises too late that it is a trap - they are not Trojan Horse, merely disguised as them. The fifty open the gates from the inside and breach the city. Banokles and Kalliades fall back to the palace, leading the last remnants of resistance as Priam is killed. They know that Andromache and the two boys in her care - her son to Helikaon Astyanax and Helikaon's wife's son Dex - must escape. Helikaon arrives and starts climbing into Troy by the north wall. Andromache catches his rope and he climbs in. Helikaon and Kalliades help Andromache carry the two boys out of the window and onto the ground, but before they can climb back in to their deaths Banokles cuts the rope. Banokles is soon the sole defender of Troy, and falls at last. However, before Agamemnon can celebrate the victory he is driven out of the city by the Hittite emperor, who is angry at the fall of Troy. Troy's treasury was utterly spent, but Agamemnon believes Helikaon to have taken it to Thera. Skorpios joins Helikaon's band, and they sail to Thera on the Xanthos. There they meet Odysseus, and Kalliades and Skorpios join him. The two ships part. Agamemnon lands on Thera and interrogates Kassandra. Then Thera's volcano erupts, killing them both and everybody else on the island. The Xanthos survives a series of tsunamis, but the fate of Odysseus's ship is unknown. Banokles's sacrifice and the tale of the Odyssey suggest that at least Kalliades and Odysseus survive. The book ends with an elderly Andromache, Dex, Astyanax and her grandson Dios. Andromache lights Helikaons funeral pyre, the Xanthos, and watches the boat drift into the west. The book was finished by David Gemmell's wife, Stella, after David's death: Interview with Stella in The Times it:La caduta dei re pl:Troja: Upadek Królów"
}