{
    "book_id": "14368738",
    "mid": "/m/03d1tmr",
    "title": "Trullion: Alastor 2262",
    "author": "Jack Vance",
    "publication_date": "1973",
    "genres": [
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " Glinnes Hulden returns to Trullion after ten years of service in the Whelm, the Connatic's military force. Glinnes' older brother Shira is missing, so being an hour older than his sullen twin brother Glay, he finds himself the owner of the family holdings. However, while he was away, Glay had sold a choice island to an off-worlder, Lute Casagave. Glinnes wants the land back, but cannot come up with the 12,000 ozols, since Glay had already spent the proceeds. After an argument, Glay moves out. His mother also leaves, to go live with Akadie, a professional consultant and mentor. Glinnes evicts a Trevanyi family invited by Glay to camp on Hulden land. Later, they take revenge by ambushing him, robbing him of his life savings and leaving him unconscious for the merlings to kill. Fortunately, he wakes up before that can happen. Glinnes learns that the local, somewhat-impoverished aristocrat, Lord Gensifer, is recruiting a professional team to play hussade. The object is to grasp the golden ring attached to the clothing of the other team's sheirl, who must be a virgin. A ransom is paid and play resumes, but when a team runs out of funds, the ring is pulled and the sheirl's clothing falls away in full view of the spectators. Seeing an opportunity to earn the ozols he needs, Glinnes joins the \"Gorgons\". However, Gensifer insists on being the team captain. Several matches show that he is exceptionally inept; Glinnes and the rest of the better players quit in disgust. Their last opponent, the \"Tanchineros\", is a team whose strengths match the weaknesses of the Gorgons and vice versa. Glinnes and his fellow Gorgons are recruited, and a strong team is born. Duissane, a member of the Trevanyi family Glinnes evicted, agrees to be their sheirl. The new Tanchineros are successful immediately, winning and playing ever-better teams for more money. Finally, Glinnes half-jokingly challenges Lord Gensifer to a match. Surprisingly, Gensifer accepts. Gensifer unveils a whole new team for the match, an excellent touring team from off-world, but the Tanchineros are prepared. The teams are evenly matched, except in one respect: in his vanity, Gensifer has taken over as captain. The Tanchineros take advantage of this weakness. However, as Glinnes is grasping the opposing sheirl's gold ring for the final time, a notorious starmenter (space pirate) named Sagmondo Bandolio seizes the stadium and kidnaps three hundred of the wealthiest spectators for ransom, as well as several hundred women for other, darker purposes. Glinnes escapes with both sheirls. They hide out on a deserted island. One sheirl is grateful for her rescue, but Duissane is disgusted and leaves in the boat. The remaining sheirl suggests that perhaps Duissane is in love with Glinnes. When they are finally rescued, Glinnes learns that Akadie has been assigned to collect the enormous ransom demanded. Glinnes reluctantly agrees to hold onto it when Akadie fears being robbed. Duissane spends the night with Glinnes, believing that he will steal the money and take her off-world to live a life of luxury. However, Glinnes had, out of curiosity, already opened the package and found worthless papers inside; Akadie had apparently used him as a decoy. Duissane leaves, extremely distraught by this revelation. After she has gone, Glinnes notices that the ransom was actually hidden under the papers. Akadie picks up the money and gives it to Bandolio's man. Shortly afterwards, the Whelm finds Bandolio's hideout and captures him, but the ransom is not found and many suspect that Akadie still has it. Glinnes, through diligent investigation, finds the money in a locker. The courier was killed before he could deliver it, apparently by the inside man who arranged the mass kidnapping with Bandolio. Glinnes also deduces the identity of Bandolio's partner. Rhyl Shermatz, a self-styled \"wandering journalist,\" turns out to be an important government official. Glinnes convinces him to bring Bandolio to Lord Gensifer's wedding to Duissane. While there, he encounters Lute Casagave. When Bandolio gleefully identifies him as a retired, rival starmenter, Glinnes unexpectedly gets back his island. However, he is not the man Glinnes came to unmask. That turns out to be the groom. Gensifer flees, but tumbles into the water and falls victim to the merlings. Shermatz (in reality the Connatic) strongly suspects that Glinnes has the ransom, but has no strong motivation to pursue the issue. Everyone else believes the money is lost for good. Duissane, her plans derailed once again, wanders away disconsolate. Glinnes follows her."
}