{
    "book_id": "4451267",
    "mid": "/m/0c34ct",
    "title": "Twilight",
    "author": "Stephenie Meyer",
    "publication_date": "2005-10-05",
    "genres": [
        "Vampire fiction",
        "Horror",
        "Speculative fiction",
        "Young adult literature",
        "Romance novel",
        "Fantasy",
        "Fiction"
    ],
    "text": " Isabella \"Bella\" Swan moves from sunny Phoenix, Arizona to rainy Forks, Washington to live with her father, Charlie, while her mother, Renée, travels with her new husband, Phil Dwyer, a minor league baseball player. Bella attracts much attention at her new school and is quickly befriended by several students. Much to her dismay, several boys compete for shy Bella's attention. When Bella is seated next to Edward Cullen in class on her first day of school, Edward seems utterly repulsed by her. He disappears for a few days, but warms up to Bella upon his return; their newfound relationship reaches a climax when Bella is nearly crushed by a classmate's van in the school parking lot. Edward saves Bella when he instantaneously appears next to her and stops the van with his bare hands. Bella becomes determined to discover how Edward saved her life, and constantly pesters him with questions. After a family friend, Jacob Black, tells her the local tribal legends, Bella concludes that Edward and his family are vampires who drink animal blood rather than human. Edward confesses that he initially avoided Bella because the scent of her blood was too desirable to him. Over time, Edward and Bella fall in love. Their relationship is affected when a nomadic vampire coven arrives in Forks. James, a tracker vampire who is intrigued by the Cullens' relationship with a human, wants to hunt Bella for sport. The Cullens attempt to distract James by separating Bella and Edward, and send Bella to hide in a hotel in Phoenix. There, Bella receives a phone call from James, who claims to be holding her mother captive. When Bella surrenders herself, James attacks her. Before James can kill her, Edward, along with the other Cullens, rescues her and destroy James, but not before James bites Bella's hand. Edward successfully sucks the poison from her bloodstream and prevents her from becoming a vampire, after which she is taken to a hospital. Upon returning to Forks, Bella and Edward attend their school prom, and Bella expresses her desire to become a vampire, but Edward refuses."
}