{
    "book_id": "1055983",
    "mid": "/m/0424c5",
    "title": "Under the Banner of Heaven: A Story of Violent Faith",
    "author": "Jon Krakauer",
    "publication_date": "2003",
    "genres": [
        "Non-fiction"
    ],
    "text": " The book opens with news accounts of the 1984 murder of Brenda Lafferty and her infant daughter Erica. Brenda was married to the youngest Lafferty brother, Allen; older brothers Dan and Ron targeted their sister-in-law because they believed she was the reason Ron's wife left him (after refusing to allow him to marry a plural/second wife). Both men's extremism reached new heights when they became members of the School of the Prophets founded and led by Robert Crossfield. After joining the school, Ron claimed that God had sent him revelations - communication with God is a core belief of fundamentalist Mormonism as well as mainstream Mormonism . Ron showed the members of the School of Prophets a written \"removal revelation\" that allegedly called for the killing of Brenda and her baby. After other members of the school failed to honor Ron's removal revelation, the brothers quit the school. The murders were particularly cruel, with Dan claiming that he slit the victims' throats. However, at trial, Chip Carnes, who was riding in the get-away car, testified that Ron said he had killed Brenda and that Ron also thanked his brother for \"doing the baby.\" After the murders, the police found the written \"revelation\" concerning Brenda and Erica. After the press widely reported that Ron had received a revelation to kill Brenda and Erica, the Lafferty brothers conducted a recorded press conference at which Ron pointed out that the \"revelation\" was not addressed to him, but to \"Todd\" [a drifter whom Ron had befriended while working in Wichita, Kansas] and that the revelation called only for \"removal\" of Brenda and her baby and did not use the word, \"kill.\" These remarks of Ron denying he had received a revelation to kill Brenda and Erica were shown to the jury at Ron's trial. After opening with the Lafferty case, Krakauer goes into the history of Mormonism, starting with the early life of Mormon founder and prophet Joseph Smith, following his life from a criminal fraud trial to leading the first followers to Jackson County, Missouri and Nauvoo, Illinois. While violence seemed to follow the Mormons wherever they went, it wasn't necessarily the Mormons' doing, as Krakauer points out. Early Mormons faced severe religious persecution, due to their unorthodox beliefs, including polygamy, and their tendency to deal economically and personally only with other Mormons. This led to violent clashes between Mormons and non-Mormons, culminating in Smith's death on June 27, 1844 at the hands of a mob while he was jailed in Carthage, Illinois, awaiting trial for destroying the printing press of a local publication that painted him in a negative light. From Nauvoo, the Mormons trekked westward to modern-day Utah, led (after some controversy) by Smith's successor Brigham Young. Arriving in what they called Deseret, many Mormons believed they would be left alone by the federal government, as the territory was under Mexican rule at the time. This hope died soon after their arrival, when the Treaty of Guadalupe Hidalgo was signed on February 2, 1848, ending the Mexican-American War and ceding the land to the United States. Mormonism's problems weren't all external, as Smith's highly controversial revelation of plural marriage threatened to tear the faith in two. The Utah territory was a theocracy ruled by self-appointed governor, Brigham Young and was denied statehood for 50 years due to the practice of polygamy. Finally, on September 23, 1890 Wilford Woodruff, the fourth president of the Church of Jesus Christ of Latter Day Saints officially banned the practice of polygamy after having received a revelation (visit) from God denouncing polygamy and Utah was granted statehood, in spite of the fact that polygamy remained to be a secret practice until the early 1900s. After the Woodruff \"revelation,\" some members broke away from the mainstream church to form what eventually became the Fundamentalist Church of Jesus Christ of Latter Day Saints (FLDS), the most popular group of fundamentalist Mormonism. The FLDS church allows — even encourages — polygamy. Constantly comparing the mainstream and fundamentalist forms of Mormonism, Krakauer examines events in the LDS history and compares them to modern day FLDS doctrine (or even less mainstream versions of Mormonism, such as the Crossfield School of the Prophets). One of these events is the Mountain Meadows massacre, in which Mormons, allegedly with the help of local Paiute Indians, rounded up the Baker-Fancher party of emigrants from Arkansas heading to California and murdered approximately 120 of them. While the Mormons went to great lengths to conceal any involvement in the massacre (including dressing as Paiute Indians and painting their faces in similar fashion), the only person successfully convicted in the affair was John D. Lee, a member of the LDS Church who was executed by the state in 1877 for his role in the crime. The book cites information gleaned from several interviews with Dan Lafferty and former and current members of the Crossfield School of the Prophets, as well as other fundamentalist Mormons. It also pulls from several books about the formation of Mormonism to tie the origins of the religion to the modern iterations of both The Church and the fundamentalists."
}