{
    "book_id": "852896",
    "mid": "/m/03h9ct",
    "title": "Understanding Media: The Extensions of Man",
    "author": "Marshall McLuhan",
    "publication_date": "1964",
    "genres": [
        "Non-fiction"
    ],
    "text": " In Part One, McLuhan discusses the differences between hot and cool media and the ways that one medium translates the content of another medium. Briefly, \"the content of a medium is always another medium.\" In Part Two, McLuhan analyzes each medium (circa 1964) in a manner that exposes the form, rather than the content of each medium. In order, McLuhan covers The Spoken Word, The Written Word (as in a manuscript or incunabulum), Roads and Paper Routes, Numbers, Clothing, Housing, Money, Clocks, The Print (as in pictorial lithograph or woodcut), Comics, The Printed Word (as in Typography), Wheel, Bicycle and Airplane, The Photograph, The Press, Motorcar, Ads, Games, Telegraph, The Typewriter, The Telephone, The Phonograph, Movies, Radio, Television, Weapons, and Automation. Throughout Understanding Media: The Extensions of Man, McLuhan uses historical quotes and anecdotes to probe the ways in which new forms of media change the perceptions of societies, with specific focus on the effects of each medium as opposed to the content that is transmitted by each medium. McLuhan identified two types of media: \"hot\" media and \"cool\" media. This terminology does not refer to the temperature or emotional intensity, nor some kind of classification, but to the degree of participation. Cool media are those that require high participation from users, due to their low definition (the receiver/user must fill in missing information). Since many senses may be used, they foster detachment. Conversely, hot media are low in audience participation due to their high resolution or definition. Film, for example, is defined as a hot medium, since in the context of a dark movie theater, the viewer is completely captivated, and one primary sense -- visual -- is filled in high definition. In contrast, television is a cool medium, since it many other things may be going on and the viewer has to integrate all of the sounds and sights in the context."
}