{
    "book_id": "14079779",
    "mid": "/m/03csxgj",
    "title": "Vampire Hunter D: Mysterious Journey to the North Sea",
    "author": "Hideyuki Kikuchi",
    "publication_date": "1988-10-31",
    "genres": [
        "Light novel",
        "Fantasy",
        "Science Fiction"
    ],
    "text": " The 17-year-old Wu-Lin is traveling from the fishing village of Florence to Cronenberg to have a strange jewel appraised. No less than three people try to steal it from her: the young commoner Toto, an old artist named Professor Krolock, and the grotesque Gilligan, an obscenely overweight gangland boss in a custom exo-skeleton. He has Wu-Lin killed, but her dying request of D is that he bring the gem back to her older sister Su-In in their village on the north sea. Gilligan is determined to have the gem. He dispatches five mysterious individuals with the promise that the one who brings it to him will get all he possesses. This group consists of such colorful characters as Shin the Puppetman, King Egbert, Undiscernible Twin, and Reminiscence Samon. Also tailing D from Cronenberg is handsome Glen, a warrior and \"seeker of knowledge\" who wants to kill the Vampire Hunter because he's the only thing he has ever feared. Everyone arrives in Florence just as its short, week-long summer is about to begin. Millennia ago, the area had been a resort for the Nobility until the day, about 1000 years ago, when a traveler in black arrived and punished the cruel vampire residents. Only Baron Meinster refused to leave, and the traveler threw him into the sea. Now, for the past few years, the village's summer has been marred by vampire attacks -- \"Meinster's Revenge.\" Su-In hired D because something particularly distressing is going on here. Though the whole world knows that the Nobility have difficulty with rain or flowing water, the vampire in Florence seems to be coming from the sea. As the plot thickens, the five mercenaries hired by Gilligan resort to betraying each other and using dirty tactics to subdue D. Glen is able to dominate Simon into a love-hate-love relationship which leads to him becoming a noble, a desperate act following a near death at the hands of a jealous King Egbert. Throughout the second half of the story, the bead is lost and claimed by numerous characters, finally falling into the hands of Dr. Krolock himself. The Doctor is able to crack the secret of the jewel and obtains Nobility like status, but is easily felled by D's blade. Everything comes to a head when Glen is finally defeated by D and Meinster's abilities are revealed. Four summers ago, Su-in met a man who she fell in love with, but when he tried to make her commit a terrible deed, she killed him. His body was dumped into the sea, where it became the vessel for the defeated Noble, this resulted in \"Meinster\" having no recollection of his 'true' self. In the end, D prevails and Su-in returns to her happy life as a teacher for the village's children, with help from her friend Dwight and a reformed Toto. The latter of which who claims to have seen the Hunter smile before departing. In the close of the story, Samon confronts D. Wounded and near death, she is promptly defeated by the Vampire Hunter known as D."
}