{
    "book_id": "17619103",
    "mid": "/m/0463mvt",
    "title": "War Before Civilization: The Myth of the Peaceful Savage",
    "author": "Lawrence H. Keeley",
    "publication_date": "1996",
    "genres": [
        "Non-fiction"
    ],
    "text": " Keeley conducts an investigation of the archaeological evidence for prehistoric violence, including murder and massacre as well as war. He also looks at nonstate societies of more recent times — where we can name the tribes and peoples — and their propensity for warfare. It has long been known, for example, that many tribes of South America's tropical forest engaged in frequent and horrific warfare, but some scholars have attributed their addiction to violence to baneful Western influences. Keeley says peaceful societies are an exception. About 90-95% of known societies engage in war. Those that did not are almost universally either isolated nomadic groups (for whom flight is an option), groups of defeated refugees, or small enclaves under the protection of a larger modern state. The attrition rate of numerous close-quarter clashes, which characterize warfare in tribal warrior society, produces casualty rates of up to 60%, compared to 1% of the combatants as is typical in modern warfare. Despite the undeniable carnage and effectiveness of modern warfare, the evidence shows that tribal warfare is on average 20 times more deadly than 20th century warfare, whether calculated as a percentage of total deaths due to war or as average deaths per year from war as a percentage of the total population. \"Had the same casualty rate been suffered by the population of the twentieth century,\" writes Nicholas Wade, \"its war deaths would have totaled two billion people.\" In modern tribal societies, death rates from war are four to six times the highest death rates in 20th century Germany or Russia. One half of the people found in a Nubian cemetery dating to as early as 12,000 years ago had died of violence. The Yellowknives tribe in Canada was effectively obliterated by massacres committed by Dogrib Indians, and disappeared from history shortly thereafter. Similar massacres occurred among the Eskimos, the Crow Indians, and countless others. These mass killings occurred well before any contact with the West. In Arnhem Land in northern Australia, a study of warfare among the Indigenous Australian Murngin people in the late-19th century found that over a 20-year period no less than 200 out of 800 men, or 25% of all adult males, had been killed in intertribal warfare. The accounts of missionaries to the area in the borderlands between Brazil and Venezuela have recounted constant infighting in the Yanomami tribes for women or prestige, and evidence of continuous warfare for the enslavement of neighboring tribes such as the Macu before the arrival of European settlers and government. More than a third of the Yanomamo males, on average, died from warfare. According to Keeley, among the indigenous peoples of the Americas, only 13% did not engage in wars with their neighbors at least once per year. The natives' pre-Columbian ancient practice of using human scalps as trophies is well documented. Iroquois routinely slowly tortured to death and cannibalized captured enemy warriors. See Captives in American Indian Wars. In some regions of the American Southwest, the violent destruction of prehistoric settlements is well documented and during some periods was even common. For example, the large pueblo at Sand Canyon in Colorado, although protected by a defensive wall, was almost entirely burned; artifacts in the rooms had been deliberately smashed; and bodies of some victims were left lying on the floors. After this catastrophe in the late thirteenth century, the pueblo was never reoccupied. For example, at Crow Creek in South Dakota, archaeologists found a mass grave containing the remains of more than 500 men, women, and children who had been slaughtered, scalped, and mutilated during an attack on their village a century and a half before Columbus's arrival (ca. A.D. 1325). The Crow Creek massacre seems to have occurred just when the village's fortifications were being rebuilt. All the houses were burned, and most of the inhabitants were murdered. This death toll represented more than 60% of the village's population, estimated from the number of houses to have been about 800. The survivors appear to have been primarily young women, as their skeletons are underrepresented among the bones; if so, they were probably taken away as captives. Certainly, the site was deserted for some time after the attack because the bodies evidently remained exposed to scavenging animals for a few weeks before burial. In other words, this whole village was annihilated in a single attack and never reoccupied. He makes three conclusions which the New York Times considers unexpected: *that the most important part of any society, even the most war-like ones, are the peaceful aspects such as art *that neither frequency nor intensity of war is correlated with population density *that societies frequently trading with one another fight more wars with one another"
}