{
    "book_id": "2023770",
    "mid": "/m/06fwtr",
    "title": "Warcraft: Day of the Dragon",
    "author": "Richard A. Knaak",
    "publication_date": "2001-02",
    "genres": [
        "Speculative fiction",
        "Fantasy"
    ],
    "text": " Set after Warcraft II: Tides of Darkness but before Warcraft III: Reign of Chaos, Day of the Dragon is the story of how a human Mage, Rhonin ventures into the last remaining Orc-controlled lands in Khaz Modan by the order of Krasus. Krasus is actually a red dragon named Korialstrasz, yet is disguised as a human mage of Dalaran during the earlier chapters of the book. He is loyal to his captured queen, Alexstrasza, Queen of the Red dragon flight and one of the five great Aspects. By using the \"Demon Soul\", Nekros Skullcrusher, leader of the orcs in Khaz Modan, is able to hold Alexstrasza and her consorts, such as Tyranastrasz, against their will and use their offspring as pawns against the other races of Azeroth. Whilst Korialstrasz sought help from the other Aspects, Nozdormu, Malygos and Ysera, Deathwing helped Rhonin get into the Orc Fortress in order to convince Nekros Skullcrusher that there was an imminent Alliance attack on Grim Batol. Deathwing's real motivation was that he wanted the eggs so he could replenish his flight, not to free the Red Dragonqueen. Believing a great army to be on its way, Nekros had the eggs transported elsewhere, placing them in the open where Deathwing wanted them. However, as Deathwing was stealing the eggs, he was confronted by a dying Tyranastrasz. Despite initial problems, Korialstrasz managed to gain the aid of the other three Great Aspects in his task to free Alexstrasza. With the help of Rhonin, Vereesa Windrunner, Falstad Dragonreaver (Falstad Wildhammer), and a number of dwarven resistance fighters, the group managed to destroy the \"Demon Soul\" forever. By doing so, they free Alexstrasza, who swallows Nekros Skullcrusher in one gulp, aiding in the defeat of the orcs in the area. Ironically, Deathwing helped with the release of Alexstrasza, yet was not concerned due to the fact that the \"Demon Soul\" has drained the other Aspects powers. However, with the destruction of the \"Demon Soul\" the powers were returned to the four Aspects and Deathwing was last seen fleeing from three angry Aspects at the time as Alexstrasza went to Korialstrasz. The storyline also covers Deathwing's plot to throw the mortal kingdoms into disarray by posing as Lord Prestor, using his draconic powers to manipulate the rulers of the human kingdoms into making him king of Alterac, then planning to marry into the Lordaeron royal family to become its heir. However, with his defeat at the hands of the other four Dragon Aspects, Lord Prestor is never seen again."
}