{
    "book_id": "2023763",
    "mid": "/m/06fws9",
    "title": "Warcraft: Lord of the Clans",
    "author": "Christie Golden",
    "publication_date": "2001-10-01",
    "genres": [
        "Fantasy",
        "Fiction"
    ],
    "text": " The book's plot revolves around Thrall's journey from birth, to slavery as a gladiator and finally his path on the journey to becoming Warchief of the orcish Horde. The main villain of the book is Aedelas Blackmoore, who commands the encampments where the orcs were imprisoned, and also Thrall's (thrall means slave to humans) former owner. Blackmoore's plans were to raise Thrall to command an orcish army to overrun the Alliance, allowing him to forcibly take the position of King. Thrall was trained to handle every weapon and learned battle tactics, but also studied basic writing and history. Also, to enrich Blackmoore further, Thrall was forced to compete in many gladiator tournaments, which made him want to escape even more. Thrall eventually escapes Blackmoore's tyranny with the help of a young human girl named Taretha. During his captivity, she would sneak notes to Thrall and was one of his only friends while in the grasp of Blackmoore. After earning his freedom thanks to Taretha, Thrall set out to find a group of orcs that had evaded Blackmoore. He found these orcs to be those of the Warsong Clan, led by Grom Hellscream. After learning some of his history from Grom, Thrall then headed for the mountains of Alterac to find his original clan, the Frostwolf Clan. There he met with their Shaman, Drek'Thar, who taught Thrall the ancient ways of Shamanism. There he also met with the Warchief Orgrim Doomhammer and learned more of his past and the reasons for his parents' death. With his new power, and knowledge provided by both Drek'Thar and Doomhammer, Thrall raised an army by freeing his people from the prison encampments, rallying them under the goal of freedom and a return to the orcish life before the war. Unfortunately, Doomhammer fell in a battle liberating one of the encampments, so in his final moments, he granted Thrall the title of Warchief. Thrall then decided to attack the fortress of Durnholde, home of Aedelas Blackmoore, his former captor, to free all the remaining entrapped Orcs at once by cutting off any more reinforcements. He succeeds in taking Durnholde fortress, killing Blackmoore with the help of the elements and of course, his Orcish army. Tragically however, he is too late to save the one human who had helped him during his captivity. At the end of the book, Thrall crushes Durnholde with his elemental powers, then addresses the Horde, promising they will succeed under his leadership."
}