{
    "book_id": "2490135",
    "mid": "/m/07hjw8",
    "title": "When the Wind Blows",
    "author": "Raymond Briggs",
    "publication_date": "1982",
    "genres": [
        "Fiction",
        "Graphic novel",
        "Anti-nuclear"
    ],
    "text": " The book follows the story of the Bloggses, characters previously seen in the book Gentleman Jim. One afternoon the couple hears a message on the radio about an \"outbreak of hostilities\" in three day's time. Jim immediately starts construction of a fallout shelter (according to a protect and survive brochure), while the two reminisce about the Second World War. Their reminiscences are used both for comic effect and to show how the geopolitical situation has changed, but also how nostalgia has blotted out the horrors of war. A constant theme is Jim's optimistic outlook and his unshakeable belief that the government knows what's best and that it has the situation under full control, coupled with Hilda's attempts to carry on life as normal. The Bloggses soon hear of enemy missiles heading towards England, and they just make it into their shelter before a nuclear explosion. They stay in it for several days, misreading the advice given in governmental leaflets: they believe they have to stay in the shelter for two weeks instead of two days. They do briefly go outside to get some fresh air and rainwater, exposing themselves to a large amount of radioactive fallout. They also, unknowingly, smell the burning corpses of their neighbours. Jim and Hilda exhibit considerable confusion regarding the serious nature of what has happened after the nuclear attack; this generates gentle comedy as well as darker elements: amongst them, their obliviousness of the fact that they are probably the only people left of their acquaintance. As the novel progresses, their situation becomes steadily more hopeless as they begin to suffer the effects of radiation sickness. Hilda suffers the most, losing her hair, vomiting and has bleeding gums. Both of them come out in great purple blotches but mistake them for varicose veins. The book ends on an extremely bleak note, with them praying in their fallout shelter as almost certain death approaches."
}