{
    "book_id": "4421036",
    "mid": "/m/0c1c_g",
    "title": "Wing Commander: False Colors",
    "author": "Andrew Keith",
    "publication_date": "1998-12-01",
    "genres": [
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " The opening chapter centers on Commander Donald Graham, Chief Engineer of a Confederation cruiser, the TCS Juneau. She and her sister ship, the TCS Dover, are hotly engaged with the Kilrathi carrier KIS Karga, a Bhantkara-class super-carrier, whose group has launched a retaliatory strike against the Landreich. The Colonials and \"Confees\" together have succeeded in destroying most of the battle group, with the Karga retreating towards a backwater star system called Vaku, where the Juneau and Dover catch her. The Dover is lost and the Juneau crippled in weapons and engines, but the Karga is doomed: her shields are knocked out, consigning her crew to death from the Vaku system's bizarre high-level radiation. Admiral Largka Cakg dai Nokhtak of the Karga activates his ship's self-destruct and gives orders to ram the Juneau, hoping for an honorable end. The Juneau is crushed, with her surviving crew evacuating, but the Karga's main computer suffers a massive failure. The Kilrathi survivors commit zu'kara (ritual suicide), save a small team of specialists whom the Admiral evacuates aboard the only available shuttle. Murragh Cakg dai Nokhtak, nephew of the Admiral, is assigned as the group's leader. In the end both groups of survivors head for the only habitable planet of the Vaku system... Back on Earth, Jason \"Bear\" Bondarevsky, now a retired Commodore of the Terran Confederation Navy, is waiting for an upcoming meeting with Admiral Vance Richards, a well known Confederation Intelligence officer who has recently joined the ranks of the Free Republic of Landreich Navy. He is meeting with Richards to join the Landreich himself. In the company of Richards, Janet \"Sparks\" McCullough, who has faithfully taken care of Bondarevsky while he recuperated from the wounds suffered when the TCS Coventry was hit during the Behemoth mission, and a young Landreich officer by the name of Aengus Harper, Bondarevsky embarks for his new assignment with the FRLN. Along the way they are joined by Admiral Geoffrey Tolwyn who also accepts to serve for the FRLN, albeit he is not fully committing to the Landreich, preferring to remain a Confederation officer. Once the group reaches the capital of the Landreich, they are welcomed by President Max Kruger who wastes no time in enlisting the former Confed officers into a secret effort he has nicknamed \"Project Goliath.\" Tensions are growing between the Landreich and the nearest Kilrathi province, whose governor, Ukar dai Ragark, seems to be ambitious enough to start a new war against humanity. With this in mind, Kruger wants to salvage the derelict hulk of the KIS Karga, which his forces have recently discovered, and refit it for service in the FRLN. This mission is top secret, as Kruger wants to keep it secret from internal opposition who may hamper his attempt to recover the Karga. The Goliath team leaves for Vaku with the FRLS Independence carrier battle group, escorting a factory ship and a tender that will help salvage the Kilrathi carrier in deep space. On board the Independence Bondarevsky meets his former comrades Etienne \"Doomsday\" Montclair and Kevin \"Lone Wolf\" Tolwyn (the latter being Independence's Wing Commander) and also discovers that Independence is actually the TCS Tarawa, now recommissioned with the FRLN. In Kilrathi space, Ukar dai Ragark is introducing to his brethren the plan for the renewal of the conflict with the humans. He will unleash his fleet against the Landreich and then move to Earth to achieve what Thrakhath never did: destroy the Confederation. To reach this goal, Ragark has a secret weapon of sorts in Captain Dawx Jhorrad and his ship, the powerful dreadnought KIS Vorgath. To complicate matters, Terran \"Peace Commissioner\" Clark Williams is plotting alongside a number of other conspirators to restart the conflict: his \"Belisarius Group\" seeks to gain power through a military coup against the Confed government. They will launch their coup once Belisarius manages to have the Landreich crushed by Ragark's fleet under the civilian government's nose. In the Vaku system, Bondarevsky and the Goliath team investigate the remains of the Karga: the ship is badly damaged and will require a great deal of effort to make space-worthy again. Just as the team discovers some evidence of the battle's survivors, an unidentified ship appears nearby. After a few tense moments, the craft is found to be a Confed shuttle from Juneau, carrying both human and Kilrathi survivors: apparently the two groups managed to cooperate for survival on Vaku's marginally habitable world thanks to the efforts of their leaders, Commander Graham and Murragh. The survivors alert Bondarevsky that the carrier was rigged for explosion and reactivating the ship's computer will likely restart the self-destruct sequence; this convinces Richards and Bondarevsky to scrap the whole refit operation. Admiral Tolwyn doesn't agree and has Kruger back him up, ordering the Karga refitted, no matter the danger. Bondarevsky confronts his old mentor who reveals him the reason behind his decisions: shortly after the Battle of Earth he was approached by Belisarius, but declined to join their ranks. Instead Tolwyn tried to end the war with the Kilrathi as fast as he could, removing Belisarius's only excuse for conspiracy against the civilian government. Tolwyn believes the refitted Karga they will scare Ragark into behaving, keep the Landreich intact, and ruin Belisarius' plans once more. Bondarevsky is still dubious, but with Murragh's help, the Karga's self-destruct sequence is terminated and the refit begins in earnest. Back on Landreich, Commissioner Williams finds out about the \"Goliath project\" and arranges a raid against the Karga: Zach Banfeld, the leader of the Guild (an association of merchants/pirates), will attack with his makeshift carrier and fighter squadron. They will only disable the tender that provides shielding for the Kilrathi derelict, however, meaning Vaku's radiation, not human hands, will bring an end to the Colonials. Confident that Karga's engines are offline, Banfeld mounts an ambush on the carrier. While his forces succeed in destroying the tender, Karga was, by coincidence, testing its combat shields, and its crew is saved. Landreich fighters repel the Guild forces and the refit goes on. Banfeld then decides to travel to Baka Kar, the capital of Ragark's province, to convince the Kilrathi to attack. Once there, however, he notices the dreadnought KIS Vorgath and flees back to Landreich with the Kilrathi in pursuit. He stumbles upon an FRL battle group, which convinces the Kilrathi to retreat. Badly injured, Banfeld still manages to warn Kruger of the threat from the dreadnought. Kruger needs to take the Vorgath out of action, but Ragark is threatening an attack against a distant outpost of the Landreich and Kruger must stay there to meet the Kilrathi armada. In the end it is decide that the newly refitted Karga, now FRLS Mjollnir, disguised as a returning Kilrathi ship, will have to infiltrate Baka Kar, attack and cripple the Vorgath and escape back to Landreich. Under Tolwyn's command, Mjollnir manages to successfully disable the Vorgath and damage the orbital docking station, ruining Ragark's and Belisaruius's plans in one fell swoop. However Mjollnir and its fighter wing are trapped in the system by the return of Ragark's fleet; the Kilrathi despot has returned to investigate rumors about the returning Karga. All seems lost, but at the very last moment Kruger leads the whole FRLN fleet to Baka Kar; outmaneuvered, Ragark is forced to let the humans retreat safely. In the epilogue, Bondarevsky decides to remain in the FRLN aboard Mjollnir while Tolwyn returns to the Confederation after he has been appointed Chief of the \"Strategic Readiness Agency\". The Admiral hints at his secret \"Black Lance\" project, but feels Bondarevsky would not want to be part of it and decides not to tell him the whole truth."
}