{
    "book_id": "182612",
    "mid": "/m/018yts",
    "title": "World on Fire: How Exporting Free Market Democracy Breeds Ethnic Hatred and Global Instability",
    "author": "Amy Chua",
    "publication_date": "2002-12",
    "genres": [
        "Non-fiction"
    ],
    "text": " In the Philippines, Chua explains, the Chinese Filipino is 1% of the population but controls 60% of the economy, with the result being envy and bitterness on the part of the majority against the Chinese minority—in other words, an ethnic conflict. Similarly, in Indonesia the Chinese Indonesians are 3% of the population but control 70% of the economy. There is a similar pattern in other Southeast Asia nations. According to Chua, examples of what she calls ethnic market-dominant minorities include overseas Chinese in Southeast Asia; whites in Latin America; Jews in Russia; Croats in the former Yugoslavia; and Ibos, Kikuyus, Tutsis, Indians and Lebanese, among others, in Africa. In her book, Chua discusses different reasons for the market dominance of different groups. Some groups achieve market dominance because of colonial oppression or apartheid. In other cases, it may be due to the culture and family networks of these groups. For many groups there is no clear single explanation. Americans can also be seen as a global market-dominant minority, in particularly when combined with using military might and flaunting political domination, cause resentment. She believes that democratization can increase ethnic conflicts when an ethnic minority is disproportionately wealthy. \"When free market democracy is pursued in the presence of a market-dominant minority, the almost invariable result is backlash. This backlash typically takes one of three forms. The first is a backlash against markets, targeting the market-dominant minority's wealth. The second is a backlash against democracy by forces favorable to the market-dominant minority. The third is violence, sometimes genocidal, directed against the market-dominant minority itself.\". Also, \"overnight democracy will empower the poor, indigenous majority. What happens is that under those circumstances, democracy doesn't do what we expect it to do – that is, reinforce markets. [Instead,] democracy leads to the emergence of manipulative politicians and demagogues who find that the best way to get votes is by scapegoating the minorities.\" She writes, \"Ballot boxes brought Hitler to power in Germany, Mugabe to power in Zimbabwe, Milosevic to power in Serbia -- and could well bring the likes of Osama bin Laden to power in Saudi Arabia.\" Chua states that she is a \"big fan of trying to promote markets and democracy globally,\" but that it should be accompanied by attempts to \"redistribute the wealth, whether it's property title and giving poor people property, land reform .... Redistributive mechanisms are tough to have if you have so much corruption.\""
}