{
    "book_id": "5754273",
    "mid": "/m/0f2wrs",
    "title": "Worldwar: Tilting the Balance",
    "author": "Harry Turtledove",
    "publication_date": "1995-02-21",
    "genres": [
        "Alternate history",
        "Speculative fiction"
    ],
    "text": " As the year 1943 begins, the Race attempts to consolidate its hold over Latin America, Africa, and Australia while engaged in a fierce struggle with the advanced nations of the world: the United States, the United Kingdom, the Soviet Union, Japan, and the Greater German Reich. While capable of resisting the invaders, mankind has been dealt a heavy blow by the nemesis from the stars. The Race maintains unquestioned air supremacy over the entire world as humans are reduced to moving their ground forces by night and using their own aircraft only in the most dire emergencies. With supplies of petroleum severely limited, people have taken to using horse driven carriages rather than automobiles and kerosene lamps instead of electric lights. But even as the human race huddles in the darkness, physicists and engineers work desperately to develop the first human atom bombs as they represent what might be the only hope of driving the Race off Earth. After a rapid conquest of Spain and the capitulation of Italy, the Race focuses on driving its forces in France eastward, toward the heart of the German Reich. Among the officers of the Wehrmacht struggling desperately to hold back the tide of the alien forces is Colonel Heinrich Jäger. Fresh from his stay in Hitler's Berchtesgaden retreat, Jäger is puzzled by the relationship he has formed with Senior Lieutenant Ludmila Gorbunova, the Ukrainian pilot who flew Soviet Foreign Minister Molotov to Bavaria for a conference with the Führer. He is much enamored with her but wonders if love can develop between two former enemies. Jäger is given command of a panzer regiment near Belfort and is charged with keeping the Race from reaching the Rhine. Although the latest panzer models, the Panther and the Tiger I, give the Germans a fighting chance, they are still woefully inferior to the Race's landcruisers. For their part, the aliens are stunned that humans are capable of designing and deploying new tank models within such a short space of time, as the Race's rate of technological development is centuries slower. Jäger is abruptly pulled out of frontline service and ordered to assist the German atomic bomb program in Wittelsbach. In the United States, Jens Larssen, a physicist, leaves Chicago in search of the metallurgical laboratory which has relocated to Denver. After crossing the Great Lakes, he moves swiftly across Minnesota and the Dakotas. Larssen is not so much driven by the need to hasten atomic bomb development as he is by a desire to be reunited with his wife Barbara. Unfortunately for Jens, under the impression that he is dead, Barbara has started a relationship with Corporal Sam Yeager, a soldier responsible for guarding captured alien POWs. Yeager serves as a translator for the metallurgical lab since he has learned the rudiments of the Race's language. Jens arrives in Denver before the lab and sends a courier out to find Barbara with a message that he remains alive. Barbara learns that her husband is still alive just after revealing to Yeager that she is pregnant. In Illinois, after the successful drive by General Patton that liberated much of the state, the Race begins to advance upon Chicago once more. U.S. soldiers fight valiantly but the flat open country gives the alien landcruisers a decisive advantage. Slowly but surely the Race draws closer and closer toward Lake Michigan. Heinreich Jäger manages to return to the front lines in Belfort after an unproductive stay with German physicists working on atomic research in Wittelsbach. Not long afterward, Wittelsbach is destroyed by an out-of-control nuclear reaction produced by Nazi scientists. The resulting nuclear meltdown alerts the Race to the virtual certainty that Germany is engaged in nuclear research. They are not the only ones. On Stalin's behalf, Foreign Minister Molotov visits a secret research laboratory several miles north of Moscow where Soviet researchers are struggling to turn the sample of plutonium captured by German-Russian forces in Ukraine the year before into an atomic device. They are meeting with minimal success and Molotov attempts to encourage them with threats of torture and death if they fail. His pep talk produces no marked improvement in the advances made by Soviet engineers. In Japan, a captured killercraft pilot of the Race named Teerts is interrogated by Japanese researchers attempting to understand the dynamics of nuclear fission. As a pilot, Teerts has a limited knowledge of atomic weapons, as his job is merely to drop them not build them. The Japanese refuse to believe him and use torture to make Teerts more cooperative. In the United States, the metallurgical laboratory finally reaches Denver and begins working on atomic research. Their work is helped by a small shipment of plutonium that Colonel Leslie Groves brings from Boston, where a British submarine had been entrusted with delivering it to the U.S. government. The plutonium is one-fourth of the material stolen from the Race during the Nazi-Soviet operation in Ukraine. It had come into the possession of the British by way of Jewish partisans who had commandeered a portion of the plutonium consigned to Germany when they briefly held Colonel Jäger in captivity in Poland the previous winter. Unfortunately, the plutonium in question is not enough with which to build an atomic bomb. The metallurgical lab must produce a substantial amount of the precious plutonium before Americans can hope to wield a nuclear device in the war against the Race. Jens Larssen meets with his wife upon her arrival in Denver and learns that she has married and become impregnated by Corporal Sam Yeager. In a difficult decision that leaves everyone emotionally upset, she decides to keep the baby and remain with Yeager. Jens takes the news hard and his work on the atomic bomb project suffers. In order to keep him out of trouble, Colonel Groves orders Larssen to travel to Hanford and consider the possibility of transferring the metallurgical lab there to facilitate the production of plutonium. With an M1903 Springfield rifle slung over his shoulder, Jens heads off to Washington State on a bicycle. Jäger, supervising the efforts to recover plutonium from the melted-down reactor in Wittelsbach, is recruited by SS Standartenführer Otto Skorzeny to help take back the city of Split from the Race, who have been offering the Independent State of Croatia incentives to turn away from the Germans and toward them (and also in an effort to lure Skorzeny into Split to be killed). However, Skorzeny and Jäger, with superior maps, dig a tunnel into the middle of the Race's garrison, and, with numerous Croat soldiers and FG 42 battle rifles (which are superior to the Race's infantry weapons), completely reduce the garrison, and every member of the Race in Split is either killed or taken prisoner. Among the dead is Fleetlord Atvar's chief intelligence officer, Drefsab. As the summer of 1943 begins, the Race creeps closer to Germany, Moscow appears to be on the brink of capture, and in the USA the Lizards reach the outskirts of Chicago. The Race advances on Moscow only to be abruptly stopped by the detonation of a human-made atomic bomb planted as a landmine between Kaluga and Moscow. The story ends with the balance of power in the scope of the conflict dramatically redefined."
}