{
    "book_id": "4183785",
    "mid": "/m/0bnqym",
    "title": "Yoda: Dark Rendezvous",
    "author": "Sean Stewart",
    "publication_date": "",
    "genres": [
        "Science Fiction",
        "Speculative fiction"
    ],
    "text": " The Clone Wars have raged across the galaxy for almost two years, when the Grand Master of the Jedi Order, Yoda, receives a message from Separatist leader Count Dooku. In the message, Dooku concedes to Yoda that things have gotten far out of hand; What began as a political play to keep the Senate honest had turned into a bloodbath, and the time for a truce has come. Dooku invites Yoda to meet him on the planet Vjun, where they would organize the cease-fire. After conferring with his fellow Jedi Masters from the Council, principally Mace Windu, Yoda judges that even if the meeting at Vjun were a feint, the chance to end the war far outweighs the perils of a trap. Yoda decides to send a decoy impersonating himself to a different planet, while he secretly slips off to Vjun. He contracts a famous actor and Yoda impersonator, Palleus Chuff, to pull off the bluff. Disguised as Yoda, Chuff leaves on a very public mission to Ithor. When Chuff's fighter is captured by Dooku's minion Asajj Ventress, who is unaware of the switch, the apparent loss of Yoda comes as a sad blow to the morale of the Republic. Jedi Masters Jai Maruk and Maks Leem journey towards Vjun, accompanied by their Padawans, the under-achieving Tallisibeth Enwandung-Esterhazy (or \"Scout\") and Whie. They make their way slowly, travelling under the false identities of a refugee family, with Yoda disguised as their faithful R2 unit. During one Spaceport layover, Ventress (accompanied by the bumbling but brave Chuff) catches the quintet, and unleashes a dangerous new type of battle droid. While the other Jedi fight the droids and Ventress, Yoda seeks to rescue Chuff. Unfortunately, both Jai Maruk and Maks Leem fall to the terrible droids and Ventress' lightsaber. Yoda, however, diverts Ventress' attention before she gets a chance to kill the young Padawans, and the three Jedi (with Chuff in tow) escape. Meanwhile on Vjun, Count Dooku awaits Yoda in the Château Malreaux, the manor of the long since waned aristocratic clan Malreaux. As the group of Jedi land on Vjun they are forced to separate: Yoda goes to meet with Dooku, and the Padawans follow mysterious disruptions in the Force felt by Whie. Soon, Ventress captures the Padawans. She reveals to Whie that the Château is in fact his house, and the insane house-woman was his mother, Lady \"Whirry\" Malreaux. Meanwhile, Yoda meets with Dooku, and discovers that Dooku's summons is indeed a feint. The two masters engage in a tense debate about the ways of the Force, and reminiscence about Dooku's childhood in the Jedi Temple on Coruscant. In the end, Yoda encourages his former apprentice to leave the dark side and Darth Sidious forever. Dooku, hands shaking, is on the verge of answering when an assistant informs him of Anakin Skywalker and Obi-Wan Kenobi's arrival in the mansion, dispatched there by the Jedi Council, on behalf of Palpatine. Convinced that the legendary duo are replacements for him, Dooku is overcome by jealousy and throws his assistant out the window. Yoda is forced to save Whirry from falling to her death, and then parry Dooku's follow-up lightsaber attack. Even though Dooku wounds him, Yoda, unfazed, does not yield to the dark side. Yoda recovers, and a short lightsaber battle ensues. Before leaping from the window to escape, Dooku tells Yoda of a missile approaching from space, aimed at the house, and everyone in it. Yoda stops the missile, inevitably allowing Dooku and Ventress time to escape."
}